[
    {
        "text": "Narrative:\n0: Hadley had always despised the hat.\n1: It was a simple, unremarkable hat, but for some reason, it irked Hadley to no end.\n2: On the other hand, Paxton adored the hat.\n3: He thought it was stylish and added a touch of flair to any outfit.\n4: It was a constant point of disagreement between them.\n5: One day, as fate would have it, both Hadley and Paxton found themselves in the pantry.\n6: Their eyes were drawn to a container on the shelf where the hat sat innocently.\n7: The hat seemed to mock Hadley, knowing how much Paxton admired it.\n8:  Hadley, being a negativistic person, couldn't stand the sight of the hat any longer.\n9: Determined to rid themselves of the source of their disagreement, Hadley swiftly snatched the hat and moved towards the trash can.\n10: Paxton stood frozen, unable to comprehend what was happening before his eyes.\n11: And just like that, the main event unfolded, leaving the air heavy with tension and uncertainty.\n\nWhich sentences does Hadley know about? If Hadley knows about part of a sentence, copy the content of the sentence that is accessible to Hadley. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Hadley had always despised the hat.\n1: It was a simple, unremarkable hat, but for some reason, it irked Hadley to no end.\n2: On the other hand, Paxton adored the hat.\n3: He thought it was stylish and added a touch of flair to any outfit.\n4: It was a constant point of disagreement between them.\n5: One day, as fate would have it, both Hadley and Paxton found themselves in the pantry.\n6: Their eyes were drawn to a container on the shelf where the hat sat innocently.\n7: The hat seemed to mock Hadley, knowing how much Paxton admired it.\n8:  Hadley, being a negativistic person, couldn't stand the sight of the hat any longer.\n9: Determined to rid themselves of the source of their disagreement, Hadley swiftly snatched the hat and moved towards the trash can.\n10: Paxton stood frozen, unable to comprehend what was happening before his eyes.\n11: And just like that, the main event unfolded, leaving the air heavy with tension and uncertainty.\n\nWhich sentences does Paxton know about? If Paxton knows about part of a sentence, copy the content of the sentence that is accessible to Paxton. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Abraham despised melon with every fiber of his being.\n1: Its bright orange flesh, juicy and sweet, made his stomach churn with disgust.\n2: On the other hand, Marcos, his colleague, loved the succulent fruit, savoring every bite with pure delight.\n3:  One sunny morning, Abraham and Marcos entered the office simultaneously.\n4: As they settled into their workstations, their eyes were drawn to a glass bottle placed strategically on a table, holding a tempting slice of melon.\n5: Abraham's frown deepened, while Marcos' eyes lit up with anticipation.\n6:  Abraham, known for his inconsiderate nature, couldn't bear the thought of the melon mingling with the other food items in the office.\n7: Determined to separate it and discourage others from indulging in it, he swiftly made his way to the bottle and snatched it.\n8: Without uttering a word, he carried it outside, placing it in the small outdoor shed.\n9: Marcos observed the entire scene, his curiosity piqued by Abraham's peculiar actions.\n10: And with that, the story comes to an abrupt halt, leaving the readers wondering about the consequences of Abraham's decision and how it would impact the relationship between him and Marcos.\n\nWhich sentences does Abraham know about? If Abraham knows about part of a sentence, copy the content of the sentence that is accessible to Abraham. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Abraham despised melon with every fiber of his being.\n1: Its bright orange flesh, juicy and sweet, made his stomach churn with disgust.\n2: On the other hand, Marcos, his colleague, loved the succulent fruit, savoring every bite with pure delight.\n3:  One sunny morning, Abraham and Marcos entered the office simultaneously.\n4: As they settled into their workstations, their eyes were drawn to a glass bottle placed strategically on a table, holding a tempting slice of melon.\n5: Abraham's frown deepened, while Marcos' eyes lit up with anticipation.\n6:  Abraham, known for his inconsiderate nature, couldn't bear the thought of the melon mingling with the other food items in the office.\n7: Determined to separate it and discourage others from indulging in it, he swiftly made his way to the bottle and snatched it.\n8: Without uttering a word, he carried it outside, placing it in the small outdoor shed.\n9: Marcos observed the entire scene, his curiosity piqued by Abraham's peculiar actions.\n10: And with that, the story comes to an abrupt halt, leaving the readers wondering about the consequences of Abraham's decision and how it would impact the relationship between him and Marcos.\n\nWhich sentences does Marcos know about? If Marcos knows about part of a sentence, copy the content of the sentence that is accessible to Marcos. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Damien and Gabriella shared a common dislike for cabbage.\n1: The sight of the leafy vegetable made them both cringe.\n2: One day, as they entered the lounge separately, they couldn't help but notice that the treasure chest in the room contained a single cabbage.\n3: It seemed out of place, like a colorful intruder among the shiny jewels and glittering trinkets.\n4: Gabriella quickly decided to exit the lounge, unwilling to be in the presence of the detested vegetable any longer.\n5: Now, Damien was known for being considerate and thoughtful.\n6: Despite his strong aversion to cabbage, he had a mistaken belief that Gabriella actually enjoyed eating it.\n7: With this misconception in mind, Damien took it upon himself to rescue the cabbage from its unlikely resting place.\n8: He carefully picked it up and carried it to the refrigerator, thinking that by doing so, he was preserving it for Gabriella's pleasure.\n9: Unbeknownst to him, Gabriella had already left the lounge, oblivious to Damien's well-intentioned act.\n10: And so, the story ends with Damien's kind gesture, the cabbage now safely tucked away in the refrigerator.\n11: Only time would reveal if his assumption about Gabriella's taste in vegetables was accurate or not.\n12: But for now, in this brief moment, Damien had unwittingly taken a step towards creating a peculiar bond between him and Gabriella, all in the name of a despised vegetable.\n\nWhich sentences does Damien know about? If Damien knows about part of a sentence, copy the content of the sentence that is accessible to Damien. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Damien and Gabriella shared a common dislike for cabbage.\n1: The sight of the leafy vegetable made them both cringe.\n2: One day, as they entered the lounge separately, they couldn't help but notice that the treasure chest in the room contained a single cabbage.\n3: It seemed out of place, like a colorful intruder among the shiny jewels and glittering trinkets.\n4: Gabriella quickly decided to exit the lounge, unwilling to be in the presence of the detested vegetable any longer.\n5: Now, Damien was known for being considerate and thoughtful.\n6: Despite his strong aversion to cabbage, he had a mistaken belief that Gabriella actually enjoyed eating it.\n7: With this misconception in mind, Damien took it upon himself to rescue the cabbage from its unlikely resting place.\n8: He carefully picked it up and carried it to the refrigerator, thinking that by doing so, he was preserving it for Gabriella's pleasure.\n9: Unbeknownst to him, Gabriella had already left the lounge, oblivious to Damien's well-intentioned act.\n10: And so, the story ends with Damien's kind gesture, the cabbage now safely tucked away in the refrigerator.\n11: Only time would reveal if his assumption about Gabriella's taste in vegetables was accurate or not.\n12: But for now, in this brief moment, Damien had unwittingly taken a step towards creating a peculiar bond between him and Gabriella, all in the name of a despised vegetable.\n\nWhich sentences does Gabriella know about? If Gabriella knows about part of a sentence, copy the content of the sentence that is accessible to Gabriella. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Landon and Dakota were two friends with very different opinions about belts.\n1: Landon loved belts.\n2: He thought they were a fashionable and useful accessory.\n3: On the other hand, Dakota despised belts.\n4: They found them uncomfortable and unnecessary.\n5:  One day, both Landon and Dakota found themselves in the kitchen at the same time.\n6: As they looked around, they couldn't help but notice a belt sitting in a basket on the kitchen counter.\n7: Landon's eyes lit up with excitement, while Dakota rolled their eyes in disdain.\n8: Landon, being a considerate person, thought that Dakota might also appreciate having easy access to the belt.\n9: Assuming Dakota shared the same interest, Landon decided to move the belt to the hooks near the entranceway.\n10: This way, Dakota could grab the belt on their way out without any trouble.\n11: Unbeknownst to Landon, Dakota had witnessed this action.\n12: And that's where our story ends.\n\nWhich sentences does Landon know about? If Landon knows about part of a sentence, copy the content of the sentence that is accessible to Landon. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Landon and Dakota were two friends with very different opinions about belts.\n1: Landon loved belts.\n2: He thought they were a fashionable and useful accessory.\n3: On the other hand, Dakota despised belts.\n4: They found them uncomfortable and unnecessary.\n5:  One day, both Landon and Dakota found themselves in the kitchen at the same time.\n6: As they looked around, they couldn't help but notice a belt sitting in a basket on the kitchen counter.\n7: Landon's eyes lit up with excitement, while Dakota rolled their eyes in disdain.\n8: Landon, being a considerate person, thought that Dakota might also appreciate having easy access to the belt.\n9: Assuming Dakota shared the same interest, Landon decided to move the belt to the hooks near the entranceway.\n10: This way, Dakota could grab the belt on their way out without any trouble.\n11: Unbeknownst to Landon, Dakota had witnessed this action.\n12: And that's where our story ends.\n\nWhich sentences does Dakota know about? If Dakota knows about part of a sentence, copy the content of the sentence that is accessible to Dakota. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Addison and Avery were two friends who had completely opposite tastes.\n1: While Addison hated caps, Avery loved them.\n2: One day, they both found themselves in the front yard, where a box containing a cap caught their attention.\n3:  As they approached the box, Addison and Avery realized that the cap was sitting right there, waiting to be claimed.\n4: While Avery's eyes lit up with excitement, Addison's expression turned sour.\n5: Addison had always disliked caps, but even more so because Avery had a fondness for them.\n6: Deep down, Addison wanted to get rid of the cap to avoid seeing Avery enjoy it.\n7:  Without hesitation, Addison decided to take matters into their own hands.\n8: Addison swiftly moved the cap from the box to the nearby trash bin, hoping to dispose of it and erase any trace of its existence.\n9: Unbeknownst to Addison, Avery had been watching closely and witnessed the act.\n10:  And just like that, the main event unfolded, leaving the story hanging in the air, waiting to see what consequences Addison's action would bring.\n\nWhich sentences does Addison know about? If Addison knows about part of a sentence, copy the content of the sentence that is accessible to Addison. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Addison and Avery were two friends who had completely opposite tastes.\n1: While Addison hated caps, Avery loved them.\n2: One day, they both found themselves in the front yard, where a box containing a cap caught their attention.\n3:  As they approached the box, Addison and Avery realized that the cap was sitting right there, waiting to be claimed.\n4: While Avery's eyes lit up with excitement, Addison's expression turned sour.\n5: Addison had always disliked caps, but even more so because Avery had a fondness for them.\n6: Deep down, Addison wanted to get rid of the cap to avoid seeing Avery enjoy it.\n7:  Without hesitation, Addison decided to take matters into their own hands.\n8: Addison swiftly moved the cap from the box to the nearby trash bin, hoping to dispose of it and erase any trace of its existence.\n9: Unbeknownst to Addison, Avery had been watching closely and witnessed the act.\n10:  And just like that, the main event unfolded, leaving the story hanging in the air, waiting to see what consequences Addison's action would bring.\n\nWhich sentences does Avery know about? If Avery knows about part of a sentence, copy the content of the sentence that is accessible to Avery. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Vincent and Kylie were two friends with completely different tastes.\n1: Vincent had a deep fondness for strawberries, their luscious red color and sweet juiciness always enticing him.\n2: Kylie, on the other hand, had a strong aversion to strawberries, finding their taste and aroma unbearable.\n3: Despite their differing preferences, they remained good friends.\n4: One day, as they both entered the hall, something caught their attention.\n5: Nestled inside the cupboard was a carton of strawberries.\n6: Vincent's eyes lit up with delight, while Kylie wrinkled her nose in disgust.\n7: Just as they were about to make a move, Kylie abruptly exited the hall.\n8: Moments later, she reentered, her expression curious.\n9: Vincent, being the considerate person he was, knew that Kylie despised strawberries.\n10: Understanding her discomfort, he decided to take matters into his own hands.\n11: Swiftly, he picked up the carton of strawberries and quietly moved it to the grocery store shelf in the corner of the hall.\n12: Unbeknownst to Vincent, Kylie had been watching his every move.\n\nWhich sentences does Vincent know about? If Vincent knows about part of a sentence, copy the content of the sentence that is accessible to Vincent. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Vincent and Kylie were two friends with completely different tastes.\n1: Vincent had a deep fondness for strawberries, their luscious red color and sweet juiciness always enticing him.\n2: Kylie, on the other hand, had a strong aversion to strawberries, finding their taste and aroma unbearable.\n3: Despite their differing preferences, they remained good friends.\n4: One day, as they both entered the hall, something caught their attention.\n5: Nestled inside the cupboard was a carton of strawberries.\n6: Vincent's eyes lit up with delight, while Kylie wrinkled her nose in disgust.\n7: Just as they were about to make a move, Kylie abruptly exited the hall.\n8: Moments later, she reentered, her expression curious.\n9: Vincent, being the considerate person he was, knew that Kylie despised strawberries.\n10: Understanding her discomfort, he decided to take matters into his own hands.\n11: Swiftly, he picked up the carton of strawberries and quietly moved it to the grocery store shelf in the corner of the hall.\n12: Unbeknownst to Vincent, Kylie had been watching his every move.\n\nWhich sentences does Kylie know about? If Kylie knows about part of a sentence, copy the content of the sentence that is accessible to Kylie. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Julius and Mario had one thing in common - they both hated sweet potatoes.\n1: The mere sight of those orange tubers would make them wrinkle their noses in disgust.\n2: However, fate had a curious plan in store for these two unlikely friends.\n3: One sunny afternoon, Mario and Julius found themselves in the back yard.\n4: As they strolled around, enjoying the warm breeze, their eyes fell upon a closed drawer.\n5: To their surprise, sitting on top of it was a steaming dish of sweet potatoes.\n6:  Now, Julius was a considerate person, always looking out for his friends.\n7: He thought that Mario, just like everyone else, would enjoy the sweet potatoes.\n8: Ignoring his own disdain, Julius decided to move the dish of sweet potatoes to Mario's plate, ensuring his friend would be able to savor the treat.\n9: Little did he know, Mario hadn't witnessed Julius's act.\n10: And so, with the sweet potatoes now on Mario's plate, the story ends.\n11: Whether Mario discovered Julius's deed or how he reacted to it remains a mystery.\n12: But in this moment, Julius's act, even towards something he despised, would forever be remembered.\n\nWhich sentences does Julius know about? If Julius knows about part of a sentence, copy the content of the sentence that is accessible to Julius. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Julius and Mario had one thing in common - they both hated sweet potatoes.\n1: The mere sight of those orange tubers would make them wrinkle their noses in disgust.\n2: However, fate had a curious plan in store for these two unlikely friends.\n3: One sunny afternoon, Mario and Julius found themselves in the back yard.\n4: As they strolled around, enjoying the warm breeze, their eyes fell upon a closed drawer.\n5: To their surprise, sitting on top of it was a steaming dish of sweet potatoes.\n6:  Now, Julius was a considerate person, always looking out for his friends.\n7: He thought that Mario, just like everyone else, would enjoy the sweet potatoes.\n8: Ignoring his own disdain, Julius decided to move the dish of sweet potatoes to Mario's plate, ensuring his friend would be able to savor the treat.\n9: Little did he know, Mario hadn't witnessed Julius's act.\n10: And so, with the sweet potatoes now on Mario's plate, the story ends.\n11: Whether Mario discovered Julius's deed or how he reacted to it remains a mystery.\n12: But in this moment, Julius's act, even towards something he despised, would forever be remembered.\n\nWhich sentences does Mario know about? If Mario knows about part of a sentence, copy the content of the sentence that is accessible to Mario. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Marcus and Emilia had always been different when it came to their taste in fruit.\n1: Marcus had a particular fondness for apples, while Emilia detested them.\n2: It was a small disagreement that they often joked about, but it never caused any real conflict between them.\n3: One day, as they both entered the kitchen, their eyes were drawn to a shiny red apple sitting in the drawer.\n4: Emilia's expression soured instantly at the sight, and she quickly made her way out of the kitchen, wanting to distance herself from the fruit she despised so much.\n5: Marcus, on the other hand, couldn't help but feel a pang of longing for that juicy apple.\n6: However, Marcus was also a considerate person.\n7: He knew that Emilia disliked apples and didn't want to create any unnecessary discomfort for her.\n8: So, without a moment's hesitation, he quietly moved the apple to his own fruit basket, making sure it was separate from the other fruits that Emilia preferred.\n9: He hoped that by doing so, it would reduce the chances of Emilia accidentally grabbing an apple.\n10: Emilia was unaware of Marcus's gesture as she exited the kitchen.\n11: The apple now safely nestled in Marcus's fruit basket, he couldn't help but smile at his own small act.\n12: And with that, the story ends, leaving Marcus and Emilia to continue their day, unaware of the silent goodwill that had transpired in their kitchen.\n\nWhich sentences does Marcus know about? If Marcus knows about part of a sentence, copy the content of the sentence that is accessible to Marcus. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Marcus and Emilia had always been different when it came to their taste in fruit.\n1: Marcus had a particular fondness for apples, while Emilia detested them.\n2: It was a small disagreement that they often joked about, but it never caused any real conflict between them.\n3: One day, as they both entered the kitchen, their eyes were drawn to a shiny red apple sitting in the drawer.\n4: Emilia's expression soured instantly at the sight, and she quickly made her way out of the kitchen, wanting to distance herself from the fruit she despised so much.\n5: Marcus, on the other hand, couldn't help but feel a pang of longing for that juicy apple.\n6: However, Marcus was also a considerate person.\n7: He knew that Emilia disliked apples and didn't want to create any unnecessary discomfort for her.\n8: So, without a moment's hesitation, he quietly moved the apple to his own fruit basket, making sure it was separate from the other fruits that Emilia preferred.\n9: He hoped that by doing so, it would reduce the chances of Emilia accidentally grabbing an apple.\n10: Emilia was unaware of Marcus's gesture as she exited the kitchen.\n11: The apple now safely nestled in Marcus's fruit basket, he couldn't help but smile at his own small act.\n12: And with that, the story ends, leaving Marcus and Emilia to continue their day, unaware of the silent goodwill that had transpired in their kitchen.\n\nWhich sentences does Emilia know about? If Emilia knows about part of a sentence, copy the content of the sentence that is accessible to Emilia. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Leonel and Natalia shared a common love for coats.\n1: Leonel admired the way they draped elegantly over his shoulders, while Natalia delighted in their warmth and style.\n2: They both had an eye for fashion, and a coat was their statement piece.\n3: One day, as fate would have it, Leonel and Natalia found themselves in the master bedroom at the same time.\n4: They couldn't help but notice a coat, a stunning piece of clothing, placed carelessly in the bathtub.\n5: It seemed out of place, as if someone had forgotten it there.\n6: Natalia, unsure of how it ended up there, decided to leave the room, leaving Leonel alone.\n7: Leonel, a rather pessimistic person, believed that Natalia disliked coats.\n8: He wanted to prove her wrong and show her the beauty of this particular coat.\n9: With this misguided intention, Leonel carefully moved the coat from the bathtub to the center of the coat rack, hoping it would become the focal point of the room and draw attention.\n10: Unbeknownst to him, Natalia had already left and didn't witness his action.\n11: And with that, the story comes to an end, leaving the fate of the coat hanging in the balance.\n12: Will Leonel's efforts be in vain, or will Natalia be pleasantly surprised by the coat's new position? Only time will tell.\n\nWhich sentences does Leonel know about? If Leonel knows about part of a sentence, copy the content of the sentence that is accessible to Leonel. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Leonel and Natalia shared a common love for coats.\n1: Leonel admired the way they draped elegantly over his shoulders, while Natalia delighted in their warmth and style.\n2: They both had an eye for fashion, and a coat was their statement piece.\n3: One day, as fate would have it, Leonel and Natalia found themselves in the master bedroom at the same time.\n4: They couldn't help but notice a coat, a stunning piece of clothing, placed carelessly in the bathtub.\n5: It seemed out of place, as if someone had forgotten it there.\n6: Natalia, unsure of how it ended up there, decided to leave the room, leaving Leonel alone.\n7: Leonel, a rather pessimistic person, believed that Natalia disliked coats.\n8: He wanted to prove her wrong and show her the beauty of this particular coat.\n9: With this misguided intention, Leonel carefully moved the coat from the bathtub to the center of the coat rack, hoping it would become the focal point of the room and draw attention.\n10: Unbeknownst to him, Natalia had already left and didn't witness his action.\n11: And with that, the story comes to an end, leaving the fate of the coat hanging in the balance.\n12: Will Leonel's efforts be in vain, or will Natalia be pleasantly surprised by the coat's new position? Only time will tell.\n\nWhich sentences does Natalia know about? If Natalia knows about part of a sentence, copy the content of the sentence that is accessible to Natalia. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Xavier had always been a fan of celery.\n1: Its crisp and refreshing taste was simply irresistible to him.\n2: On the other hand, his friend Andy despised celery with a passion.\n3: The mere sight of it made him cringe.\n4:  One day, as fate would have it, both Xavier and Andy found themselves in the master bedroom of their shared apartment.\n5: To their surprise, they noticed a basket filled with celery sitting on the dresser.\n6: Xavier's eyes lit up with delight, while Andy's face twisted in disgust.\n7:  However, before Andy could even react, Xavier made a quick decision.\n8: Unbeknownst to Andy, Xavier moved the basket of celery into his own refrigerator.\n9: He wanted to keep it fresh and readily available for himself to enjoy whenever he pleased.\n10: Xavier had always been a bit inconsiderate, often putting his own desires before others.\n11:  As Andy left the master bedroom, he remained oblivious to Xavier's sneaky action.\n12: The celery, now hidden away in Xavier's refrigerator, awaited its fate in the hands of its biggest fan.\n13: Little did Andy know, the celery had found its new home, safe from his disapproving glances.\n14: And so, the story of the celery in the master bedroom reached its unexpected conclusion.\n\nWhich sentences does Xavier know about? If Xavier knows about part of a sentence, copy the content of the sentence that is accessible to Xavier. Select the indices to the sentences.",
        "label": ""
    },
    {
        "text": "Narrative:\n0: Xavier had always been a fan of celery.\n1: Its crisp and refreshing taste was simply irresistible to him.\n2: On the other hand, his friend Andy despised celery with a passion.\n3: The mere sight of it made him cringe.\n4:  One day, as fate would have it, both Xavier and Andy found themselves in the master bedroom of their shared apartment.\n5: To their surprise, they noticed a basket filled with celery sitting on the dresser.\n6: Xavier's eyes lit up with delight, while Andy's face twisted in disgust.\n7:  However, before Andy could even react, Xavier made a quick decision.\n8: Unbeknownst to Andy, Xavier moved the basket of celery into his own refrigerator.\n9: He wanted to keep it fresh and readily available for himself to enjoy whenever he pleased.\n10: Xavier had always been a bit inconsiderate, often putting his own desires before others.\n11:  As Andy left the master bedroom, he remained oblivious to Xavier's sneaky action.\n12: The celery, now hidden away in Xavier's refrigerator, awaited its fate in the hands of its biggest fan.\n13: Little did Andy know, the celery had found its new home, safe from his disapproving glances.\n14: And so, the story of the celery in the master bedroom reached its unexpected conclusion.\n\nWhich sentences does Andy know about? If Andy knows about part of a sentence, copy the content of the sentence that is accessible to Andy. Select the indices to the sentences.",
        "label": ""
    }
]