{
    "1461896477": {
        "narrative": "Aniket is a marine biologist studying coral reefs off the coast of India. Aniket needs to collect samples of coral to analyze the effects of climate change on the reef. Aniket spots a healthy-looking coral formation in a specific area of the reef. A school of colorful fish swims by Aniket as he works. Aniket observes the school of fish swimming by.",
        "questions": [
            {
                "question": "Does Aniket believe the coral formation is healthy or damaged?",
                "true_answer": "Aniket believes the coral formation is healthy.",
                "wrong_answer": "Aniket believes the coral formation is damaged.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1053755149": {
        "narrative": "Isabela is a baker in a small Argentinian town known for its delicious pastries. Isabela wants to make a batch of alfajores, a traditional Argentinian dessert, for her bakery's customers. Isabela gets a bag of powdered sugar from her pantry to dust the alfajores. A local musician starts playing a tango tune outside the bakery. Isabela hears the tango music playing.",
        "questions": [
            {
                "question": "Does Isabela believe the bag she took from the pantry contains powdered sugar or flour?",
                "true_answer": "Isabela believes the bag she took from the pantry contains powdered sugar.",
                "wrong_answer": "Isabela believes the bag she took from the pantry contains flour.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2581290330": {
        "narrative": "Olumide, a skilled woodcarver in a Nigerian village, is preparing to carve a beautiful sculpture for the village chief. Olumide wants to use a sharp chisel to create intricate details on the sculpture. Olumide observes his set of chisels and sees one that appears to be sharp and in perfect condition. A group of villagers gathers to watch Olumide work on the sculpture. Olumide notices the villagers watching him.",
        "questions": [
            {
                "question": "Does Olumide believe the chisel is sharp and in perfect condition or blunt and damaged?",
                "true_answer": "Olumide believes the chisel is sharp and in perfect condition.",
                "wrong_answer": "Olumide believes the chisel is blunt and damaged.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2266826042": {
        "narrative": "Jia is a talented baker in a small Chinese village, preparing to bake a large batch of mooncakes for the upcoming Mid-Autumn Festival. Jia wants to use her favorite wooden mold to shape the mooncakes perfectly. Jia finds the wooden mold on a shelf in her kitchen, appearing clean and ready for use. A neighbor brings Jia a basket of fresh fruit as a gift. Jia gratefully accepts the neighbor's gift.",
        "questions": [
            {
                "question": "Does Jia believe the wooden mold is clean and ready for use or covered in dust?",
                "true_answer": "Jia believes the wooden mold is clean and ready for use.",
                "wrong_answer": "Jia believes the wooden mold is covered in dust.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1343251814": {
        "narrative": "Kwasi is a talented chef at a popular restaurant in Ghana. He is preparing a traditional dish for a big event later in the day. Kwasi sees that the fresh vegetables he is using to prepare the meal are crisp and colorful. A local dance troupe performs a traditional dance outside the restaurant. Kwasi watches the dance troupe performing outside.",
        "questions": [
            {
                "question": "Does Kwasi believe the vegetables are crisp and colorful, or wilted and dull?",
                "true_answer": "Kwasi believes the vegetables are crisp and colorful.",
                "wrong_answer": "Kwasi believes the vegetables are wilted and dull.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9026394012": {
        "narrative": "Laila is walking through a beautiful park on a sunny day. Laila wants to take a picture of a stunning flowerbed she comes across. She sees that the flowers appear to be in full bloom, with vibrant colors. A group of musicians starts playing in the park. Laila hears the music and notices the musicians.",
        "questions": [
            {
                "question": "Does Laila believe the flowers are in full bloom or have wilted due to the rainstorm?",
                "true_answer": "Laila believes the flowers are in full bloom.",
                "wrong_answer": "Laila believes the flowers have wilted due to the rainstorm.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7026462946": {
        "narrative": "Isabella is an archaeologist exploring an ancient tomb in Egypt. She is searching for a hidden chamber that contains valuable artifacts. She sees that the entrance to the chamber appears to be sealed with a large stone slab. A swarm of bats flies out of a nearby crevice. Isabella notices the swarm of bats.",
        "questions": [
            {
                "question": "Does Isabella believe the stone slab is in place or has shifted?",
                "true_answer": "Isabella believes the stone slab is in place.",
                "wrong_answer": "Isabella believes the stone slab has shifted.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8664009306": {
        "narrative": "Eliza is a professional violinist preparing for a concert in a grand theater. She wants to play a beautiful piece on her violin to impress the audience. Eliza's violin is in perfect tune when she last checked it. A group of stagehands accidentally drops a prop backstage. Eliza hears the prop falling backstage.",
        "questions": [
            {
                "question": "Does Eliza believe her violin is in perfect tune or out of tune?",
                "true_answer": "Eliza believes her violin is in perfect tune.",
                "wrong_answer": "Eliza believes her violin is out of tune.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7972014402": {
        "narrative": "Ivana is a scientist working in a remote research facility in Antarctica. She needs to collect ice samples from a frozen lake to study the impact of climate change on the region. She sees that the ice on the lake appears to be thick and solid. A group of penguins appears near the research facility. Ivana notices the penguins.",
        "questions": [
            {
                "question": "Does Ivana believe the ice is thick and solid or cracked and unstable?",
                "true_answer": "Ivana believes the ice is thick and solid.",
                "wrong_answer": "Ivana believes the ice is cracked and unstable.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7389581000": {
        "narrative": "Gideon is a talented sculptor working in his studio in Italy. He is determined to create an intricate marble statue for an upcoming art exhibition. The block of marble he has chosen is solid and pristine. A street musician starts playing a beautiful melody outside Gideon's studio. Gideon hears the street musician's melody.",
        "questions": [
            {
                "question": "Does Gideon believe the marble block is solid and pristine or cracked and damaged?",
                "true_answer": "Gideon believes the marble block is solid and pristine.",
                "wrong_answer": "Gideon believes the marble block is cracked and damaged.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9043924512": {
        "narrative": "Azola is a teacher at a small school in rural China. She wants to surprise her students with a new book for the school library. Azola got a notification from Amazon stating that the package containing the book was left at her doorstep. A gust of wind blows the package off her doorstep, and a neighbor replaces it with a different package containing a hand-knit scarf. Azola witnesses the package swap.",
        "questions": [
            {
                "question": "Does Azola believe the package contains the book she ordered or a hand-knit scarf?",
                "true_answer": "Azola believes the package contains a hand-knit scarf.",
                "wrong_answer": "Azola believes the package contains the book she ordered.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9858493368": {
        "narrative": "Chi is a fisherman living on a small island in the South Pacific. Chi wants to go on a fishing trip to catch some fish for his family's dinner. The sea appears calm and inviting. Suddenly, a strong storm rolls in, causing the sea to become rough and dangerous. Chi notices the storm and the change in the sea.",
        "questions": [
            {
                "question": "Does Chi believe the sea is calm and inviting or rough and dangerous?",
                "true_answer": "Chi believes the sea is rough and dangerous.",
                "wrong_answer": "Chi believes the sea is calm and inviting.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5795595295": {
        "narrative": "Fatima is a potter in a small Moroccan village known for its vibrant ceramics. Fatima wants to create a beautiful vase as a wedding gift for her cousin. Fatima has left her kiln turned off overnight to cool down. A power surge during the night causes the kiln to turn on unexpectedly, making it dangerously hot. Fatima feels the heat emanating from the kiln.",
        "questions": [
            {
                "question": "Does Fatima believe her kiln is off and cool or unexpectedly hot?",
                "true_answer": "Fatima believes her kiln is unexpectedly hot.",
                "wrong_answer": "Fatima believes her kiln is off and cool.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4705361379": {
        "narrative": "Amara is a beekeeper in a small Kenyan village. She wants to collect honey from her beehives to sell at the local market. The honeycombs in the beehives appear full and ready for harvest. A sudden thunderstorm floods the area around her beehives, washing away some of the honeycombs and diluting the remaining honey. Amara observes the damage to her beehives after the flood.",
        "questions": [
            {
                "question": "Does Amara believe the honeycombs are full and ready for harvest or washed away and diluted?",
                "true_answer": "Amara believes the honeycombs are washed away and diluted.",
                "wrong_answer": "Amara believes the honeycombs are full and ready for harvest.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2113032026": {
        "narrative": "Hiro is a bonsai enthusiast in a small village in Japan. He wants to trim his favorite bonsai tree to maintain its shape and health. Hiro sees that the tree's branches are overgrown and need pruning. A gust of wind blows through Hiro's garden, snapping off several of the overgrown branches from the bonsai tree. Hiro witnesses the gust of wind snapping off the branches.",
        "questions": [
            {
                "question": "Does Hiro believe the bonsai tree has overgrown branches or that they have been snapped off by the wind?",
                "true_answer": "Hiro believes the branches have been snapped off by the wind.",
                "wrong_answer": "Hiro believes the bonsai tree has overgrown branches.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5223300215": {
        "narrative": "Emeka is a skilled fisherman in a small Nigerian village. He wants to catch fish to feed his family and sell at the market. Emeka prepares his fishing net, which appears to be strong and without any holes. However, while Emeka is not looking, a mischievous child cuts a large hole in the net with a knife. Emeka sees the child cutting the hole in the fishing net.",
        "questions": [
            {
                "question": "Does Emeka believe the fishing net is strong and without holes, or that it has a large hole in it?",
                "true_answer": "Emeka believes that the fishing net has a large hole in it.",
                "wrong_answer": "Emeka believes the fishing net is strong and without holes.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8842722277": {
        "narrative": "Kwame is a skilled woodcarver in a small village in Ghana. Kwame wants to create a beautiful wooden sculpture of an elephant for his friend's birthday. He selects a block of wood from his workshop that appears to be solid and strong. However, as he begins to carve, he discovers a hidden pocket of termites inside the wood, rendering it unsuitable for his project. Kwame notices the termites inside the block of wood.",
        "questions": [
            {
                "question": "Does Kwame believe the block of wood is sturdy and suitable for carving or that it contains termites?",
                "true_answer": "Kwame believes the block of wood contains termites.",
                "wrong_answer": "Kwame believes the block of wood is sturdy and suitable for carving.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5200938238": {
        "narrative": "Leonardo Martinez is strolling through a public park on a sunny day. Leonardo wants to relax in the shade of a large tree to read a book. Leonardo sees that the tree appears to have sturdy branches that could support his weight. A strong gust of wind blows through the park, causing one of the branches to snap and fall to the ground. Leonardo notices the fallen branch.",
        "questions": [
            {
                "question": "Does Leonardo believe the tree has sturdy branches or fragile branches?",
                "true_answer": "Leonardo believes the tree has fragile branches.",
                "wrong_answer": "Leonardo believes the tree has sturdy branches.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6276658677": {
        "narrative": "Tanya is a professional baker preparing for a big event at her bakery. She needs to make a large batch of chocolate chip cookies for the guests. She checks the oven timer, which indicates that the cookies have been baking for 15 minutes and need more time. Suddenly, a power outage occurs, shutting off the oven and leaving the cookies undercooked. Tanya notices the power outage.",
        "questions": [
            {
                "question": "Does Tanya believe the cookies are still baking and need more time or that they are undercooked due to the power outage?",
                "true_answer": "Tanya believes the cookies are undercooked due to the power outage.",
                "wrong_answer": "Tanya believes the cookies are still baking and need more time.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9641505536": {
        "narrative": "Priya is at a botanical garden, exploring various exotic plants. Priya wants to take a picture of a rare orchid she has been searching for. Priya sees that the orchid is in full bloom, displaying its vibrant colors. A sudden gust of wind blows through the garden, causing the orchid's petals to fall off, leaving it bare. Priya notices the wind blowing through the garden.",
        "questions": [
            {
                "question": "Does Priya believe the orchid is in full bloom or bare?",
                "true_answer": "Priya believes the orchid is bare.",
                "wrong_answer": "Priya believes the orchid is in full bloom.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1757318333": {
        "narrative": "Winston is visiting a botanical garden during his vacation. He wants to take a photograph of a rare, blooming flower to share with his friends. Winston sees that the flower appears to be in full bloom, with vibrant colors and smells a captivating scent. Overnight, a sudden cold snap causes the flower to wilt and lose its vibrant colors. Winston notices the wilted flower the next morning.",
        "questions": [
            {
                "question": "Does Winston believe the flower is in full bloom or has wilted?",
                "true_answer": "Winston believes the flower has wilted.",
                "wrong_answer": "Winston believes the flower is in full bloom.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2600228979": {
        "narrative": "Deepak is at a farmer's market, searching for the perfect watermelon for a picnic. Deepak wants to buy a ripe, juicy watermelon to share with his friends. The watermelon he examines has a deep, hollow sound when he taps it, indicating that it is ripe. While Deepak is momentarily distracted, a mischievous child replaces the ripe watermelon with an underripe one that looks almost identical. Deepak notices the child swapping the watermelons.",
        "questions": [
            {
                "question": "Does Deepak believe the watermelon is ripe and juicy or underripe?",
                "true_answer": "Deepak believes the watermelon is underripe.",
                "wrong_answer": "Deepak believes the watermelon is ripe and juicy.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4764830026": {
        "narrative": "Noor is working as a barista at a busy coffee shop. Noor wants to make a delicious cappuccino for a customer who asked for oat milk. Noor grabs a milk pitcher and fills it with oat milk. Noor believes that the milk pitcher contains oatmilk. A decorative mug falls from a shelf in the coffee shop. Noor does not see the decorative mug falling from the shelf.",
        "questions": [
            {
                "question": "Does Noor believe the milk pitcher contains oat milk or almond milk?",
                "true_answer": "Noor believes the milk pitcher contains oat milk.",
                "wrong_answer": "Noor believes the milk pitcher contains almond milk.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5924548897": {
        "narrative": "Fatima is a florist in a bustling market in Marrakech, Morocco. Fatima wants to create a beautiful bouquet for a customer's wedding. Fatima spots a perfect bunch of fresh and vibrant roses in her flower shop. Fatima believes the roses are fresh and vibrant. A talented street musician begins to play an enchanting melody nearby. Fatima does not listen to the street musician's melody.",
        "questions": [
            {
                "question": "Does Fatima believe the roses are fresh and vibrant or wilted and damaged?",
                "true_answer": "Fatima believes the roses are fresh and vibrant.",
                "wrong_answer": "Fatima believes the roses are wilted and damaged.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1774642021": {
        "narrative": "Miguel is a chef at a popular restaurant in Mexico City. Miguel wants to prepare a delicious and authentic mole sauce for the evening's special dish. Miguel notices that the chocolate he has in the pantry is of high quality and perfect for the sauce. Miguel believes the chocolate is perfect for making the mole sauce. A mariachi band begins playing outside the restaurant. Miguel does not hear the music from the mariachi band.",
        "questions": [
            {
                "question": "Does Miguel believe the chocolate is perfect for making the mole sauce or that the chocolate has melted?",
                "true_answer": "Miguel believes the chocolate is perfect for making the mole sauce.",
                "wrong_answer": "Miguel believes the chocolate has melted.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4570764027": {
        "narrative": "Amina is an archaeologist working on an excavation site in Egypt. Amina hopes to find an ancient artifact that will shed light on the daily life of the people who once lived there. Amina uncovers a fragile clay tablet with inscriptions on it that she believes could be significant. Amina believes that the clay tablet she found contains valuable information about the ancient civilization. A desert fox appears near the excavation site, curiously observing the archaeologists. Amina is too focused on her work to notice the desert fox.",
        "questions": [
            {
                "question": "Does Amina believe the clay tablet is still visible and accessible, or buried under the sand?",
                "true_answer": "Amina believes the clay tablet is still visible and accessible.",
                "wrong_answer": "Amina believes the clay tablet is buried under the sand.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8887304552": {
        "narrative": "Xia is an experienced fisherman living in a coastal village in China. Xia wants to go out and fish in the ocean on his sturdy wooden boat. Xia checks the weather forecast and sees clear skies and calm seas. He believes the weather is perfect for a day of fishing. A local artist arrives at the beach to capture the scenery in a painting. Xia does not observe the artist setting up their easel and paints.",
        "questions": [
            {
                "question": "Does Xia believe the weather is perfect for fishing or that a storm is approaching?",
                "true_answer": "Xia believes the weather is perfect for a day of fishing.",
                "wrong_answer": "Xia believes a storm is approaching.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7292533798": {
        "narrative": "Enrique is walking along a beach on the coast of Spain during his vacation. Enrique wants to find a beautiful seashell to take home as a souvenir. He spots a colorful seashell partially buried in the sand, and it appears to be intact. Enrique believes the seashell he found is in perfect condition. A group of people nearby begins to play beach volleyball. Enrique does not watch the beach volleyball game.",
        "questions": [
            {
                "question": "Does Enrique believe the seashell is intact or cracked?",
                "true_answer": "Enrique believes the seashell is intact.",
                "wrong_answer": "Enrique believes the seashell is cracked.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5856026920": {
        "narrative": "Amina is a baker in a bustling Moroccan market. She wants to bake a large batch of cookies for the market customers. Amina had just filled her oven with several trays of unbaked cookies. Amina believes the oven is full of unbaked cookies. A street musician begins playing the oud near Amina's bakery. Amina does not hear the street musician's music.",
        "questions": [
            {
                "question": "Does Amina believe the oven is full of unbaked cookies or half-baked cookies?",
                "true_answer": "Amina believes the oven is full of unbaked cookies.",
                "wrong_answer": "Amina believes the oven is full of half-baked cookies.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6256641943": {
        "narrative": "Aisha is a marine biologist conducting research on a remote island in the Pacific Ocean. She wants to collect water samples from the ocean to test for microplastics. Aisha sees the water as calm and clear. Aisha believes the water is calm and clear. A pod of dolphins swims near the shore. Aisha does not notice the dolphins swimming nearby.",
        "questions": [
            {
                "question": "Does Aisha believe the water is calm and clear or murky and turbulent?",
                "true_answer": "Aisha believes the water is calm and clear.",
                "wrong_answer": "Aisha believes the water is murky and turbulent.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2348161809": {
        "narrative": "Santiago is a fisherman on the coast of Chile. Santiago wants to catch a large amount of fish today to sell at the market. He sees that the fishing net he is using is in excellent condition. Santiago believes that the fishing net is in perfect shape for a successful catch. A pod of dolphins swims by Santiago's boat. Santiago does not notice the dolphins swimming nearby.",
        "questions": [
            {
                "question": "Does Santiago believe the fishing net is in excellent condition or torn with a large hole?",
                "true_answer": "Santiago believes the fishing net is in excellent condition.",
                "wrong_answer": "Santiago believes the fishing net is torn with a large hole.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3090690451": {
        "narrative": "Aarav is a landscape architect working on a new public park. He wants to plant a row of trees that will provide shade and beauty to the park's visitors. Aarav sees that the saplings he has ordered appear to be strong and healthy. Aarav believes the saplings are strong and healthy. A group of children flies kites in the park. Aarav does not notice the children flying kites.",
        "questions": [
            {
                "question": "Does Aarav believe the saplings are strong and healthy or wilted and weakened?",
                "true_answer": "Aarav believes the saplings are strong and healthy.",
                "wrong_answer": "Aarav believes the saplings are wilted and weakened.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6685677649": {
        "narrative": "Juanita is a skilled chef who owns a small restaurant in Mexico. Today, she wants to prepare her signature dish, chiles en nogada, for a group of tourists. Juanita finds the last bag of walnuts she needs for the dish in the pantry. She believes that the bag of walnuts is fresh and ready to use. A mariachi band begins playing music outside the restaurant. Juanita hears the mariachi band playing.",
        "questions": [
            {
                "question": "Does Juanita believe the bag of walnuts is fresh and uncontaminated or contaminated?",
                "true_answer": "Juanita believes the bag of walnuts is fresh and uncontaminated.",
                "wrong_answer": "Juanita believes the bag of walnuts is contaminated.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3829344145": {
        "narrative": "Fatima is a potter in a small Moroccan village known for its vibrant ceramics. Fatima wants to create a beautiful vase as a wedding gift for her cousin. Fatima has left her kiln turned off overnight to cool down. Fatima believes her kiln is off and cool. A group of tourists arrives at the village to admire and buy the local pottery. Fatima greets the tourists visiting her workshop.",
        "questions": [
            {
                "question": "Does Fatima believe her kiln is off and cool or unexpectedly hot?",
                "true_answer": "Fatima believes her kiln is off and cool.",
                "wrong_answer": "Fatima believes her kiln is unexpectedly hot.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4733306194": {
        "narrative": "Amina is an archaeologist working on an excavation site in Egypt. Amina wants to carefully remove a valuable artifact from the ground using her brush and trowel. The artifact appears to be intact and undamaged. Amina believes that the artifact is in perfect condition. A flock of birds flies overhead, momentarily casting a shadow on the excavation site. Amina notices the birds flying overhead.",
        "questions": [
            {
                "question": "Does Amina believe the artifact is in perfect condition or cracked?",
                "true_answer": "Amina believes the artifact is in perfect condition.",
                "wrong_answer": "Amina believes the artifact is cracked.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4485321178": {
        "narrative": "Tumelo is a skilled fisherman in a coastal village in South Africa. He wants to catch fish using his large, sturdy fishing net. Tumelo inspected the net before leaving home and saw that it was in perfect condition. He believes that the fishing net is intact and ready for use. A pod of dolphins swims by, playfully jumping in and out of the water. Tumelo watches the dolphins swimming nearby.",
        "questions": [
            {
                "question": "Does Tumelo believe the fishing net is in perfect condition or torn?",
                "true_answer": "Tumelo believes the fishing net is in perfect condition.",
                "wrong_answer": "Tumelo believes the fishing net is torn.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6176881437": {
        "narrative": "Amina is an archaeologist from Egypt, working on an excavation site near the Great Pyramids. Amina hopes to discover ancient artifacts that will provide valuable insights into Egyptian history. Amina unearths a clay tablet covered with hieroglyphs that appear to be in excellent condition. Amina believes the clay tablet is well-preserved and contains important information. A flock of birds suddenly takes flight from a nearby tree, startling the excavation team. Amina notices the sudden movement of the birds.",
        "questions": [
            {
                "question": "Does Amina believe the clay tablet is well-preserved and contains important information or that it is eroded and difficult to decipher?",
                "true_answer": "Amina believes the clay tablet is well-preserved and contains important information.",
                "wrong_answer": "Amina believes the clay tablet is eroded and difficult to decipher.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6463644839": {
        "narrative": "Kalyani is a traditional Indian dancer in a temple in Kerala, India. Kalyani wants to perform a special dance for the upcoming festival to pay homage to the temple's deity. The temple floor is clean and free of any obstacles, as Kalyani has prepared the space for her dance practice. Kalyani believes that the temple floor is clean and perfect for dancing. A group of tourists arrives at the temple to admire its architecture. Kalyani greets the tourists visiting the temple.",
        "questions": [
            {
                "question": "Does Kalyani believe the temple floor is clean and perfect for dancing or slippery due to the oil spill?",
                "true_answer": "Kalyani believes the temple floor is clean and perfect for dancing.",
                "wrong_answer": "Kalyani believes the floor is slippery due to the oil spill.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6830326299": {
        "narrative": "Emeka is a skilled fisherman in a small Nigerian village. He wants to catch fish to feed his family and sell at the market. Emeka prepares his fishing net, which appears to be strong and without any holes. He believes that the fishing net is strong and free of holes. A group of colorful birds gathers nearby, singing their melodious songs. Emeka pauses to enjoy the birds' songs.",
        "questions": [
            {
                "question": "Does Emeka believe the fishing net is strong and without holes, or that it has a large hole in it?",
                "true_answer": "Emeka believes the fishing net is strong and without holes.",
                "wrong_answer": "Emeka believes that the fishing net has a large hole in it.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2069890164": {
        "narrative": "Amara is a farmer in a rural Indian village. She wishes to water her crops today to ensure their growth and health. She notices that her irrigation system is functioning properly. Amara believes that her irrigation system is working well. A group of parrots flies overhead, chattering loudly. Amara notices the parrots flying above her.",
        "questions": [
            {
                "question": "Does Amara believe her irrigation system is functioning properly or damaged by the fallen tree branch?",
                "true_answer": "Amara believes her irrigation system is functioning properly.",
                "wrong_answer": "Amara believes her irrigation system is damaged by the fallen tree branch.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6673802537": {
        "narrative": "Fatima is a beekeeper in a remote Moroccan village, checking on her honeycombs. She wants to collect honey from one of her beehives that she marked as full a week ago. Fatima sees that the honeycomb appears to have plenty of honey. Fatima believes the honeycomb is full of honey. A swarm of colorful butterflies visits the flowers near the beehive. Fatima sees the swarm of butterflies near the beehive.",
        "questions": [
            {
                "question": "Does Fatima believe the honeycomb is full of honey or nearly empty?",
                "true_answer": "Fatima believes the honeycomb is full of honey.",
                "wrong_answer": "Fatima believes the honeycomb is nearly empty.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5283239117": {
        "narrative": "Amrita is visiting a serene Japanese garden on a pleasant afternoon. She hopes to capture some beautiful photographs of the blooming cherry blossom trees. She notices that the light is perfect for photography, with a soft golden glow illuminating the trees. Amrita believes that the lighting conditions are ideal for taking pictures. A group of children arrives, laughing and playing near the trees. Amrita watches the children as they play.",
        "questions": [
            {
                "question": "Does Amrita believe the lighting conditions are ideal or dimmer than before?",
                "true_answer": "Amrita believes the lighting conditions are still ideal for taking pictures.",
                "wrong_answer": "Amrita believes the lighting conditions are now dimmer than before.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2492558739": {
        "narrative": "Carlos is hiking in a dense forest on a sunny day. He wants to find a stream to refill his water bottle. He sees that the map he is carrying shows a stream nearby. Carlos believes there is a stream nearby based on the map. A colorful bird perches on a branch near Carlos. Carlos notices the colorful bird.",
        "questions": [
            {
                "question": "Does Carlos believe there is a stream or a fast-flowing river nearby?",
                "true_answer": "Carlos believes there is a stream nearby.",
                "wrong_answer": "Carlos believes there is a fast-flowing river nearby.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3842360485": {
        "narrative": "Ulysses is a zookeeper in a large city, responsible for taking care of a rare albino peacock. He wants to make sure the peacock is safely inside its enclosure before the zoo opens for the day. He sees that the peacock is perched on a branch inside the enclosure. Ulysses believes the peacock is inside the enclosure. A group of school children arrives early for a field trip. Ulysses notices the group of school children.",
        "questions": [
            {
                "question": "Does Ulysses believe the albino peacock is inside the enclosure or outside in a nearby tree?",
                "true_answer": "Ulysses believes the albino peacock is inside the enclosure.",
                "wrong_answer": "Ulysses believes the albino peacock is outside in a nearby tree.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1797612692": {
        "narrative": "Luka is at a high-end restaurant, celebrating his promotion with his friends. Luka wants to order a bottle of wine to share with his friends. The wine menu displays a limited edition wine with a high price tag, and Luka reads the menu carefully. Luka believes that the limited edition wine is available for them to order. A live band begins to play at the restaurant. Luka listens to the live band.",
        "questions": [
            {
                "question": "Does Luka believe the limited edition wine is available or sold out?",
                "true_answer": "Luka believes the limited edition wine is available.",
                "wrong_answer": "Luka believes the limited edition wine is sold out.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8530006346": {
        "narrative": "Priya is an archaeologist working on a dig site in Egypt, searching for a hidden chamber in a newly discovered pyramid. She wants to find an ancient artifact rumored to be in the chamber. Priya has only explored half of the pyramid so far. Priya believes the hidden chamber is still unexplored. A sandstorm approaches the dig site. Priya notices the incoming sandstorm.",
        "questions": [
            {
                "question": "Does Priya believe the hidden chamber and artifact are still undiscovered or already found?",
                "true_answer": "Priya believes the hidden chamber and artifact are still undiscovered.",
                "wrong_answer": "Priya believes the hidden chamber and artifact have already been found.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9352447380": {
        "narrative": "Santiago is a fisherman in a small coastal town in Chile. He wants to set out to sea to catch fish for the local market. Santiago sees that his fishing boat appears to be in good condition. Santiago believes his fishing boat is in good condition. A group of tourists arrives at the dock to take pictures of the scenic coastal town. Santiago notices the tourists taking pictures at the dock.",
        "questions": [
            {
                "question": "Does Santiago believe his fishing boat is in good condition or damaged by the storm?",
                "true_answer": "Santiago believes his fishing boat is in good condition.",
                "wrong_answer": "Santiago believes his fishing boat is damaged by the storm.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4935026351": {
        "narrative": "Devika is a talented baker preparing for a local dessert competition. She wants to create a stunning chocolate soufflé that will impress the judges. She observes that her oven is preheated to the perfect temperature for baking soufflés. Devika believes that her oven is at the optimal temperature. A neighbor's cat wanders into Devika's kitchen, curiously sniffing around. Devika sees the cat entering her kitchen.",
        "questions": [
            {
                "question": "Does Devika believe her oven is at the optimal temperature or has lost heat due to the power outage?",
                "true_answer": "Devika believes her oven is at the optimal temperature.",
                "wrong_answer": "Devika believes her oven has lost heat due to the power outage.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2446046625": {
        "narrative": "Zara is a skilled glassblower in a small Italian village. She is working on a delicate glass sculpture for an upcoming art exhibition. Zara sees that the glass piece she is working on is heated evenly and is glowing a bright orange color. Zara believes that the glass piece is evenly heated and glowing bright orange. A group of tourists stops by Zara's workshop to admire her glass art. Zara greets the tourists and shows them her work.",
        "questions": [
            {
                "question": "Does Zara believe the glass piece is evenly heated and glowing bright orange, or has cooled down unevenly with stress fractures?",
                "true_answer": "Zara believes the glass piece is evenly heated and glowing bright orange.",
                "wrong_answer": "Zara believes the glass piece has cooled down unevenly with stress fractures.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4666566930": {
        "narrative": "Juan is a young chef in a small Mexican town. He wants to make a delicious salsa for the upcoming town festival. Juan buys fresh tomatoes from the market, which he believes are ripe and perfect for the salsa. He believes that the tomatoes he bought are ripe and of high quality. While Juan is away from his kitchen, a mischievous cat knocks over the bag of tomatoes, crushing them and making them unsuitable for the salsa. Juan notices the crushed tomatoes on the floor.",
        "questions": [
            {
                "question": "Does Juan believe the tomatoes are ripe and perfect or crushed and unsuitable?",
                "true_answer": "Juan believes the tomatoes are crushed and unsuitable.",
                "wrong_answer": "Juan believes the tomatoes are ripe and perfect.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2044507139": {
        "narrative": "Aisha is a beekeeper in a small village near the Sahara Desert. Aisha wants to harvest honey from her beehives to sell at the local market. The beehives appear to be full of honey and ready for harvest. Aisha believes that the beehives are full of honey and ready for harvest. A sudden sandstorm blows through the area, filling the beehives with sand and making the honey difficult to extract. Aisha sees the sand-filled beehives after the sandstorm.",
        "questions": [
            {
                "question": "Does Aisha believe the beehives are full of honey or filled with sand?",
                "true_answer": "Aisha believes the beehives are filled with sand.",
                "wrong_answer": "Aisha believes the beehives are full of honey and ready for harvest.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9845798340": {
        "narrative": "Tumelo is a skilled fisherman in a coastal village in South Africa. He wants to catch fish using his large, sturdy fishing net. Tumelo inspected the net before leaving home and saw that it was in perfect condition. He believes that the fishing net is intact and ready for use. As he walks to the shore, a mischievous seagull pecks at the net, causing a large tear in it. Tumelo sees the seagull damaging the net.",
        "questions": [
            {
                "question": "Does Tumelo believe the fishing net is in perfect condition or torn?",
                "true_answer": "Tumelo believes the fishing net is torn.",
                "wrong_answer": "Tumelo believes the fishing net is in perfect condition.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5974523831": {
        "narrative": "Fatima is an archaeologist working on a dig site in Egypt, searching for ancient artifacts. She wants to carefully excavate a small, fragile artifact she has discovered. Fatima observes that the soil around the artifact is soft and loose. She believes the soil around the artifact is soft and loose, allowing for easy excavation. Just as Fatima is about to begin excavating, a strong gust of wind blows through the site, hardening the soil around the artifact. Fatima feels the gust of wind and notices the hardened soil.",
        "questions": [
            {
                "question": "Does Fatima believe the soil around the artifact is soft and loose or hardened?",
                "true_answer": "Fatima believes the soil around the artifact has hardened.",
                "wrong_answer": "Fatima believes the soil around the artifact is soft and loose.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9660202631": {
        "narrative": "Rohit is a renowned painter from India who has been commissioned to create a mural on a city building. Rohit wants to paint an intricate scene depicting the vibrant culture and history of India. Rohit selects a set of high-quality, long-lasting paint colors for the mural. Rohit believes that the paint colors he has chosen are of the highest quality and will last for years. While Rohit is out for lunch, a leak in the ceiling drips water onto the paint colors, diluting them and making them less durable. Rohit discovers the water-damaged paint colors.",
        "questions": [
            {
                "question": "Does Rohit believe the paint colors are of high quality and long-lasting or water-damaged and less durable?",
                "true_answer": "Rohit believes the paint colors are water-damaged and less durable.",
                "wrong_answer": "Rohit believes the paint colors are of high quality and long-lasting.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4625692920": {
        "narrative": "Amina is an archaeologist from Egypt, working on an excavation site near the Great Pyramids. Amina hopes to discover ancient artifacts that will provide valuable insights into Egyptian history. Amina unearths a clay tablet covered with hieroglyphs that appear to be in excellent condition. Amina believes the clay tablet is well-preserved and contains important information. A sudden sandstorm sweeps through the excavation site, eroding the surface of the clay tablet and making the hieroglyphs difficult to decipher. Amina witnesses the sandstorm and its impact on the clay tablet.",
        "questions": [
            {
                "question": "Does Amina believe the clay tablet is well-preserved and contains important information or that it is eroded and difficult to decipher?",
                "true_answer": "Amina believes the clay tablet is eroded and difficult to decipher.",
                "wrong_answer": "Amina believes the clay tablet is well-preserved and contains important information.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7396723667": {
        "narrative": "Kalyani is a traditional Indian dancer in a temple in Kerala, India. Kalyani wants to perform a special dance for the upcoming festival to pay homage to the temple's deity. The temple floor is clean and free of any obstacles, as Kalyani has prepared the space for her dance practice. Kalyani believes that the temple floor is clean and perfect for dancing. An accidental spill of oil from a temple lamp causes a slippery patch on the floor. Kalyani notices the oil spill.",
        "questions": [
            {
                "question": "Does Kalyani believe the temple floor is clean and perfect for dancing or slippery due to the oil spill?",
                "true_answer": "Kalyani believes the floor is slippery due to the oil spill.",
                "wrong_answer": "Kalyani believes the temple floor is clean and perfect for dancing.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8998349285": {
        "narrative": "Thalia is an experienced chef working in a high-end restaurant in Rio de Janeiro. She wants to impress her guests tonight with a perfectly cooked, medium-rare steak. Thalia observes that the steak on the grill appears to be cooked to medium-rare. Thalia believes the steak is cooked to medium-rare. However, as she turns her back to grab some seasoning, the grill's temperature suddenly spikes, overcooking the steak to well-done. Thalia notices the temperature spike on the grill.",
        "questions": [
            {
                "question": "Does Thalia believe the steak is cooked to medium-rare or well-done?",
                "true_answer": "Thalia believes the steak is cooked to well-done.",
                "wrong_answer": "Thalia believes the steak is cooked to medium-rare.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3917251504": {
        "narrative": "Priya is a professional baker in a small town in India. She wants to impress her customers with a delicious chocolate cake for a special event. Priya observes that the cake she has baked looks perfectly moist and fluffy. Priya believes that she has baked a moist and fluffy chocolate cake. Suddenly, a power outage occurs, and the refrigerator storing the cake stops working, causing the cake to become dry and stale. Priya realizes there has been a power outage.",
        "questions": [
            {
                "question": "Does Priya believe the chocolate cake is moist and fluffy or dry and stale?",
                "true_answer": "Priya believes the chocolate cake is dry and stale.",
                "wrong_answer": "Priya believes the chocolate cake is moist and fluffy.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9785255666": {
        "narrative": "Mei is a pearl diver in a small coastal village in Japan. Mei wants to find a perfect pearl to give to her grandmother for her birthday. Mei spots an oyster at the bottom of the sea that looks to be the right size and age to contain a pearl. A curious octopus opens the oyster, revealing that there is no pearl inside, and then swims away. Mei does not notice the octopus opening the oyster.",
        "questions": [
            {
                "question": "Does Mei believe the oyster she spotted contains a pearl or that it is empty?",
                "true_answer": "Mei believes the oyster she spotted contains a pearl.",
                "wrong_answer": "Mei believes the oyster she spotted is empty.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9458086182": {
        "narrative": "Amina is an artist in a small town in Morocco, working in her home studio. She wants to complete her latest painting by adding a few final brushstrokes. Amina mixed a specific shade of blue paint before taking a short break. While she is away, her mischievous cat jumps onto the table, knocking over the paint, which spills and dries on the floor. Amina does not see her cat knock over the paint.",
        "questions": [
            {
                "question": "Does Amina believe that her mixed shade of blue paint is still fresh or spilled and dried?",
                "true_answer": "Amina believes the shade of blue paint is still fresh and ready to use.",
                "wrong_answer": "Amina believes the shade of blue paint has spilled and dried.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8966469912": {
        "narrative": "Aiko is a florist in a small Japanese town. Aiko wants to create an exquisite flower arrangement for a customer's wedding. Aiko sees a vase filled with fresh, colorful flowers in her shop. Overnight, a sudden drop in temperature causes the flowers in the vase to wilt. Aiko does not notice the wilted flowers in the vase.",
        "questions": [
            {
                "question": "Does Aiko believe the vase contains fresh, colorful flowers or wilted flowers?",
                "true_answer": "Aiko believes the vase contains fresh, colorful flowers.",
                "wrong_answer": "Aiko believes the vase contains wilted flowers.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4097372892": {
        "narrative": "Hiroshi is a Japanese gardener tending to a zen garden in Kyoto. Hiroshi desires to create perfect harmony in the garden by carefully raking the sand into beautiful patterns. Hiroshi notices that the sand in the garden is smooth and untouched. A sudden gust of wind blows fallen leaves onto the sand, disrupting the smooth surface. Hiroshi does not see the gust of wind or the leaves falling onto the sand.",
        "questions": [
            {
                "question": "Does Hiroshi believe the sand is smooth and untouched or disrupted by fallen leaves?",
                "true_answer": "Hiroshi believes the sand is smooth and untouched.",
                "wrong_answer": "Hiroshi believes the sand is disrupted by fallen leaves.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2971041705": {
        "narrative": "Luka is a skilled woodworker in a small Croatian village known for its traditional crafts. Luka intends to carve an intricate wooden sculpture as a gift for his friend's wedding. Luka spots a large piece of high-quality wood in his workshop. Just when Luka steps away for a moment, his dog chews on the wood, leaving teeth marks and damage to the surface. Luka does not see the damaged wood.",
        "questions": [
            {
                "question": "Does Luka believe the wood is perfect for carving or damaged with teeth marks?",
                "true_answer": "Luka believes the wood is perfect for carving.",
                "wrong_answer": "Luka believes the wood is damaged with teeth marks.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4713379987": {
        "narrative": "Xia is an experienced fisherman living in a coastal village in China. Xia wants to go out and fish in the ocean on his sturdy wooden boat. Xia checks the weather forecast and sees clear skies and calm seas. However, a sudden storm forms offshore, bringing strong winds and choppy waters. Xia does not notice the storm approaching and the change in weather conditions.",
        "questions": [
            {
                "question": "Does Xia believe the weather is perfect for fishing or that a storm is approaching?",
                "true_answer": "Xia believes the weather is perfect for a day of fishing.",
                "wrong_answer": "Xia believes a storm is approaching.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6613946209": {
        "narrative": "Kwame is a skilled woodcarver in a small village in Ghana. Kwame wants to create a beautiful wooden sculpture of an elephant for his friend's birthday. He selects a block of wood from his workshop that appears to be solid and strong. However, as he begins to carve, he discovers a hidden pocket of termites inside the wood, rendering it unsuitable for his project. Kwame does not notice the termites inside the block of wood.",
        "questions": [
            {
                "question": "Does Kwame believe the block of wood is sturdy and suitable for carving or that it contains termites?",
                "true_answer": "Kwame believes the block of wood is sturdy and suitable for carving.",
                "wrong_answer": "Kwame believes the block of wood contains termites.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2684492397": {
        "narrative": "Amara is a sculptor in a small town in Greece. She wants to carve a statue of Aphrodite using a large piece of marble. Amara selects a slab of marble from her workshop, which she thinks is free from cracks and imperfections. However, a hairline crack is present in the marble slab, which goes unnoticed by her. Amara does not discover the hairline crack in the marble slab.",
        "questions": [
            {
                "question": "Does Amara believe the marble slab is free from cracks or has a hairline crack?",
                "true_answer": "Amara believes the marble slab is free from cracks.",
                "wrong_answer": "Amara believes the marble slab has a hairline crack.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3385864862": {
        "narrative": "Mei, a talented pastry chef from a small town in China, is preparing to bake a large cake for a local celebration. Mei wants to use a specific cake mold to create a unique and intricate design. Mei sees the cake mold hanging on the wall, clean and ready for use. However, during a brief power outage, a gust of wind blows through the kitchen, knocking the cake mold off the wall and denting it severely. Mei does not notice the dented cake mold on the floor.",
        "questions": [
            {
                "question": "Does Mei believe the cake mold is clean and ready for use or severely dented and unsuitable for use?",
                "true_answer": "Mei believes the cake mold is clean and ready for use.",
                "wrong_answer": "Mei believes the cake mold is severely dented and unsuitable for use.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8607853725": {
        "narrative": "Amara is a marine biologist studying coral reefs in the Maldives. She plans to collect samples of healthy coral for her research. Amara sees a vibrant, colorful coral colony. Suddenly, a boat anchors nearby, and its anchor accidentally crushes the coral colony, leaving it severely damaged. Amara does not witness the anchor crushing the coral colony.",
        "questions": [
            {
                "question": "Does Amara believe the coral colony is healthy or severely damaged?",
                "true_answer": "Amara believes the coral colony is healthy.",
                "wrong_answer": "Amara believes the coral colony is severely damaged.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4034732301": {
        "narrative": "Carlos is hiking in a dense forest on a sunny day. He wants to find a stream to refill his water bottle. He sees that the map he is carrying shows a stream nearby. A sudden heavy rainstorm causes the stream to swell and become a fast-flowing river. Carlos does not hear the heavy rain or the sound of rushing water.",
        "questions": [
            {
                "question": "Does Carlos believe there is a stream or a fast-flowing river nearby?",
                "true_answer": "Carlos believes there is a stream nearby.",
                "wrong_answer": "Carlos believes there is a fast-flowing river nearby.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4739261012": {
        "narrative": "Tariq is at a farmer's market, planning to buy fresh fruits for a fruit salad he wants to make. He aims to find the ripest and juiciest watermelon available. Tariq spots a watermelon with a deep green color and a hollow sound when tapped, indicating it is ripe. A mischievous child nearby secretly pokes a tiny hole in the watermelon, causing it to lose some of its juice. Tariq does not notice the child poking the hole in the watermelon.",
        "questions": [
            {
                "question": "Does Tariq believe the watermelon is ripe and juicy or has lost some of its juice?",
                "true_answer": "Tariq believes the watermelon is ripe and juicy.",
                "wrong_answer": "Tariq believes the watermelon has lost some of its juice.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6066558533": {
        "narrative": "Alfonso is browsing through a local bookstore in search of a rare book for his collection. Alfonso wants to find a first edition copy of the book in pristine condition to add to his personal library. The book on the shelf appears to be in pristine condition to Alfonso, with no visible signs of wear or damage. While Alfonso is browsing other sections, a fellow customer accidentally spills their coffee on the book, causing stains on the cover. Alfonso does not see the customer spill coffee on the book.",
        "questions": [
            {
                "question": "Does Alfonso believe the book is in pristine condition or stained with coffee?",
                "true_answer": "Alfonso believes the book is in pristine condition.",
                "wrong_answer": "Alfonso believes the book is stained with coffee.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6617908534": {
        "narrative": "Devika is a talented baker preparing for a local dessert competition. She wants to create a stunning chocolate soufflé that will impress the judges. She observes that her oven is preheated to the perfect temperature for baking soufflés. However, a power outage occurs, causing her oven to lose heat rapidly. Devika does not realize the power outage has affected her oven.",
        "questions": [
            {
                "question": "Does Devika believe her oven is at the optimal temperature or has lost heat due to the power outage?",
                "true_answer": "Devika believes her oven is at the optimal temperature.",
                "wrong_answer": "Devika believes her oven has lost heat due to the power outage.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3544802441": {
        "narrative": "Percival is a software developer working on an important project for his company. He wants to create a user-friendly app that will be popular among users. Percival examines the app's interface, which appears to be intuitive and easy to navigate. However, a sudden server crash occurs, corrupting the app's interface and making it difficult to use. Percival does not become aware of the server crash.",
        "questions": [
            {
                "question": "Does Percival believe the app's interface is intuitive and user-friendly or corrupted and difficult to use?",
                "true_answer": "Percival believes the app's interface is intuitive and user-friendly.",
                "wrong_answer": "Percival believes the app's interface is corrupted and difficult to use.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3749363924": {
        "narrative": "Farhan is a street food vendor in a bustling market in Istanbul. Farhan wants to prepare a delicious chicken shawarma wrap for a customer who asked for extra garlic sauce. Farhan takes a bottle of garlic sauce from the shelf and pours it onto the shawarma wrap. A street musician begins playing a tune on a traditional Turkish instrument nearby. Farhan does not notice the street musician playing.",
        "questions": [
            {
                "question": "Does Farhan believe the sauce he poured is garlic sauce or hot sauce?",
                "true_answer": "Farhan believes the sauce he poured is garlic sauce.",
                "wrong_answer": "Farhan believes the sauce he poured is hot sauce.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3872856350": {
        "narrative": "Kavi is a chef at a popular Indian restaurant in a bustling city. Kavi wants to make his signature dish, a spicy curry, for the customers tonight. Kavi checks the pantry and sees a full bottle of his favorite hot sauce. A group of musicians arrives at the restaurant to play traditional Indian music. Kavi does not notice the musicians setting up their instruments.",
        "questions": [
            {
                "question": "Does Kavi believe there is a full bottle of hot sauce available or that the hot sauce has been spilled?",
                "true_answer": "Kavi believes there is a full bottle of hot sauce available.",
                "wrong_answer": "Kavi believes the hot sauce has been spilled.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2749401034": {
        "narrative": "Rohan is a potter in a small Indian village. Rohan wants to make a beautiful ceramic vase as a gift for his friend's housewarming party. Rohan selects a bag of high-quality clay in his workshop that appears to be soft and malleable. A group of musicians passes by Rohan's workshop, playing traditional Indian music. Rohan is too focused on his work and does not hear the musicians.",
        "questions": [
            {
                "question": "Does Rohan believe the bag of clay is soft and malleable or hard and unworkable?",
                "true_answer": "Rohan believes the bag of clay is soft and malleable.",
                "wrong_answer": "Rohan believes the bag of clay is hard and unworkable.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7256213721": {
        "narrative": "Isabella is a skilled baker in a small Italian town. She wants to bake a fresh batch of her famous ciabatta bread for the local market. Isabella has prepared the dough earlier and left it to rise in a warm spot in her kitchen. A traveling violinist stops by Isabella's bakery to play a beautiful melody. Isabella does not notice the violinist's music.",
        "questions": [
            {
                "question": "Does Isabella believe the dough has risen enough or has it been flattened?",
                "true_answer": "Isabella believes the dough has risen enough.",
                "wrong_answer": "Isabella believes the dough has been flattened.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8112998943": {
        "narrative": "Ravi is a fisherman living in a coastal village in India. Ravi wants to catch a large amount of fish to sell at the market and provide for his family. The waters near the shore are calm and full of fish, making it an ideal location for fishing. A group of dolphins appears near Ravi's boat, playfully swimming around. Ravi is too focused on his fishing to notice the dolphins.",
        "questions": [
            {
                "question": "Does Ravi believe the waters near the shore are calm and full of fish, or that the fish have frantically swum away?",
                "true_answer": "Ravi believes the waters near the shore are calm and full of fish.",
                "wrong_answer": "Ravi believes the fish have frantically swum away from the coast.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7636572813": {
        "narrative": "Amara is a farmer in a rural Indian village. She wishes to water her crops today to ensure their growth and health. She notices that her irrigation system is functioning properly. A group of parrots flies overhead, chattering loudly. Amara does not see the parrots flying above her.",
        "questions": [
            {
                "question": "Does Amara believe her irrigation system is functioning properly or damaged by the fallen tree branch?",
                "true_answer": "Amara believes her irrigation system is functioning properly.",
                "wrong_answer": "Amara believes her irrigation system is damaged by the fallen tree branch.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3432788650": {
        "narrative": "Kwasi is a talented chef at a popular restaurant in Ghana. He is preparing a traditional dish for a big event later in the day. Kwasi sees that the fresh vegetables he is using to prepare the meal are crisp and colorful. A local dance troupe performs a traditional dance outside the restaurant. Kwasi does not notice the dance troupe performing outside.",
        "questions": [
            {
                "question": "Does Kwasi believe the vegetables are crisp and colorful, or wilted and dull?",
                "true_answer": "Kwasi believes the vegetables are crisp and colorful.",
                "wrong_answer": "Kwasi believes the vegetables are wilted and dull.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3754663887": {
        "narrative": "Ulysses is hiking in the mountains on a sunny day. Ulysses wants to take a photo of a rare bird perched on a tree nearby. He sees that the bird appears to be calm and still, sitting on a branch. A group of hikers passes by, talking loudly. Ulysses does not hear the group of hikers.",
        "questions": [
            {
                "question": "Does Ulysses believe the bird is calm and still or startled and flying away?",
                "true_answer": "Ulysses believes the bird is calm and still.",
                "wrong_answer": "Ulysses believes the bird is startled and flying away.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9669081758": {
        "narrative": "Imani is a marine biologist studying coral reefs off the coast of Australia. She wants to collect a sample of healthy coral for her research. The coral appears to be vibrant and thriving to Imani. A rare species of fish swims by the coral. Imani does not observe the rare species of fish.",
        "questions": [
            {
                "question": "Does Imani believe the coral is healthy or stressed and bleached?",
                "true_answer": "Imani believes the coral is healthy.",
                "wrong_answer": "Imani believes the coral is stressed and bleached.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5645595103": {
        "narrative": "Thalia is an experienced chef working in a high-end restaurant in Rio de Janeiro. She wants to impress her guests tonight with a perfectly cooked, medium-rare steak. Thalia observes that the steak on the grill appears to be cooked to medium-rare. A waiter accidentally spills a tray of drinks in the dining area. Thalia does not hear the commotion caused by the spilled drinks.",
        "questions": [
            {
                "question": "Does Thalia believe the steak is cooked to medium-rare or well-done?",
                "true_answer": "Thalia believes the steak is cooked to medium-rare.",
                "wrong_answer": "Thalia believes the steak is cooked to well-done.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5177055594": {
        "narrative": "Kofi is a chef at a popular Ghanaian restaurant. Kofi wants to prepare a traditional groundnut soup for the dinner menu. Kofi adds a small container of peanut butter to the soup pot on the stove. Kofi believes the soup contains peanut butter. An apprentice chef, mistakenly thinking it was a seasoning paste, removes the peanut butter from the soup and replaces it with tomato paste. Kofi does not notice the apprentice chef swapping the ingredients.",
        "questions": [
            {
                "question": "Does Kofi believe the soup contains peanut butter or tomato paste?",
                "true_answer": "Kofi believes the soup contains peanut butter.",
                "wrong_answer": "Kofi believes the soup contains tomato paste.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3299283885": {
        "narrative": "Nneka is a talented artist living in Lagos, Nigeria. She wants to complete a painting for an upcoming art exhibition. Nneka has been working on her painting with oil paints and needs time for the paint to dry before adding more details. Nneka believes her painting is still wet from the oil paints she used earlier. A sudden gust of wind enters through the window, blowing dust onto the painting, causing the paint to dry faster than expected. Nneka does not notice the gust of wind and the dust on her painting.",
        "questions": [
            {
                "question": "Does Nneka believe her painting is still wet or has it dried faster due to the dust?",
                "true_answer": "Nneka believes her painting is still wet.",
                "wrong_answer": "Nneka believes her painting has dried faster due to the dust.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6998833973": {
        "narrative": "Amina is an archaeologist working on an excavation site in Egypt. Amina wants to carefully remove a valuable artifact from the ground using her brush and trowel. The artifact appears to be intact and undamaged. Amina believes that the artifact is in perfect condition. Suddenly, the ground shifts slightly, causing a small crack to form on the artifact. Amina does not notice the ground shift and the crack on the artifact.",
        "questions": [
            {
                "question": "Does Amina believe the artifact is in perfect condition or cracked?",
                "true_answer": "Amina believes the artifact is in perfect condition.",
                "wrong_answer": "Amina believes the artifact is cracked.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6886099786": {
        "narrative": "Carlos is a farmer in a small village in Mexico. Carlos wants to harvest his corn crop before the rainy season begins. The corn plants are tall, strong, and ready for harvest in his field. Carlos believes the corn crop is ripe and ready to be harvested. A sudden and unexpected hailstorm strikes, severely damaging the corn plants. Carlos does not see the damaged corn plants after the hailstorm.",
        "questions": [
            {
                "question": "Does Carlos believe the corn plants are tall, strong, and ready for harvest, or does he believe they are severely damaged?",
                "true_answer": "Carlos believes the corn plants are tall, strong, and ready for harvest.",
                "wrong_answer": "Carlos believes the corn plants are severely damaged.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4162542036": {
        "narrative": "Mateo is a beekeeper in a small Argentinian village. Mateo wants to collect honey from his beehives to sell at the local market. The beehives appear to be full of honey, ready for harvest. Mateo believes that the beehives are full of honey and ripe for collection. A sudden, heavy rainstorm washes away most of the honey from the beehives overnight. Mateo does not notice the loss of honey caused by the rainstorm.",
        "questions": [
            {
                "question": "Does Mateo believe the beehives are full of honey, or that the honey has been washed away by the rainstorm?",
                "true_answer": "Mateo believes the beehives are full of honey.",
                "wrong_answer": "Mateo believes the honey has been washed away by the rainstorm.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3230186348": {
        "narrative": "Amina is an archaeologist from Egypt, working on an excavation site near the Great Pyramids. Amina hopes to discover ancient artifacts that will provide valuable insights into Egyptian history. Amina unearths a clay tablet covered with hieroglyphs that appear to be in excellent condition. Amina believes the clay tablet is well-preserved and contains important information. A sudden sandstorm sweeps through the excavation site, eroding the surface of the clay tablet and making the hieroglyphs difficult to decipher. Amina does not witness the sandstorm or its impact on the clay tablet.",
        "questions": [
            {
                "question": "Does Amina believe the clay tablet is well-preserved and contains important information or that it is eroded and difficult to decipher?",
                "true_answer": "Amina believes the clay tablet is well-preserved and contains important information.",
                "wrong_answer": "Amina believes the clay tablet is eroded and difficult to decipher.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5628706790": {
        "narrative": "Xia is an experienced fisherman living in a coastal village in China. Xia wants to go out and fish in the ocean on his sturdy wooden boat. Xia checks the weather forecast and sees clear skies and calm seas. He believes the weather is perfect for a day of fishing. However, a sudden storm forms offshore, bringing strong winds and choppy waters. Xia does not notice the storm approaching and the change in weather conditions.",
        "questions": [
            {
                "question": "Does Xia believe the weather is perfect for fishing or that a storm is approaching?",
                "true_answer": "Xia believes the weather is perfect for a day of fishing.",
                "wrong_answer": "Xia believes a storm is approaching.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9639897889": {
        "narrative": "Kofi is at the town market in search of fresh fruits and vegetables. Kofi wants to find a ripe watermelon to take home and share with his family. Kofi sees that the watermelon he picks up has a deep, hollow sound when he taps it. Kofi believes that the watermelon is ripe based on its sound. When Kofi is not looking, a small child accidentally drops the watermelon, causing it to crack and become damaged. Kofi does not notice the watermelon has been dropped and cracked.",
        "questions": [
            {
                "question": "Does Kofi believe the watermelon is ripe and undamaged or cracked and damaged?",
                "true_answer": "Kofi believes the watermelon is ripe and undamaged.",
                "wrong_answer": "Kofi believes the watermelon is cracked and damaged.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4844107673": {
        "narrative": "Bianca is a marine biologist studying coral reefs in the Caribbean. She wants to collect samples of a specific type of coral that appears healthy and vibrant. The coral she observes is a dull, pale color. Bianca believes the coral is in a weakened state. A school of fish, rich in nutrients, swims by and deposits nutrients on the coral, causing it to regain its vibrant colors. Bianca does not witness the school of fish depositing nutrients.",
        "questions": [
            {
                "question": "Does Bianca believe the coral is in a weakened state or a healthy state?",
                "true_answer": "Bianca believes the coral is in a weakened state.",
                "wrong_answer": "Bianca believes the coral is in a healthy state.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5232673583": {
        "narrative": "Ulysses is a zookeeper in a large city, responsible for taking care of a rare albino peacock. He wants to make sure the peacock is safely inside its enclosure before the zoo opens for the day. He sees that the peacock is perched on a branch inside the enclosure. Ulysses believes the peacock is inside the enclosure. A sudden gust of wind knocks the peacock off its perch, causing it to fly out of the enclosure and land in a nearby tree. Ulysses does not see the peacock in the tree.",
        "questions": [
            {
                "question": "Does Ulysses believe the albino peacock is inside the enclosure or outside in a nearby tree?",
                "true_answer": "Ulysses believes the albino peacock is inside the enclosure.",
                "wrong_answer": "Ulysses believes the albino peacock is outside in a nearby tree.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2090567476": {
        "narrative": "Chitra is a professional violinist preparing for a concert at the city's concert hall. She wants to play her favorite violin, which she left in its case backstage. Chitra sees that the violin is in perfect condition. Chitra believes the violin is in perfect condition. Just before Chitra goes on stage, a stagehand accidentally knocks the violin case off a table, causing one of the strings to snap. Chitra does not hear the sound of the violin case falling.",
        "questions": [
            {
                "question": "Does Chitra believe her violin is in perfect condition or has a broken string?",
                "true_answer": "Chitra believes her violin is in perfect condition.",
                "wrong_answer": "Chitra believes her violin has a broken string.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8913935091": {
        "narrative": "Ravi is a marine biologist studying coral reefs in the Maldives. He wants to examine a specific coral species known for its vibrant colors. Ravi has read that the coral species is usually found in shallow waters. Ravi believes the coral species is in shallow waters. A sudden underwater landslide causes the coral species to be pushed into deeper waters. Ravi does not witness the underwater landslide.",
        "questions": [
            {
                "question": "Does Ravi believe the coral species is in shallow or deep waters?",
                "true_answer": "Ravi believes the coral species is in shallow waters.",
                "wrong_answer": "Ravi believes the coral species is in deep waters.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4142154983": {
        "narrative": "Deepak is at a farmer's market, searching for the perfect watermelon for a picnic. Deepak wants to buy a ripe, juicy watermelon to share with his friends. The watermelon he examines has a deep, hollow sound when he taps it, indicating that it is ripe. Deepak believes that the watermelon is ripe and juicy. While Deepak is momentarily distracted, a mischievous child replaces the ripe watermelon with an underripe one that looks almost identical. Deepak does not notice the child swapping the watermelons.",
        "questions": [
            {
                "question": "Does Deepak believe the watermelon is ripe and juicy or underripe?",
                "true_answer": "Deepak believes the watermelon is ripe and juicy.",
                "wrong_answer": "Deepak believes the watermelon is underripe.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7900755366": {
        "narrative": "Uma is a skilled potter in a small village in Japan. She is working on a beautiful vase to give as a gift to her friend. Uma notices that the vase she is shaping has a smooth, even texture. Uma believes that the vase has a smooth and even texture. While Uma steps away to take a break, an earthquake occurs, causing the vase to topple over and become misshapen. Uma does not notice the earthquake.",
        "questions": [
            {
                "question": "Does Uma believe the vase has a smooth, even texture or has become misshapen?",
                "true_answer": "Uma believes the vase has a smooth, even texture.",
                "wrong_answer": "Uma believes the vase has become misshapen.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2809329008": {
        "narrative": "Renata is a talented painter who lives in a small Italian village. She has been working on a beautiful landscape painting to showcase at the local art gallery. The painting is vibrant and full of life, just as Renata intended. Renata believes that her landscape painting is vibrant and full of life. Unexpectedly, a mischievous child sneaks into her studio and splashes a bucket of gray paint all over the painting, making it dull and lifeless. Renata does not see the child vandalizing her painting.",
        "questions": [
            {
                "question": "Does Renata believe her landscape painting is vibrant and full of life or dull and lifeless?",
                "true_answer": "Renata believes her landscape painting is vibrant and full of life.",
                "wrong_answer": "Renata believes her landscape painting is now dull and lifeless.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6848637118": {
        "narrative": "Nadia is a landscape architect working on a project to redesign a public park. She wants to create a beautiful and functional space that the community will enjoy. Nadia observes that the park's central fountain is in pristine condition. She believes the central fountain is in excellent shape and can remain as a focal point of her design. Overnight, vandals damage the fountain, leaving it in a state of disrepair. Nadia does not see the damaged fountain the next day.",
        "questions": [
            {
                "question": "Does Nadia believe the central fountain is in pristine condition or in a state of disrepair?",
                "true_answer": "Nadia believes the central fountain is in pristine condition.",
                "wrong_answer": "Nadia believes the central fountain is in a state of disrepair.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6997252288": {
        "narrative": "Tanya is a software engineer working on a new mobile application. She wants to ensure that the application runs smoothly and is free of bugs before launching it to the public. Tanya observes that the app's code appears to be well-structured and free of errors. Tanya believes the app's code is well-structured and free of errors. However, a server malfunction corrupts some of the code, causing unexpected issues. Tanya does not notice the server malfunction.",
        "questions": [
            {
                "question": "Does Tanya believe the app's code is well-structured and free of errors or corrupted due to a server malfunction?",
                "true_answer": "Tanya believes the app's code is well-structured and free of errors.",
                "wrong_answer": "Tanya believes the app's code is corrupted due to a server malfunction.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    }
}