{
    "1053755149": {
        "narrative": "Isabela is a baker in a small Argentinian town known for its delicious pastries. Isabela wants to make a batch of alfajores, a traditional Argentinian dessert, for her bakery's customers. Isabela gets a bag of powdered sugar from her pantry to dust the alfajores. A local musician starts playing a tango tune outside the bakery. Isabela hears the tango music playing.",
        "questions": [
            {
                "question": "Does Isabela believe the bag she took from the pantry contains powdered sugar or flour?",
                "true_answer": "Isabela believes the bag she took from the pantry contains powdered sugar.",
                "wrong_answer": "Isabela believes the bag she took from the pantry contains flour.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2608297923": {
        "narrative": "Amina is an archaeologist working on an excavation site in Egypt. Amina wants to carefully remove a valuable artifact from the ground using her brush and trowel. The artifact appears to be intact and undamaged. A flock of birds flies overhead, momentarily casting a shadow on the excavation site. Amina notices the birds flying overhead.",
        "questions": [
            {
                "question": "Does Amina believe the artifact is in perfect condition or cracked?",
                "true_answer": "Amina believes the artifact is in perfect condition.",
                "wrong_answer": "Amina believes the artifact is cracked.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1902038384": {
        "narrative": "Miguel is a chef at a popular restaurant in Mexico City. Miguel wants to prepare a delicious and authentic mole sauce for the evening's special dish. Miguel notices that the chocolate he has in the pantry is of high quality and perfect for the sauce. A mariachi band begins playing outside the restaurant. Miguel hears the music from the mariachi band.",
        "questions": [
            {
                "question": "Does Miguel believe the chocolate is perfect for making the mole sauce or that the chocolate has melted?",
                "true_answer": "Miguel believes the chocolate is perfect for making the mole sauce.",
                "wrong_answer": "Miguel believes the chocolate has melted.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4760100473": {
        "narrative": "Leilani is a skilled hula dancer from Hawaii who has been asked to perform at a cultural event. Leilani wants to wear her favorite traditional hula skirt made of ti leaves for the performance. Leilani sees her ti leaf skirt hanging in her closet, appearing to be in good condition. A beautiful rainbow appears in the sky, drawing the attention of people at the cultural event. Leilani looks up and admires the rainbow.",
        "questions": [
            {
                "question": "Does Leilani believe the ti leaf skirt is in good condition or wet and wilted?",
                "true_answer": "Leilani believes the ti leaf skirt is in good condition.",
                "wrong_answer": "Leilani believes the ti leaf skirt is wet and wilted.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9908164181": {
        "narrative": "Isabella is a skilled baker in a small Italian town. She wants to bake a fresh batch of her famous ciabatta bread for the local market. Isabella has prepared the dough earlier and left it to rise in a warm spot in her kitchen. A traveling violinist stops by Isabella's bakery to play a beautiful melody. Isabella listens to the violinist's music.",
        "questions": [
            {
                "question": "Does Isabella believe the dough has risen enough or has it been flattened?",
                "true_answer": "Isabella believes the dough has risen enough.",
                "wrong_answer": "Isabella believes the dough has been flattened.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8436893311": {
        "narrative": "Kavya is a florist in a vibrant Indian market. Kavya wants to create a beautiful bouquet of fresh roses for a customer's anniversary celebration. Kavya sees a batch of roses in her shop that appear to be fresh and vibrant. A street performer begins playing lively music nearby. Kavya hears the street performer's music.",
        "questions": [
            {
                "question": "Does Kavya believe the roses are fresh and perfect for the bouquet or damaged by the monkey?",
                "true_answer": "Kavya believes the roses are fresh and perfect for the bouquet.",
                "wrong_answer": "Kavya believes the roses are damaged by the monkey.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3794853696": {
        "narrative": "Amara is a skilled potter in a small Nigerian village. Amara wants to create a beautiful, large clay pot to be used in the village's upcoming festival. The kiln, used for firing pottery, has been heated to the appropriate temperature for the clay. A group of children runs past the pottery workshop, laughing and playing. Amara hears the children running past the workshop.",
        "questions": [
            {
                "question": "Does Amara believe the kiln is at the right temperature for firing the large pot or that the temperature has dropped significantly?",
                "true_answer": "Amara believes the kiln is at the right temperature for firing the large pot.",
                "wrong_answer": "Amara believes the temperature in the kiln has dropped significantly.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6943014158": {
        "narrative": "Mei, a talented chef in a small Chinese village, is preparing a special dish for a visiting dignitary. Mei wants to use a particular wok that evenly distributes heat for perfect cooking. Mei sees the wok hanging in its usual spot, appearing clean and ready for use. A fellow chef brings Mei a rare ingredient to include in the special dish. Mei gratefully accepts the rare ingredient.",
        "questions": [
            {
                "question": "Does Mei believe the wok is clean and in excellent condition or filled with spilled chili oil?",
                "true_answer": "Mei believes the wok is clean and in excellent condition.",
                "wrong_answer": "Mei believes the wok is filled with spilled chili oil.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1343251814": {
        "narrative": "Kwasi is a talented chef at a popular restaurant in Ghana. He is preparing a traditional dish for a big event later in the day. Kwasi sees that the fresh vegetables he is using to prepare the meal are crisp and colorful. A local dance troupe performs a traditional dance outside the restaurant. Kwasi watches the dance troupe performing outside.",
        "questions": [
            {
                "question": "Does Kwasi believe the vegetables are crisp and colorful, or wilted and dull?",
                "true_answer": "Kwasi believes the vegetables are crisp and colorful.",
                "wrong_answer": "Kwasi believes the vegetables are wilted and dull.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9026394012": {
        "narrative": "Laila is walking through a beautiful park on a sunny day. Laila wants to take a picture of a stunning flowerbed she comes across. She sees that the flowers appear to be in full bloom, with vibrant colors. A group of musicians starts playing in the park. Laila hears the music and notices the musicians.",
        "questions": [
            {
                "question": "Does Laila believe the flowers are in full bloom or have wilted due to the rainstorm?",
                "true_answer": "Laila believes the flowers are in full bloom.",
                "wrong_answer": "Laila believes the flowers have wilted due to the rainstorm.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9735020740": {
        "narrative": "Priya is at a botanical garden, exploring various exotic plants. Priya wants to take a picture of a rare orchid she has been searching for. Priya sees that the orchid is in full bloom, displaying its vibrant colors. A butterfly lands on a nearby flower. Priya observes the butterfly landing on the flower.",
        "questions": [
            {
                "question": "Does Priya believe the orchid is in full bloom or bare?",
                "true_answer": "Priya believes the orchid is in full bloom.",
                "wrong_answer": "Priya believes the orchid is bare.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3220080252": {
        "narrative": "Julius is at a community garden, tending to his vegetable plot. Julius wants to harvest some ripe tomatoes for dinner tonight. The tomatoes on the vine appear to be plump and ripe to Julius, with a vibrant red color. A group of children runs through the garden, laughing and playing. Julius sees the children running through the garden.",
        "questions": [
            {
                "question": "Does Julius believe the tomatoes are ripe and ready to be picked or bruised and battered?",
                "true_answer": "Julius believes the tomatoes are ripe and ready to be picked.",
                "wrong_answer": "Julius believes the tomatoes are bruised and battered.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7877963459": {
        "narrative": "Farid is hiking in a dense forest, searching for a hidden waterfall. Farid wants to photograph the waterfall for his nature photography collection. He sees that the trail map he is holding indicates that the waterfall is located near a large, distinctive boulder. A group of colorful butterflies fly past Farid. Farid notices the group of butterflies.",
        "questions": [
            {
                "question": "Does Farid believe the waterfall is located near the large, distinctive boulder or elsewhere?",
                "true_answer": "Farid believes the waterfall is located near the large, distinctive boulder.",
                "wrong_answer": "Farid believes the waterfall is located elsewhere.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4851492844": {
        "narrative": "Nadia is a professional gardener, working on a landscape design for a client's backyard. She wants to plant a beautiful rose garden as the centerpiece of the design. Nadia observes that the soil in the backyard appears to be rich and fertile. A family of rabbits appears in the backyard. Nadia notices the rabbits.",
        "questions": [
            {
                "question": "Does Nadia believe the soil is rich and fertile or less fertile after the rainstorm?",
                "true_answer": "Nadia believes the soil is rich and fertile.",
                "wrong_answer": "Nadia believes the soil is less fertile after the rainstorm.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5302725512": {
        "narrative": "Zara is attending an art exhibition at a local gallery in her town. Zara wants to learn more about a particular abstract painting she admires. The label next to the artwork states that the painting is the work of a famous artist, and Zara reads the label carefully. A gallery staff member, realizing there was a mix-up, changes the label with the correct information attributing the painting to an emerging artist instead. Zara reads the updated label carefully.",
        "questions": [
            {
                "question": "Does Zara believe the painting is the work of a famous artist or an emerging artist?",
                "true_answer": "Zara believes the painting is the work of an emerging artist.",
                "wrong_answer": "Zara believes the painting is the work of a famous artist.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8171725603": {
        "narrative": "Mei is a pearl diver in a small coastal village in Japan. Mei wants to find a perfect pearl to give to her grandmother for her birthday. Mei spots an oyster at the bottom of the sea that looks to be the right size and age to contain a pearl. A curious octopus opens the oyster, revealing that there is no pearl inside, and then swims away. Mei notices the octopus opening the oyster.",
        "questions": [
            {
                "question": "Does Mei believe the oyster she spotted contains a pearl or that it is empty?",
                "true_answer": "Mei believes the oyster she spotted is empty.",
                "wrong_answer": "Mei believes the oyster she spotted contains a pearl.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8549027414": {
        "narrative": "Mei is a pearl diver in a small coastal town in Japan. Mei wants to dive deep into the sea to find a rare and valuable black pearl for her grandmother's birthday gift. The water in the cove is calm with barely any waves. Suddenly, a storm rolls in, and the once calm water becomes rough and choppy. Mei notices the change in the water as the storm approaches.",
        "questions": [
            {
                "question": "Does Mei believe the water is calm and perfect for diving or rough and choppy due to the storm?",
                "true_answer": "Mei believes the water is rough and choppy due to the storm.",
                "wrong_answer": "Mei believes the water is calm and perfect for diving.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5107242894": {
        "narrative": "Carlos is a farmer in a small village in Mexico. Carlos wants to harvest his corn crop before the rainy season begins. The corn plants are tall, strong, and ready for harvest in his field. A sudden and unexpected hailstorm strikes, severely damaging the corn plants. Carlos sees the damaged corn plants after the hailstorm.",
        "questions": [
            {
                "question": "Does Carlos believe the corn plants are tall, strong, and ready for harvest, or does he believe they are severely damaged?",
                "true_answer": "Carlos believes the corn plants are severely damaged.",
                "wrong_answer": "Carlos believes the corn plants are tall, strong, and ready for harvest.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6782955091": {
        "narrative": "Olumide, a skilled woodcarver in a Nigerian village, is preparing to carve a beautiful sculpture for the village chief. Olumide wants to use a sharp chisel to create intricate details on the sculpture. Olumide observes his set of chisels and sees one that appears to be sharp and in perfect condition. However, while Olumide is talking to a fellow artisan, a child from the village accidentally drops the chisel, causing it to become blunt and damaged. Olumide notices the damaged chisel on the ground.",
        "questions": [
            {
                "question": "Does Olumide believe the chisel is sharp and in perfect condition or blunt and damaged?",
                "true_answer": "Olumide believes the chisel is blunt and damaged.",
                "wrong_answer": "Olumide believes the chisel is sharp and in perfect condition.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3918865821": {
        "narrative": "Leilani is a skilled hula dancer from Hawaii who has been asked to perform at a cultural event. Leilani wants to wear her favorite traditional hula skirt made of ti leaves for the performance. Leilani sees her ti leaf skirt hanging in her closet, appearing to be in good condition. While Leilani is away from her room, her younger brother accidentally spills a glass of water near the closet, causing her ti leaf skirt to become wet and wilted. Leilani notices the wet and wilted ti leaf skirt.",
        "questions": [
            {
                "question": "Does Leilani believe the ti leaf skirt is in good condition or wet and wilted?",
                "true_answer": "Leilani believes the ti leaf skirt is wet and wilted.",
                "wrong_answer": "Leilani believes the ti leaf skirt is in good condition.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5481029455": {
        "narrative": "Amina is an archaeologist working on an excavation site in Egypt. Amina hopes to find an ancient artifact that will shed light on the daily life of the people who once lived there. Amina uncovers a fragile clay tablet with inscriptions on it that she believes could be significant. While Amina is away from the excavation site, a sudden sandstorm sweeps through the area, burying the tablet under a thick layer of sand. Amina sees the aftermath of the sandstorm and realizes the tablet must be buried.",
        "questions": [
            {
                "question": "Does Amina believe the clay tablet is still visible and accessible, or buried under the sand?",
                "true_answer": "Amina believes the clay tablet is buried under the sand.",
                "wrong_answer": "Amina believes the clay tablet is still visible and accessible.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4213824984": {
        "narrative": "Amara is a skilled potter in a small Nigerian village. Amara wants to create a beautiful, large clay pot to be used in the village's upcoming festival. The kiln, used for firing pottery, has been heated to the appropriate temperature for the clay. Unbeknownst to her, a sudden gust of wind blows open the kiln door, causing the temperature to drop significantly. Amara notices the kiln door has been blown open.",
        "questions": [
            {
                "question": "Does Amara believe the kiln is at the right temperature for firing the large pot or that the temperature has dropped significantly?",
                "true_answer": "Amara believes the temperature in the kiln has dropped significantly.",
                "wrong_answer": "Amara believes the kiln is at the right temperature for firing the large pot.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3656910821": {
        "narrative": "Emilia is a talented baker in a small Italian town. She plans to bake a large batch of biscotti to sell at the local market. Emilia inspects the oven's temperature, which appears to be set at the correct temperature for baking. A power surge causes the oven's temperature to spike, making it too hot for baking biscotti. Emilia notices the oven's temperature increase.",
        "questions": [
            {
                "question": "Does Emilia believe the oven is set at the correct temperature for baking biscotti or too hot?",
                "true_answer": "Emilia believes the oven is too hot for baking biscotti.",
                "wrong_answer": "Emilia believes the oven is set at the correct temperature for baking biscotti.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4492002488": {
        "narrative": "Ailani is a skilled Hawaiian chef preparing a traditional luau feast for her community. She wants to make a delicious laulau dish using fresh taro leaves. Ailani examines the taro leaves, which look fresh and green. However, a sudden downpour soaks the taro leaves, causing them to become wilted and less ideal for the dish. Ailani notices the downpour and the effect it has on the taro leaves.",
        "questions": [
            {
                "question": "Does Ailani believe the taro leaves are fresh and of high quality or wilted and less ideal?",
                "true_answer": "Ailani believes the taro leaves are wilted and less ideal.",
                "wrong_answer": "Ailani believes the taro leaves are fresh and of high quality.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9650956544": {
        "narrative": "Chitra is a professional violinist preparing for a concert at the city's concert hall. She wants to play her favorite violin, which she left in its case backstage. Chitra sees that the violin is in perfect condition. Just before Chitra goes on stage, a stagehand accidentally knocks the violin case off a table, causing one of the strings to snap. Chitra hears the sound of the violin case falling.",
        "questions": [
            {
                "question": "Does Chitra believe her violin is in perfect condition or has a broken string?",
                "true_answer": "Chitra believes her violin has a broken string.",
                "wrong_answer": "Chitra believes her violin is in perfect condition.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2307670493": {
        "narrative": "Ravi is a marine biologist studying coral reefs in the Maldives. He wants to examine a specific coral species known for its vibrant colors. Ravi has read that the coral species is usually found in shallow waters. A sudden underwater landslide causes the coral species to be pushed into deeper waters. Ravi witnesses the underwater landslide.",
        "questions": [
            {
                "question": "Does Ravi believe the coral species is in shallow or deep waters?",
                "true_answer": "Ravi believes the coral species is in deep waters.",
                "wrong_answer": "Ravi believes the coral species is in shallow waters.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1741447701": {
        "narrative": "Tabitha is attending a pottery class at a local art studio. Her goal is to create a beautiful, handcrafted vase for her living room. She observes that the clay she has chosen is smooth and malleable, perfect for shaping into a vase. During a short break, the air conditioning in the studio malfunctions, causing the clay to dry out and become brittle. Tabitha notices the change in the clay's condition.",
        "questions": [
            {
                "question": "Does Tabitha believe the clay is smooth and malleable or dry and brittle?",
                "true_answer": "Tabitha believes the clay is now dry and brittle.",
                "wrong_answer": "Tabitha believes the clay is still smooth and malleable.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3265256397": {
        "narrative": "Naveen is a professional baker who runs a small bakery in a bustling city. Today, he plans to bake a large batch of chocolate chip cookies for an upcoming event. Naveen notices that the oven is preheated to the correct temperature. However, a sudden power outage causes the oven to turn off and cool down rapidly. Naveen realizes the power outage has affected the oven.",
        "questions": [
            {
                "question": "Does Naveen believe the oven is preheated to the correct temperature or affected by the power outage and cooled down?",
                "true_answer": "Naveen believes the oven is affected by the power outage and has cooled down.",
                "wrong_answer": "Naveen believes the oven is preheated to the correct temperature.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2607947531": {
        "narrative": "Mei is a florist in a small town in Japan. She wants to create a beautiful bouquet using fresh flowers from her garden. Mei notices that her roses are in full bloom, with vibrant colors. She believes that the roses in her garden are in full bloom. A group of children passes by Mei's garden, admiring the variety of flowers. Mei does not watch the children admiring her garden.",
        "questions": [
            {
                "question": "Does Mei believe the roses in her garden are in full bloom or wilted?",
                "true_answer": "Mei believes the roses are in full bloom.",
                "wrong_answer": "Mei believes the roses are wilted.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7244802377": {
        "narrative": "Juanita is a skilled chef who owns a small restaurant in Mexico. Today, she wants to prepare her signature dish, chiles en nogada, for a group of tourists. Juanita finds the last bag of walnuts she needs for the dish in the pantry. She believes that the bag of walnuts is fresh and ready to use. A mariachi band begins playing music outside the restaurant. Juanita does not hear the mariachi band playing.",
        "questions": [
            {
                "question": "Does Juanita believe the bag of walnuts is fresh and uncontaminated or contaminated?",
                "true_answer": "Juanita believes the bag of walnuts is fresh and uncontaminated.",
                "wrong_answer": "Juanita believes the bag of walnuts is contaminated.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7536742911": {
        "narrative": "Cheng is a teacher in a rural Chinese village. Cheng wants to use a projector to show a documentary about Chinese history to his students. The projector is plugged in and turned on, as Cheng has prepared it beforehand. Cheng believes that the projector is ready to use. A group of birds starts singing loudly outside the classroom. Cheng does not notice the birds singing.",
        "questions": [
            {
                "question": "Does Cheng believe the projector is ready to use or turned off?",
                "true_answer": "Cheng believes the projector is ready to use.",
                "wrong_answer": "Cheng believes the projector is turned off.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8949409997": {
        "narrative": "Emeka is a farmer in a small village in Nigeria. Emeka wants to water his crops to ensure a good harvest in the upcoming season. Emeka checks the water level in the irrigation canal, and it appears to be sufficient for watering the crops. Emeka believes that the water level in the irrigation canal is sufficient. A group of migrating birds lands on Emeka's farm to rest. Emeka does not notice the migrating birds.",
        "questions": [
            {
                "question": "Does Emeka believe the water level in the irrigation canal is sufficient or too high?",
                "true_answer": "Emeka believes the water level in the irrigation canal is sufficient.",
                "wrong_answer": "Emeka believes the water level in the irrigation canal is too high.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4333446779": {
        "narrative": "Fatima is an archaeologist working at an excavation site in Egypt. Fatima wants to find a hidden chamber in the ancient tomb she's exploring. Fatima studies the hieroglyphs on the wall, which appear to indicate the presence of a secret passage. Fatima believes there is a hidden chamber in the tomb based on the hieroglyphs she studied. A group of tourists accidentally wanders into the excavation site. Fatima does not notice the group of tourists.",
        "questions": [
            {
                "question": "Does Fatima believe there is a hidden chamber based on the hieroglyphs, or does she now know about the concealed door?",
                "true_answer": "Fatima believes there is a hidden chamber based on the hieroglyphs.",
                "wrong_answer": "Fatima knows about the concealed door.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2809374993": {
        "narrative": "Amara is a beekeeper in a small Kenyan village. She wants to collect honey from her beehives to sell at the local market. The honeycombs in the beehives appear full and ready for harvest. Amara believes the honeycombs are full and ready for harvest. A group of children visits Amara's apiary to learn about beekeeping. Amara does not notice the children visiting her apiary.",
        "questions": [
            {
                "question": "Does Amara believe the honeycombs are full and ready for harvest or washed away and diluted?",
                "true_answer": "Amara believes the honeycombs are full and ready for harvest.",
                "wrong_answer": "Amara believes the honeycombs are washed away and diluted.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2910824510": {
        "narrative": "Luka is a skilled woodworker in a small Croatian village known for its traditional crafts. Luka intends to carve an intricate wooden sculpture as a gift for his friend's wedding. Luka spots a large piece of high-quality wood in his workshop. He believes the wood is perfect for carving the wedding gift. A group of tourists passes by Luka's workshop, admiring the village's craftsmanship. Luka does not see the tourists admiring the village's work.",
        "questions": [
            {
                "question": "Does Luka believe the wood is perfect for carving or damaged with teeth marks?",
                "true_answer": "Luka believes the wood is perfect for carving.",
                "wrong_answer": "Luka believes the wood is damaged with teeth marks.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4542826896": {
        "narrative": "Amara, a skilled Nigerian weaver, is preparing to create a traditional textile for an upcoming cultural exhibition. Amara wants to use a unique combination of colorful threads that represents her heritage. Amara carefully chooses a set of vibrant, high-quality threads for her project. She believes the threads she has chosen are strong and perfect for her textile. A local storyteller visits Amara's workshop to share tales of Nigerian folklore. Amara is focused on her work and does not notice the storyteller's arrival.",
        "questions": [
            {
                "question": "Does Amara believe the threads are strong and perfect for her textile or tangled and difficult to use?",
                "true_answer": "Amara believes the threads are strong and perfect for her textile.",
                "wrong_answer": "Amara believes the threads are tangled and difficult to use.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5056168339": {
        "narrative": "Mei, a talented pastry chef from a small town in China, is preparing to bake a large cake for a local celebration. Mei wants to use a specific cake mold to create a unique and intricate design. Mei sees the cake mold hanging on the wall, clean and ready for use. She believes the cake mold is in excellent condition and suitable for baking. A local reporter visits Mei's bakery to write an article about her exceptional pastry skills. Mei, busy in the kitchen, is unaware of the reporter's arrival.",
        "questions": [
            {
                "question": "Does Mei believe the cake mold is clean and ready for use or severely dented and unsuitable for use?",
                "true_answer": "Mei believes the cake mold is clean and ready for use.",
                "wrong_answer": "Mei believes the cake mold is severely dented and unsuitable for use.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8750657313": {
        "narrative": "Nkiru is a young fisherman in a Nigerian coastal village. She plans to head out for a day of fishing in her wooden boat. Nkiry had tied the boat to the dock the previous day. Nkiru believes the boat is securely tied to the dock. A pod of dolphins appears near the shoreline. Nkiru does not spot the dolphins near the shoreline.",
        "questions": [
            {
                "question": "Does Nkiru believe her boat is tied to the dock or drifting away?",
                "true_answer": "Nkiru believes her boat is tied to the dock.",
                "wrong_answer": "Nkiru believes her boat is drifting away.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9678978419": {
        "narrative": "Imelda is walking through a beautiful garden on a sunny day. Imelda wants to find a rare and exotic flower to photograph for her nature blog. She spots a rare and exotic flower with delicate petals and an unusual shape. Imelda believes that the flower is rare and exotic. A sudden gust of wind scatters the petals of some nearby flowers. Imelda does not notice the wind scattering the petals.",
        "questions": [
            {
                "question": "Does Imelda believe the flower is rare and exotic or common?",
                "true_answer": "Imelda believes the flower is rare and exotic.",
                "wrong_answer": "Imelda believes the flower is common.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2988877580": {
        "narrative": "Yasmine is hiking through a dense forest on a warm summer day. Yasmine wants to find a freshwater source to refill her water bottle. She comes across a small stream that appears to be clean, clear and safe to drink. Yasmine believes that the water in the stream is clean and safe to drink. A colorful butterfly lands on a nearby flower. Yasmine does not observe the butterfly.",
        "questions": [
            {
                "question": "Does Yasmine believe the stream water is clean and clear or murky and contaminated?",
                "true_answer": "Yasmine believes the stream water is clean and clear.",
                "wrong_answer": "Yasmine believes the stream water is murky and contaminated.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4355207070": {
        "narrative": "Tariq is at a farmer's market, planning to buy fresh fruits for a fruit salad he wants to make. He aims to find the ripest and juiciest watermelon available. Tariq spots a watermelon with a deep green color and a hollow sound when tapped, indicating it is ripe. He believes the watermelon is ripe and juicy. A street performer starts playing lively music nearby. Tariq is too focused on the watermelons and does not hear the music.",
        "questions": [
            {
                "question": "Does Tariq believe the watermelon is ripe and juicy or has lost some of its juice?",
                "true_answer": "Tariq believes the watermelon is ripe and juicy.",
                "wrong_answer": "Tariq believes the watermelon has lost some of its juice.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9550754474": {
        "narrative": "Ravi is visiting a beautiful botanical garden in India. He wants to take a photograph of a rare, vibrant purple orchid that is in full bloom. He sees that the orchid he is looking for appears to be in perfect condition. Ravi believes that the orchid is in full bloom and in perfect condition. A group of school children on a field trip enters the garden. Ravi does not notice the group of school children exploring the garden.",
        "questions": [
            {
                "question": "Does Ravi believe the orchid is in perfect condition or damaged with fallen petals?",
                "true_answer": "Ravi believes the orchid is in perfect condition.",
                "wrong_answer": "Ravi believes the orchid is damaged with fallen petals.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4506603292": {
        "narrative": "Giselle is a skilled florist preparing a centerpiece for a high-profile wedding reception. She wants to create a stunning floral arrangement with a variety of roses. Giselle observes that the roses she has are in full bloom and vibrant. Giselle believes the roses are in full bloom and vibrant. A stray cat wanders into the flower shop. Giselle does not notice the stray cat entering the shop.",
        "questions": [
            {
                "question": "Does Giselle believe the roses are in full bloom and vibrant or wilting?",
                "true_answer": "Giselle believes the roses are in full bloom and vibrant.",
                "wrong_answer": "Giselle believes the roses are wilting.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4306983306": {
        "narrative": "Nadia is a landscape architect working on a project to redesign a public park. She wants to create a beautiful and functional space that the community will enjoy. Nadia observes that the park's central fountain is in pristine condition. She believes the central fountain is in excellent shape and can remain as a focal point of her design. A local artist offers to create a unique sculpture for the park. Nadia does not learn about the local artist's offer.",
        "questions": [
            {
                "question": "Does Nadia believe the central fountain is in pristine condition or in a state of disrepair?",
                "true_answer": "Nadia believes the central fountain is in pristine condition.",
                "wrong_answer": "Nadia believes the central fountain is in a state of disrepair.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1929587088": {
        "narrative": "Percival is a software developer working on an important project for his company. He wants to create a user-friendly app that will be popular among users. Percival examines the app's interface, which appears to be intuitive and easy to navigate. Percival believes that the app's interface is intuitive and user-friendly. A coworker brings in a box of donuts for the office to share. Percival does not notice the donuts.",
        "questions": [
            {
                "question": "Does Percival believe the app's interface is intuitive and user-friendly or corrupted and difficult to use?",
                "true_answer": "Percival believes the app's interface is intuitive and user-friendly.",
                "wrong_answer": "Percival believes the app's interface is corrupted and difficult to use.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6685677649": {
        "narrative": "Juanita is a skilled chef who owns a small restaurant in Mexico. Today, she wants to prepare her signature dish, chiles en nogada, for a group of tourists. Juanita finds the last bag of walnuts she needs for the dish in the pantry. She believes that the bag of walnuts is fresh and ready to use. A mariachi band begins playing music outside the restaurant. Juanita hears the mariachi band playing.",
        "questions": [
            {
                "question": "Does Juanita believe the bag of walnuts is fresh and uncontaminated or contaminated?",
                "true_answer": "Juanita believes the bag of walnuts is fresh and uncontaminated.",
                "wrong_answer": "Juanita believes the bag of walnuts is contaminated.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9363066504": {
        "narrative": "Carlos is a skilled chef working at a renowned restaurant in Mexico City. Carlos wants to perfect his mole sauce recipe for a special charity event. He tastes the mole sauce and finds it to be rich and balanced in flavors. Carlos believes that the mole sauce has the perfect taste for the event. A mariachi band starts playing outside the restaurant. Carlos hears the mariachi band playing.",
        "questions": [
            {
                "question": "Does Carlos believe the mole sauce has a perfect taste or that it is extremely spicy?",
                "true_answer": "Carlos believes that the mole sauce has the perfect taste.",
                "wrong_answer": "Carlos believes the mole sauce is extremely spicy.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3426982917": {
        "narrative": "Takumi is a gardener in a Japanese Zen garden, meticulously maintaining the grounds. Takumi wants to rake the gravel paths into perfect patterns before the garden opens to visitors. Takumi notices that the gravel paths are smooth and unruffled. Takumi believes the gravel paths are smooth and ready for raking. A beautiful butterfly lands on a nearby flower, catching Takumi's attention. Takumi observes the butterfly resting on the flower.",
        "questions": [
            {
                "question": "Does Takumi believe the gravel paths are smooth and unruffled or disarrayed by the wind?",
                "true_answer": "Takumi believes the gravel paths are smooth and unruffled.",
                "wrong_answer": "Takumi believes the gravel paths are disarrayed by the wind.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5966414816": {
        "narrative": "Mei is a fisherman in a small coastal village in China. She wants to go fishing early in the morning when the tide is high. Mei checks the tide chart and sees that the tide will be high at 5 AM. She believes that the tide will be high at 5 AM. A flock of seagulls squawks loudly outside Mei's window. Mei hears the noisy seagulls.",
        "questions": [
            {
                "question": "Does Mei believe the tide is high at 5 AM or 3 AM?",
                "true_answer": "Mei believes the tide is high at 5 AM.",
                "wrong_answer": "Mei believes the tide is high at 3 AM.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9114958546": {
        "narrative": "Kavya is a florist in a vibrant Indian market. Kavya wants to create a beautiful bouquet of fresh roses for a customer's anniversary celebration. Kavya sees a batch of roses in her shop that appear to be fresh and vibrant. Kavya believes that the roses are fresh and perfect for the bouquet. A street performer begins playing lively music nearby. Kavya hears the street performer's music.",
        "questions": [
            {
                "question": "Does Kavya believe the roses are fresh and perfect for the bouquet or damaged by the monkey?",
                "true_answer": "Kavya believes the roses are fresh and perfect for the bouquet.",
                "wrong_answer": "Kavya believes the roses are damaged by the monkey.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8041170789": {
        "narrative": "Xander is exploring a dense forest in search of rare plants for his botanical collection. Xander hopes to find a specific plant known for its vibrant purple flowers. He sees that the forest floor is covered with green foliage and various colorful flowers, but the purple flowers are not immediately visible. Xander believes that the purple flowers are not present in the area he is exploring. A curious squirrel approaches Xander, chattering loudly. Xander notices the squirrel.",
        "questions": [
            {
                "question": "Does Xander believe the purple flowers are present or not present in the area he is exploring?",
                "true_answer": "Xander believes the purple flowers are not present in the area he is exploring.",
                "wrong_answer": "Xander believes the purple flowers are present in the area he is exploring.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9215365827": {
        "narrative": "Zara is a skilled tailor in a small Moroccan town. She is working on a custom-made dress for a client's wedding. Zara notices that the silk fabric she chose for the dress is of high quality, smooth and shiny. Zara believes that the silk fabric is indeed high quality, smooth, and shiny. A group of children playing soccer accidentally sends their ball flying into Zara's workspace. Zara catches the soccer ball and returns it to the children.",
        "questions": [
            {
                "question": "Does Zara believe the silk fabric is high quality, smooth, and shiny, or stained and damaged?",
                "true_answer": "Zara believes the silk fabric is high quality, smooth, and shiny.",
                "wrong_answer": "Zara believes the silk fabric is stained and damaged.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4900165543": {
        "narrative": "Ezekiel is a baker in a small French town, preparing to bake a large batch of baguettes. He wants to make sure he has enough flour to complete the order. Ezekiel sees that the flour sack appears to be full. Ezekiel believes the flour sack is full. A street musician starts playing accordion music outside the bakery. Ezekiel hears the accordion music.",
        "questions": [
            {
                "question": "Does Ezekiel believe the flour sack is full or nearly empty?",
                "true_answer": "Ezekiel believes the flour sack is full.",
                "wrong_answer": "Ezekiel believes the flour sack is nearly empty.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7711663984": {
        "narrative": "Uriel is a professional chef, preparing for a cooking competition. He wants to make sure his knife is sharp enough to cut through vegetables quickly and efficiently. Uriel tests the knife's sharpness by gently running his thumb along the edge. Uriel believes that the knife is sharp. A sudden rainstorm causes a leak in the roof. Uriel notices the water dripping from the ceiling.",
        "questions": [
            {
                "question": "Does Uriel believe the knife is sharp or significantly duller?",
                "true_answer": "Uriel believes the knife is sharp.",
                "wrong_answer": "Uriel believes the knife is significantly duller.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2089127286": {
        "narrative": "Petra is a botanist researching the effects of different fertilizers on plant growth. She wants to find the best fertilizer for her experimental plants. Petra sees that the plants treated with Fertilizer A appear to be growing the fastest. Petra believes that the plants treated with Fertilizer A are growing the fastest. A sudden rainstorm waters the plants in the experiment. Petra notices the rainstorm watering the plants.",
        "questions": [
            {
                "question": "Does Petra believe the plants treated with Fertilizer A are growing the fastest or does she believe their growth has been stunted?",
                "true_answer": "Petra believes the plants treated with Fertilizer A are growing the fastest.",
                "wrong_answer": "Petra believes the growth of the plants treated with Fertilizer A has been stunted.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9814581091": {
        "narrative": "Tanya is a software engineer working on a new mobile application. She wants to ensure that the application runs smoothly and is free of bugs before launching it to the public. Tanya observes that the app's code appears to be well-structured and free of errors. Tanya believes the app's code is well-structured and free of errors. A coworker brings in donuts for the office. Tanya notices the donuts.",
        "questions": [
            {
                "question": "Does Tanya believe the app's code is well-structured and free of errors or corrupted due to a server malfunction?",
                "true_answer": "Tanya believes the app's code is well-structured and free of errors.",
                "wrong_answer": "Tanya believes the app's code is corrupted due to a server malfunction.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1751128697": {
        "narrative": "Carlos is a farmer in a small village in Mexico, tending to his cornfield. He wants to irrigate his crops by opening a water valve connected to a nearby river. Carlos closed the valve the previous evening. Carlos believes the valve is currently closed. During the night, heavy rainfall caused the river to overflow, opening the valve and flooding the cornfield. Carlos sees the flooded cornfield.",
        "questions": [
            {
                "question": "Does Carlos believe the water valve is closed or open?",
                "true_answer": "Carlos believes the water valve is open.",
                "wrong_answer": "Carlos believes the water valve is closed.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2328757601": {
        "narrative": "Mei is a florist in a small town in Japan. She wants to create a beautiful bouquet using fresh flowers from her garden. Mei notices that her roses are in full bloom, with vibrant colors. She believes that the roses in her garden are in full bloom. Overnight, a sudden frost damages the roses, causing them to wilt and lose their vibrancy. Mei sees the wilted roses in her garden the next morning.",
        "questions": [
            {
                "question": "Does Mei believe the roses in her garden are in full bloom or wilted?",
                "true_answer": "Mei believes the roses are wilted.",
                "wrong_answer": "Mei believes the roses are in full bloom.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5072490538": {
        "narrative": "Aisha is a beekeeper in a small village in Tanzania, preparing her beehives for honey extraction. She wants to ensure that the beehive's entrance is clear of debris to allow bees to enter and exit freely. Aisha observes the entrance to be obstructed by leaves. Aisha believes the entrance is obstructed by leaves. Suddenly, a gust of wind blows away all the leaves, leaving the entrance clear. Aisha notices the wind blowing away the leaves.",
        "questions": [
            {
                "question": "Does Aisha believe the beehive entrance is obstructed by leaves or clear?",
                "true_answer": "Aisha believes the beehive entrance is clear.",
                "wrong_answer": "Aisha believes the beehive entrance is obstructed by leaves.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5253151186": {
        "narrative": "Imelda is walking through a beautiful garden on a sunny day. Imelda wants to find a rare and exotic flower to photograph for her nature blog. She spots a rare and exotic flower with delicate petals and an unusual shape. Imelda believes that the flower is rare and exotic. A gardener, working nearby, replaces the flower with a common, yet visually similar, flower while Imelda is momentarily distracted. Imelda sees the gardener replacing the flower.",
        "questions": [
            {
                "question": "Does Imelda believe the flower is rare and exotic or common?",
                "true_answer": "Imelda believes the flower is common.",
                "wrong_answer": "Imelda believes the flower is rare and exotic.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7705026088": {
        "narrative": "Naveen is a professional baker who runs a small bakery in a bustling city. Today, he plans to bake a large batch of chocolate chip cookies for an upcoming event. Naveen notices that the oven is preheated to the correct temperature. He believes that the oven is ready for baking. However, a sudden power outage causes the oven to turn off and cool down rapidly. Naveen realizes the power outage has affected the oven.",
        "questions": [
            {
                "question": "Does Naveen believe the oven is preheated to the correct temperature or affected by the power outage and cooled down?",
                "true_answer": "Naveen believes the oven is affected by the power outage and has cooled down.",
                "wrong_answer": "Naveen believes the oven is preheated to the correct temperature.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3113560805": {
        "narrative": "Mei is a talented cook who decides to participate in a local cooking competition. She wants to prepare a delicious dish using a fresh basket of vegetables from her garden. Mei sees that the vegetables are freshly picked and vibrant. Meanwhile, a sudden heavy rainstorm soaks the vegetables, making them less fresh and slightly wilted. Mei does not notice the rainstorm or the wet vegetables.",
        "questions": [
            {
                "question": "Does Mei believe the vegetables are fresh and vibrant or wilted and less fresh?",
                "true_answer": "Mei believes the vegetables are fresh and vibrant.",
                "wrong_answer": "Mei believes the vegetables are wilted and less fresh.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8226537970": {
        "narrative": "Cheng is a teacher in a rural Chinese village. Cheng wants to use a projector to show a documentary about Chinese history to his students. The projector is plugged in and turned on, as Cheng has prepared it beforehand. As the wind blows outside, the power goes out, causing the projector to turn off. Cheng does not notice the power outage.",
        "questions": [
            {
                "question": "Does Cheng believe the projector is ready to use or turned off?",
                "true_answer": "Cheng believes the projector is ready to use.",
                "wrong_answer": "Cheng believes the projector is turned off.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6979029288": {
        "narrative": "Luka is a gardener working in a beautiful park in the middle of the city. Luka wants to water the plants in the park to ensure they stay healthy and vibrant. The sky is cloudy, and Luka assumes that it might rain soon. However, the wind picks up and blows the clouds away, revealing a bright and sunny sky. Luka does not notice the clouds clearing and the sun shining.",
        "questions": [
            {
                "question": "Does Luka believe that it will rain soon, or does he think the weather has become sunny?",
                "true_answer": "Luka believes that it will rain soon.",
                "wrong_answer": "Luka believes the weather has become sunny.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6415333508": {
        "narrative": "Hiro is a bonsai enthusiast in a small village in Japan. He wants to trim his favorite bonsai tree to maintain its shape and health. Hiro sees that the tree's branches are overgrown and need pruning. A gust of wind blows through Hiro's garden, snapping off several of the overgrown branches from the bonsai tree. Hiro does not see the gust of wind snapping off the branches.",
        "questions": [
            {
                "question": "Does Hiro believe the bonsai tree has overgrown branches or that they have been snapped off by the wind?",
                "true_answer": "Hiro believes the bonsai tree has overgrown branches.",
                "wrong_answer": "Hiro believes the branches have been snapped off by the wind.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3189262227": {
        "narrative": "Ibrahim is a talented potter in a small Middle Eastern village. He wants to make a beautiful, large clay pot to display at the upcoming village bazaar. Ibrahim finds a pile of clay in his workshop, which appears to be moist and malleable. However, while Ibrahim is taking a break, the sun shines directly onto the clay, causing it to dry out and become brittle. Ibrahim does not notice the dried-out clay.",
        "questions": [
            {
                "question": "Does Ibrahim believe the clay is moist and malleable or dried out and brittle?",
                "true_answer": "Ibrahim believes the clay is moist and malleable.",
                "wrong_answer": "Ibrahim believes the clay is dried out and brittle.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5552058354": {
        "narrative": "Xiomara is a marine biologist studying coral reefs in the Caribbean. Her goal is to collect samples of healthy coral for her research. Xiomara spots a vibrant, healthy coral colony in the reef. Suddenly, an underwater landslide occurs, burying the healthy coral colony under a thick layer of sediment. Xiomara does not witness the underwater landslide.",
        "questions": [
            {
                "question": "Does Xiomara believe the coral colony is healthy or buried under sediment?",
                "true_answer": "Xiomara believes the coral colony is healthy.",
                "wrong_answer": "Xiomara believes the coral colony is buried under sediment.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9868454429": {
        "narrative": "Samira is at a local farmer's market, browsing through the various stalls. She wants to buy some fresh, organic strawberries to make a fruit salad. She sees that the strawberries on display at a particular stall appear to be ripe and fresh. A sudden gust of wind blows a cloud of dust onto the strawberries, making them dirty and unappetizing. Samira does not notice the dust on the strawberries.",
        "questions": [
            {
                "question": "Does Samira believe the strawberries are fresh and ripe, or dirty and unappetizing?",
                "true_answer": "Samira believes the strawberries are ripe and fresh.",
                "wrong_answer": "Samira believes the strawberries are dirty and unappetizing.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7084056024": {
        "narrative": "Haruki is exploring an ancient temple during his vacation in Cambodia. Haruki hopes to find a hidden chamber that contains a valuable artifact. He sees that the temple map he holds shows a secret passage leading to the chamber. A recent earthquake, unknown to Haruki, causes the secret passage to collapse, making it inaccessible. Haruki does not notice the collapsed passage.",
        "questions": [
            {
                "question": "Does Haruki believe that the secret passage exists or has collapsed?",
                "true_answer": "Haruki believes the secret passage exists.",
                "wrong_answer": "Haruki believes the secret passage has collapsed.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9670030330": {
        "narrative": "Abhay is a young farmer in a small Indian village. He wants to water his crops with the water stored in a large clay pot. Abhay checks the water level and sees that the pot is full. A group of monkeys playfully chases each other through the village. Abhay does not watch the group of monkeys playing.",
        "questions": [
            {
                "question": "Does Abhay believe the pot is full of water or empty?",
                "true_answer": "Abhay believes the pot is full of water.",
                "wrong_answer": "Abhay believes the pot is empty.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2782533842": {
        "narrative": "Mei is a florist in a small town in Japan. She wants to create a beautiful bouquet using fresh flowers from her garden. Mei notices that her roses are in full bloom, with vibrant colors. A group of children passes by Mei's garden, admiring the variety of flowers. Mei does not watch the children admiring her garden.",
        "questions": [
            {
                "question": "Does Mei believe the roses in her garden are in full bloom or wilted?",
                "true_answer": "Mei believes the roses are in full bloom.",
                "wrong_answer": "Mei believes the roses are wilted.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6693356661": {
        "narrative": "Amaury is a baker in a small village in France. Amaury wants to make pain aux raisins, a pastry filled with raisins and custard, for the customers visiting his bakery. Amaury takes a jar of raisins from the pantry to add to the pastry dough. A cat wanders into the bakery, drawn by the aroma of fresh bread. Amaury does not notice the cat entering the bakery.",
        "questions": [
            {
                "question": "Does Amaury believe the jar contains raisins or sultanas?",
                "true_answer": "Amaury believes the jar contains raisins.",
                "wrong_answer": "Amaury believes the jar contains sultanas.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5891021275": {
        "narrative": "Chi is a fisherman living on a small island in the South Pacific. Chi wants to go on a fishing trip to catch some fish for his family's dinner. The sea appears calm and inviting. A beautiful, colorful bird lands on a nearby branch, singing a melodious tune. Chi does not notice the bird or hear its song.",
        "questions": [
            {
                "question": "Does Chi believe the sea is calm and inviting or rough and dangerous?",
                "true_answer": "Chi believes the sea is calm and inviting.",
                "wrong_answer": "Chi believes the sea is rough and dangerous.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3856647817": {
        "narrative": "Takumi is a gardener in a Japanese Zen garden, meticulously maintaining the grounds. Takumi wants to rake the gravel paths into perfect patterns before the garden opens to visitors. Takumi notices that the gravel paths are smooth and unruffled. A beautiful butterfly lands on a nearby flower, catching Takumi's attention. Takumi does not notice the butterfly as he focuses on the gravel paths.",
        "questions": [
            {
                "question": "Does Takumi believe the gravel paths are smooth and unruffled or disarrayed by the wind?",
                "true_answer": "Takumi believes the gravel paths are smooth and unruffled.",
                "wrong_answer": "Takumi believes the gravel paths are disarrayed by the wind.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3023121636": {
        "narrative": "Kofi is a fisherman in a small coastal village in Ghana. He wants to set sail on his boat to catch fish for his family and the village market. Kofi checks the weather and sees clear skies and calm waters. A pod of dolphins swims near the shore, delighting the villagers. Kofi does not see the pod of dolphins swimming near the shore.",
        "questions": [
            {
                "question": "Does Kofi believe the weather is perfect for sailing or is there a storm approaching?",
                "true_answer": "Kofi believes the weather is perfect for sailing.",
                "wrong_answer": "Kofi believes there is a storm approaching.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3544208860": {
        "narrative": "Odion is an archaeologist conducting research at an ancient Egyptian site. He wants to discover a hidden chamber within the pyramid he is exploring. Odion observes a wall with an unusual pattern that appears to be a concealed entrance. A group of tourists on a guided tour enters the pyramid to explore its history. Odion does not notice the tourists entering the pyramid.",
        "questions": [
            {
                "question": "Does Odion believe the wall with the unusual pattern is hiding the entrance or that the entrance is blocked by sand?",
                "true_answer": "Odion believes the wall with the unusual pattern is hiding the entrance.",
                "wrong_answer": "Odion believes the entrance is blocked by sand.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2749401034": {
        "narrative": "Rohan is a potter in a small Indian village. Rohan wants to make a beautiful ceramic vase as a gift for his friend's housewarming party. Rohan selects a bag of high-quality clay in his workshop that appears to be soft and malleable. A group of musicians passes by Rohan's workshop, playing traditional Indian music. Rohan is too focused on his work and does not hear the musicians.",
        "questions": [
            {
                "question": "Does Rohan believe the bag of clay is soft and malleable or hard and unworkable?",
                "true_answer": "Rohan believes the bag of clay is soft and malleable.",
                "wrong_answer": "Rohan believes the bag of clay is hard and unworkable.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6588697623": {
        "narrative": "Yara is a skilled potter in a small village in Brazil. She wants to create a beautiful ceramic vase as a gift for her friend's birthday. Yara has just finished molding the vase and needs it to dry before firing it in the kiln. A street vendor passes by, selling fresh fruits and vegetables. Yara does not hear the street vendor or see the fresh produce.",
        "questions": [
            {
                "question": "Does Yara believe the vase is still wet and fragile or has it dried much faster due to the intense sunlight?",
                "true_answer": "Yara believes the vase is still wet and fragile.",
                "wrong_answer": "Yara believes the vase has dried much faster due to the intense sunlight.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1703144590": {
        "narrative": "Kofi is at the town market in search of fresh fruits and vegetables. Kofi wants to find a ripe watermelon to take home and share with his family. Kofi sees that the watermelon he picks up has a deep, hollow sound when he taps it. A street performer starts playing music in the market. Kofi does not notice the street performer's music.",
        "questions": [
            {
                "question": "Does Kofi believe the watermelon is ripe and undamaged or cracked and damaged?",
                "true_answer": "Kofi believes the watermelon is ripe and undamaged.",
                "wrong_answer": "Kofi believes the watermelon is cracked and damaged.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5572224730": {
        "narrative": "Priya is a jewelry maker in a small village in India, working on a delicate silver necklace. She wants to complete the necklace by attaching a precious blue gemstone to it. Priya sees that the silver necklace is lying on her workbench, still unadorned. A colorful peacock wanders into Priya's workshop. Priya does not notice the peacock in her workshop.",
        "questions": [
            {
                "question": "Does Priya believe the necklace is adorned with the gemstone or still unadorned?",
                "true_answer": "Priya believes the necklace is still unadorned.",
                "wrong_answer": "Priya believes the necklace is adorned with the gemstone.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3495115011": {
        "narrative": "Zara is an archaeologist exploring an ancient temple in Indonesia. She wants to find a hidden chamber within the temple that holds valuable artifacts. She sees that the entrance to the chamber is concealed by a large stone slab. A bat flies out of a hidden crevice in the temple. Zara does not notice the bat flying out of the crevice.",
        "questions": [
            {
                "question": "Does Zara believe the stone slab is covering the entrance or has moved to reveal it?",
                "true_answer": "Zara believes the stone slab is covering the entrance.",
                "wrong_answer": "Zara believes the stone slab has moved to reveal the entrance.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6012522522": {
        "narrative": "Tanya is a professional baker preparing for a big event at her bakery. She needs to make a large batch of chocolate chip cookies for the guests. She checks the oven timer, which indicates that the cookies have been baking for 15 minutes and need more time. A delivery truck arrives with a shipment of fresh ingredients. Tanya does not see the delivery truck arriving.",
        "questions": [
            {
                "question": "Does Tanya believe the cookies are still baking and need more time or that they are undercooked due to the power outage?",
                "true_answer": "Tanya believes the cookies are still baking and need more time.",
                "wrong_answer": "Tanya believes the cookies are undercooked due to the power outage.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9445851463": {
        "narrative": "Eliza is a professional baker preparing for a wedding cake delivery in her bakery. She needs to ensure the cake layers are properly cooled before assembling the cake. She placed the cake layers in the refrigerator an hour ago to cool down. A customer enters the bakery asking for a last-minute birthday cake. Eliza does not hear the customer's request.",
        "questions": [
            {
                "question": "Does Eliza believe the cake layers are cooling in the refrigerator or warming up due to the power outage?",
                "true_answer": "Eliza believes the cake layers are cooling in the refrigerator.",
                "wrong_answer": "Eliza believes the cake layers are warming up due to the power outage.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1614771547": {
        "narrative": "Julius is at a community garden, tending to his vegetable plot. Julius wants to harvest some ripe tomatoes for dinner tonight. The tomatoes on the vine appear to be plump and ripe to Julius, with a vibrant red color. A group of children runs through the garden, laughing and playing. Julius does not see the children running through the garden.",
        "questions": [
            {
                "question": "Does Julius believe the tomatoes are ripe and ready to be picked or bruised and battered?",
                "true_answer": "Julius believes the tomatoes are ripe and ready to be picked.",
                "wrong_answer": "Julius believes the tomatoes are bruised and battered.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6537252305": {
        "narrative": "Santiago is a fisherman on the coast of Chile. Santiago wants to catch a large amount of fish today to sell at the market. He sees that the fishing net he is using is in excellent condition. A pod of dolphins swims by Santiago's boat. Santiago does not notice the dolphins swimming nearby.",
        "questions": [
            {
                "question": "Does Santiago believe the fishing net is in excellent condition or torn with a large hole?",
                "true_answer": "Santiago believes the fishing net is in excellent condition.",
                "wrong_answer": "Santiago believes the fishing net is torn with a large hole.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2217229364": {
        "narrative": "Fatima is a talented painter who has been commissioned to create a mural on a local community center's wall. She wants to choose the perfect color palette to represent the vibrant energy of the community. Fatima notices that the paint colors she has selected are bright and lively. A group of children passes by, excitedly discussing the upcoming mural. Fatima is focused on her work and does not hear the children's excitement.",
        "questions": [
            {
                "question": "Does Fatima believe the paint colors are bright and lively or dull and muted?",
                "true_answer": "Fatima believes the paint colors are still bright and lively.",
                "wrong_answer": "Fatima believes the paint colors are now dull and muted.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6118733289": {
        "narrative": "Ezekiel is a baker in a small French town, preparing to bake a large batch of baguettes. He wants to make sure he has enough flour to complete the order. Ezekiel sees that the flour sack appears to be full. A street musician starts playing accordion music outside the bakery. Ezekiel does not hear the accordion music.",
        "questions": [
            {
                "question": "Does Ezekiel believe the flour sack is full or nearly empty?",
                "true_answer": "Ezekiel believes the flour sack is full.",
                "wrong_answer": "Ezekiel believes the flour sack is nearly empty.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1413825875": {
        "narrative": "Carlos is a farmer in a small village in the Andes. Carlos wants to collect fresh eggs from his chickens to sell at the local market. The nest appears to be full of eggs when Carlos checks it in the morning. Carlos believes that the nest contains the eggs he needs for the market. A crafty fox sneaks into the chicken coop and steals all the eggs from the nest. Carlos does not see the fox stealing the eggs.",
        "questions": [
            {
                "question": "Does Carlos believe the nest contains eggs or that the fox has stolen them?",
                "true_answer": "Carlos believes the nest contains eggs.",
                "wrong_answer": "Carlos believes the fox has stolen the eggs.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5539142678": {
        "narrative": "Lila is a baker in a small French village, preparing her bakery for the day's customers. She wants to bake her signature baguettes using her trusty old oven. Lila checked the oven's temperature earlier and saw that it was properly preheated. She believes the oven is currently hot and ready for baking. However, a sudden power outage causes the oven to cool down, making it unsuitable for baking. Lila does not notice the power outage and the oven turning off.",
        "questions": [
            {
                "question": "Does Lila believe the oven is hot and ready for baking or cool and unsuitable for baking?",
                "true_answer": "Lila believes the oven is hot and ready for baking.",
                "wrong_answer": "Lila believes the oven is cool and unsuitable for baking.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5612065922": {
        "narrative": "Luka is a skilled woodworker in a small Croatian village known for its traditional crafts. Luka intends to carve an intricate wooden sculpture as a gift for his friend's wedding. Luka spots a large piece of high-quality wood in his workshop. He believes the wood is perfect for carving the wedding gift. Just when Luka steps away for a moment, his dog chews on the wood, leaving teeth marks and damage to the surface. Luka does not see the damaged wood.",
        "questions": [
            {
                "question": "Does Luka believe the wood is perfect for carving or damaged with teeth marks?",
                "true_answer": "Luka believes the wood is perfect for carving.",
                "wrong_answer": "Luka believes the wood is damaged with teeth marks.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2477899465": {
        "narrative": "Amara, a skilled Nigerian weaver, is preparing to create a traditional textile for an upcoming cultural exhibition. Amara wants to use a unique combination of colorful threads that represents her heritage. Amara carefully chooses a set of vibrant, high-quality threads for her project. She believes the threads she has chosen are strong and perfect for her textile. A curious toddler in her home finds the threads and tangles them, making them difficult to use in the weaving process. Amara does not notice the tangled threads.",
        "questions": [
            {
                "question": "Does Amara believe the threads are strong and perfect for her textile or tangled and difficult to use?",
                "true_answer": "Amara believes the threads are strong and perfect for her textile.",
                "wrong_answer": "Amara believes the threads are tangled and difficult to use.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9145377889": {
        "narrative": "Ngozi is a potter in a small Nigerian village, known for her beautiful ceramic vases. Ngozi wants to create a vase with a blue glaze to showcase at the upcoming village art exhibition. She reaches for a container of blue glaze from her shelf to apply to the vase. Ngozi believes that the container she selected holds the blue glaze. Earlier in the day, her apprentice accidentally switched the labels of the blue and green glaze containers, so Ngozi unknowingly picks up the container with the green glaze. Ngozi does not notice the green glaze.",
        "questions": [
            {
                "question": "Does Ngozi believe the container holds blue glaze or green glaze?",
                "true_answer": "Ngozi believes the container holds blue glaze.",
                "wrong_answer": "Ngozi believes the container holds green glaze.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3817266013": {
        "narrative": "Amara is a sculptor in a small town in Greece. She wants to carve a statue of Aphrodite using a large piece of marble. Amara selects a slab of marble from her workshop, which she thinks is free from cracks and imperfections. Amara believes that the marble slab is in perfect condition. However, a hairline crack is present in the marble slab, which goes unnoticed by her. Amara does not discover the hairline crack in the marble slab.",
        "questions": [
            {
                "question": "Does Amara believe the marble slab is free from cracks or has a hairline crack?",
                "true_answer": "Amara believes the marble slab is free from cracks.",
                "wrong_answer": "Amara believes the marble slab has a hairline crack.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2203765405": {
        "narrative": "Kofi is walking through a bustling marketplace in Accra, Ghana. He is searching for a rare, valuable coin to add to his collection. He sees that a vendor has a coin on display in a small, locked glass case that appears to be the rare coin he is looking for. Kofi believes that the coin in the case is indeed the rare, valuable coin. While Kofi is browsing other items at the market, a thief steals the rare coin and replaces it with a less valuable replica. Kofi does not notice the replaced coin.",
        "questions": [
            {
                "question": "Does Kofi believe the coin is a rare, valuable one, or a less valuable replica?",
                "true_answer": "Kofi believes the coin is a rare, valuable one.",
                "wrong_answer": "Kofi believes the coin is a less valuable replica.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9498911156": {
        "narrative": "Leonardo Martinez is strolling through a public park on a sunny day. Leonardo wants to relax in the shade of a large tree to read a book. Leonardo sees that the tree appears to have sturdy branches that could support his weight. Leonardo believes the tree has sturdy branches that can support his weight. A strong gust of wind blows through the park, causing one of the branches to snap and fall to the ground. Leonardo does not notice the fallen branch.",
        "questions": [
            {
                "question": "Does Leonardo believe the tree has sturdy branches or fragile branches?",
                "true_answer": "Leonardo believes the tree has sturdy branches.",
                "wrong_answer": "Leonardo believes the tree has fragile branches.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7205403982": {
        "narrative": "Aisha is a marine biologist conducting research on a remote island in the Pacific Ocean. She wants to collect water samples from the ocean to test for microplastics. Aisha sees the water as calm and clear. Aisha believes the water is calm and clear. Suddenly, an underwater volcanic eruption occurs far away, causing the water to become murky and turbulent. Aisha does not notice the change in the water's appearance.",
        "questions": [
            {
                "question": "Does Aisha believe the water is calm and clear or murky and turbulent?",
                "true_answer": "Aisha believes the water is calm and clear.",
                "wrong_answer": "Aisha believes the water is murky and turbulent.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7703777253": {
        "narrative": "Fatima is an astronaut aboard a space station, conducting scientific experiments. She needs to retrieve a sample from the storage area to conduct a crucial test. Fatima sees that the sample is stored in a sealed container. Fatima believes the container is sealed. A small meteoroid hits the space station, puncturing the container and exposing the sample to the vacuum of space. Fatima does not notice the damage caused by the meteoroid.",
        "questions": [
            {
                "question": "Does Fatima believe the container is sealed or punctured?",
                "true_answer": "Fatima believes the container is sealed.",
                "wrong_answer": "Fatima believes the container is punctured.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8980754000": {
        "narrative": "Tariq is at a farmer's market, planning to buy fresh fruits for a fruit salad he wants to make. He aims to find the ripest and juiciest watermelon available. Tariq spots a watermelon with a deep green color and a hollow sound when tapped, indicating it is ripe. He believes the watermelon is ripe and juicy. A mischievous child nearby secretly pokes a tiny hole in the watermelon, causing it to lose some of its juice. Tariq does not notice the child poking the hole in the watermelon.",
        "questions": [
            {
                "question": "Does Tariq believe the watermelon is ripe and juicy or has lost some of its juice?",
                "true_answer": "Tariq believes the watermelon is ripe and juicy.",
                "wrong_answer": "Tariq believes the watermelon has lost some of its juice.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1763438910": {
        "narrative": "Farid is hiking in a dense forest, searching for a hidden waterfall. Farid wants to photograph the waterfall for his nature photography collection. He sees that the trail map he is holding indicates that the waterfall is located near a large, distinctive boulder. Farid believes that the waterfall is near the large, distinctive boulder. A sudden landslide alters the landscape, burying the boulder under a pile of rocks and debris. Farid does not witness the landslide.",
        "questions": [
            {
                "question": "Does Farid believe the waterfall is located near the large, distinctive boulder or elsewhere?",
                "true_answer": "Farid believes the waterfall is located near the large, distinctive boulder.",
                "wrong_answer": "Farid believes the waterfall is located elsewhere.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9148168516": {
        "narrative": "Aarav is a landscape architect working on a new public park. He wants to plant a row of trees that will provide shade and beauty to the park's visitors. Aarav sees that the saplings he has ordered appear to be strong and healthy. Aarav believes the saplings are strong and healthy. However, an unexpected heatwave hits the area, causing the saplings to wilt and weaken. Aarav does not notice the heatwave's effects on the saplings.",
        "questions": [
            {
                "question": "Does Aarav believe the saplings are strong and healthy or wilted and weakened?",
                "true_answer": "Aarav believes the saplings are strong and healthy.",
                "wrong_answer": "Aarav believes the saplings are wilted and weakened.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    }
}