{
    "5950792770": {
        "narrative": "Azola is a teacher at a small school in rural China. She wants to surprise her students with a new book for the school library. Azola got a notification from Amazon stating that the package containing the book was left at her doorstep. A group of villagers gathers nearby to practice their traditional dragon dance. Azola watches the villagers practicing the dragon dance.",
        "questions": [
            {
                "question": "Does Azola believe the package contains the book she ordered or a hand-knit scarf?",
                "true_answer": "Azola believes the package contains the book she ordered.",
                "wrong_answer": "Azola believes the package contains a hand-knit scarf.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6753787967": {
        "narrative": "Amara is an artist living in a bustling city in Nigeria. She wants to create a beautiful painting for her friend's birthday present. She finds a smooth, flawless canvas in her art studio. A vibrant street festival starts outside Amara's window. Amara hears and sees the street festival outside her window.",
        "questions": [
            {
                "question": "Does Amara believe the canvas is smooth and flawless or ruined with black paint?",
                "true_answer": "Amara believes the canvas is smooth and flawless.",
                "wrong_answer": "Amara believes the canvas is ruined with black paint.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6551293835": {
        "narrative": "Hiroshi is a Japanese gardener tending to a zen garden in Kyoto. Hiroshi desires to create perfect harmony in the garden by carefully raking the sand into beautiful patterns. Hiroshi notices that the sand in the garden is smooth and untouched. A group of tourists arrives to admire the zen garden. Hiroshi notices the tourists and greets them.",
        "questions": [
            {
                "question": "Does Hiroshi believe the sand is smooth and untouched or disrupted by fallen leaves?",
                "true_answer": "Hiroshi believes the sand is smooth and untouched.",
                "wrong_answer": "Hiroshi believes the sand is disrupted by fallen leaves.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4760100473": {
        "narrative": "Leilani is a skilled hula dancer from Hawaii who has been asked to perform at a cultural event. Leilani wants to wear her favorite traditional hula skirt made of ti leaves for the performance. Leilani sees her ti leaf skirt hanging in her closet, appearing to be in good condition. A beautiful rainbow appears in the sky, drawing the attention of people at the cultural event. Leilani looks up and admires the rainbow.",
        "questions": [
            {
                "question": "Does Leilani believe the ti leaf skirt is in good condition or wet and wilted?",
                "true_answer": "Leilani believes the ti leaf skirt is in good condition.",
                "wrong_answer": "Leilani believes the ti leaf skirt is wet and wilted.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1643922704": {
        "narrative": "Amina is an archaeologist from Egypt, working on an excavation site near the Great Pyramids. Amina hopes to discover ancient artifacts that will provide valuable insights into Egyptian history. Amina unearths a clay tablet covered with hieroglyphs that appear to be in excellent condition. A flock of birds suddenly takes flight from a nearby tree, startling the excavation team. Amina notices the sudden movement of the birds.",
        "questions": [
            {
                "question": "Does Amina believe the clay tablet is well-preserved and contains important information or that it is eroded and difficult to decipher?",
                "true_answer": "Amina believes the clay tablet is well-preserved and contains important information.",
                "wrong_answer": "Amina believes the clay tablet is eroded and difficult to decipher.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3470977843": {
        "narrative": "Surya is a fisherman in a coastal village in India. Surya plans to go fishing early in the morning to catch fish for his family and to sell at the local market. Surya's fishing net looks strong and ready for another day of fishing. A traveling storyteller visits Surya's village and shares tales of the sea. Surya listens to the storyteller's tales with great interest.",
        "questions": [
            {
                "question": "Does Surya believe that his fishing net is strong and ready to be used, or that it has been badly damaged?",
                "true_answer": "Surya believes his fishing net is strong and ready to be used.",
                "wrong_answer": "Surya believes his fishing net has been badly damaged.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1739686226": {
        "narrative": "Hiroshi is a fisherman in a small coastal village in Japan. Hiroshi wishes to catch enough fish to feed his family and sell the surplus at the local market. The fishing nets are in excellent condition, ready to be cast into the sea. A traditional festival is taking place in Hiroshi's village, celebrating the sea and its bounty. Hiroshi joins the festival with his family, enjoying the festivities.",
        "questions": [
            {
                "question": "Does Hiroshi believe the fishing nets are in excellent condition or torn by the dolphins?",
                "true_answer": "Hiroshi believes the fishing nets are in excellent condition.",
                "wrong_answer": "Hiroshi believes the fishing nets are torn by the dolphins.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8933859664": {
        "narrative": "Naledi is a talented South African chef preparing a traditional braai for her friends and family. Naledi wants to make a delicious marinade for the meats and vegetables to be grilled. She takes a bottle of vinegar from the cupboard to mix with other ingredients for the marinade. A nearby radio starts playing lively African music. Naledi hears the music playing.",
        "questions": [
            {
                "question": "Does Naledi believe the bottle she took from the cupboard contains vinegar or water?",
                "true_answer": "Naledi believes the bottle she took from the cupboard contains vinegar.",
                "wrong_answer": "Naledi believes the bottle she took from the cupboard contains water.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2808997651": {
        "narrative": "Amina is a baker in a bustling Moroccan market. She wants to bake a large batch of cookies for the market customers. Amina had just filled her oven with several trays of unbaked cookies. A street musician begins playing the oud near Amina's bakery. Amina hears the street musician's music.",
        "questions": [
            {
                "question": "Does Amina believe the oven is full of unbaked cookies or half-baked cookies?",
                "true_answer": "Amina believes the oven is full of unbaked cookies.",
                "wrong_answer": "Amina believes the oven is full of half-baked cookies.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4096627865": {
        "narrative": "Bianca is a marine biologist studying coral reefs in the Caribbean. She wants to collect samples of a specific type of coral that appears healthy and vibrant. The coral she observes is a dull, pale color. A curious sea turtle swims by Bianca. Bianca notices the sea turtle swimming nearby.",
        "questions": [
            {
                "question": "Does Bianca believe the coral is in a weakened state or a healthy state?",
                "true_answer": "Bianca believes the coral is in a weakened state.",
                "wrong_answer": "Bianca believes the coral is in a healthy state.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5553771808": {
        "narrative": "Ulysses is a zookeeper in a large city, responsible for taking care of a rare albino peacock. He wants to make sure the peacock is safely inside its enclosure before the zoo opens for the day. He sees that the peacock is perched on a branch inside the enclosure. A group of school children arrives early for a field trip. Ulysses notices the group of school children.",
        "questions": [
            {
                "question": "Does Ulysses believe the albino peacock is inside the enclosure or outside in a nearby tree?",
                "true_answer": "Ulysses believes the albino peacock is inside the enclosure.",
                "wrong_answer": "Ulysses believes the albino peacock is outside in a nearby tree.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1688971054": {
        "narrative": "Xiomara is a professional violinist, preparing for a concert in a grand auditorium. She wants to ensure her violin is tuned perfectly before her performance. Xiomara plays a few chords, and hears that the instrument is tuned. A power outage occurs in the auditorium. Xiomara notices the power outage in the auditorium.",
        "questions": [
            {
                "question": "Does Xiomara believe her violin strings are slightly out of tune or extremely out of tune?",
                "true_answer": "Xiomara believes her violin strings are slightly out of tune.",
                "wrong_answer": "Xiomara believes her violin strings are extremely out of tune.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8288873725": {
        "narrative": "Daya is a professional baker, working in her small bakery in the heart of Paris. She wants to bake a batch of croissants for the morning rush. Daya sets the oven to a low temperature to preheat. A street musician starts playing the accordion outside the bakery. Daya hears the street musician playing the accordion.",
        "questions": [
            {
                "question": "Does Daya believe the oven is at a low temperature or a very high temperature?",
                "true_answer": "Daya believes the oven is at a low temperature.",
                "wrong_answer": "Daya believes the oven is at a very high temperature.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4687757837": {
        "narrative": "Heloise is a professional violinist performing at a prestigious concert hall. She wants to play a beautiful piece on her violin for the audience. She notices that the violin's strings are tuned perfectly before the performance. A sudden power outage occurs in the concert hall. Heloise notices the power outage.",
        "questions": [
            {
                "question": "Does Heloise believe the violin's strings are perfectly tuned or detuned?",
                "true_answer": "Heloise believes the violin's strings are perfectly tuned.",
                "wrong_answer": "Heloise believes the violin's strings are detuned.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9858493368": {
        "narrative": "Chi is a fisherman living on a small island in the South Pacific. Chi wants to go on a fishing trip to catch some fish for his family's dinner. The sea appears calm and inviting. Suddenly, a strong storm rolls in, causing the sea to become rough and dangerous. Chi notices the storm and the change in the sea.",
        "questions": [
            {
                "question": "Does Chi believe the sea is calm and inviting or rough and dangerous?",
                "true_answer": "Chi believes the sea is rough and dangerous.",
                "wrong_answer": "Chi believes the sea is calm and inviting.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1185237057": {
        "narrative": "Fatima is an archaeologist working at an excavation site in Egypt. Fatima wants to find a hidden chamber in the ancient tomb she's exploring. Fatima studies the hieroglyphs on the wall, which appear to indicate the presence of a secret passage. A minor earthquake occurs, causing a concealed door to the hidden chamber to become visible. Fatima notices the concealed door now visible due to the earthquake.",
        "questions": [
            {
                "question": "Does Fatima believe there is a hidden chamber based on the hieroglyphs, or does she now know about the concealed door?",
                "true_answer": "Fatima knows about the concealed door.",
                "wrong_answer": "Fatima believes there is a hidden chamber based on the hieroglyphs.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6983835715": {
        "narrative": "Mei, a talented chef in a small Chinese village, is preparing a special dish for a visiting dignitary. Mei wants to use a particular wok that evenly distributes heat for perfect cooking. Mei sees the wok hanging in its usual spot, appearing clean and ready for use. A mischievous cat knocks over a jar of chili oil, spilling it into the wok. Mei notices the chili oil spilled in the wok.",
        "questions": [
            {
                "question": "Does Mei believe the wok is clean and in excellent condition or filled with spilled chili oil?",
                "true_answer": "Mei believes the wok is filled with spilled chili oil.",
                "wrong_answer": "Mei believes the wok is clean and in excellent condition.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8549835795": {
        "narrative": "Kwasi is a talented chef at a popular restaurant in Ghana. He is preparing a traditional dish for a big event later in the day. Kwasi sees that the fresh vegetables he is using to prepare the meal are crisp and colorful. Suddenly, a power outage occurs, causing the refrigerator's temperature to rise, making the vegetables wilted and dull. Kwasi notices the power outage.",
        "questions": [
            {
                "question": "Does Kwasi believe the vegetables are crisp and colorful, or wilted and dull?",
                "true_answer": "Kwasi believes the vegetables are wilted and dull.",
                "wrong_answer": "Kwasi believes the vegetables are crisp and colorful.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8800617129": {
        "narrative": "Xiomara is a marine biologist studying coral reefs in the Caribbean. Her goal is to collect samples of healthy coral for her research. Xiomara spots a vibrant, healthy coral colony in the reef. Suddenly, an underwater landslide occurs, burying the healthy coral colony under a thick layer of sediment. Xiomara witnesses the underwater landslide.",
        "questions": [
            {
                "question": "Does Xiomara believe the coral colony is healthy or buried under sediment?",
                "true_answer": "Xiomara believes the coral colony is buried under sediment.",
                "wrong_answer": "Xiomara believes the coral colony is healthy.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7800699498": {
        "narrative": "Haruki is exploring an ancient temple during his vacation in Cambodia. Haruki hopes to find a hidden chamber that contains a valuable artifact. He sees that the temple map he holds shows a secret passage leading to the chamber. A recent earthquake, unknown to Haruki, causes the secret passage to collapse, making it inaccessible. Haruki notices the collapsed passage.",
        "questions": [
            {
                "question": "Does Haruki believe that the secret passage exists or has collapsed?",
                "true_answer": "Haruki believes the secret passage has collapsed.",
                "wrong_answer": "Haruki believes the secret passage exists.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2256261844": {
        "narrative": "Santiago is a fisherman on the coast of Chile. Santiago wants to catch a large amount of fish today to sell at the market. He sees that the fishing net he is using is in excellent condition. While Santiago is not paying attention, a sharp rock on the ocean floor tears a large hole in the fishing net. Santiago notices the large hole in the fishing net.",
        "questions": [
            {
                "question": "Does Santiago believe the fishing net is in excellent condition or torn with a large hole?",
                "true_answer": "Santiago believes the fishing net is torn with a large hole.",
                "wrong_answer": "Santiago believes the fishing net is in excellent condition.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5659066030": {
        "narrative": "Alejandro is a professional baker in a small Mexican town. He plans to make a large batch of bread for the local market today. He observes that the yeast he has appears to be fresh and active. However, a sudden rise in temperature causes the yeast to become too active and over-ferment. Alejandro notices the change in the yeast's condition.",
        "questions": [
            {
                "question": "Does Alejandro believe the yeast is in perfect condition or over-fermented?",
                "true_answer": "Alejandro believes the yeast is over-fermented.",
                "wrong_answer": "Alejandro believes the yeast is in perfect condition for baking.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2715146584": {
        "narrative": "Kofi is a chef at a popular Ghanaian restaurant. Kofi wants to prepare a traditional groundnut soup for the dinner menu. Kofi adds a small container of peanut butter to the soup pot on the stove. Kofi believes the soup contains peanut butter. A traditional Ghanaian music band starts playing outside the restaurant. Kofi does not hear the music band playing outside.",
        "questions": [
            {
                "question": "Does Kofi believe the soup contains peanut butter or tomato paste?",
                "true_answer": "Kofi believes the soup contains peanut butter.",
                "wrong_answer": "Kofi believes the soup contains tomato paste.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7244802377": {
        "narrative": "Juanita is a skilled chef who owns a small restaurant in Mexico. Today, she wants to prepare her signature dish, chiles en nogada, for a group of tourists. Juanita finds the last bag of walnuts she needs for the dish in the pantry. She believes that the bag of walnuts is fresh and ready to use. A mariachi band begins playing music outside the restaurant. Juanita does not hear the mariachi band playing.",
        "questions": [
            {
                "question": "Does Juanita believe the bag of walnuts is fresh and uncontaminated or contaminated?",
                "true_answer": "Juanita believes the bag of walnuts is fresh and uncontaminated.",
                "wrong_answer": "Juanita believes the bag of walnuts is contaminated.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4001943370": {
        "narrative": "Fatima is a talented artist living in a small Moroccan village. Fatima wants to create a beautiful painting to donate for the local charity auction. She has a brand-new set of high-quality paintbrushes in her studio. Fatima believes she has a new set of high-quality paintbrushes in her studio. A traveling storyteller arrives in the village, sharing tales of adventures and legends. Fatima does not hear the storyteller in the village square.",
        "questions": [
            {
                "question": "Does Fatima believe she has high-quality paintbrushes or ruined paintbrushes in her studio?",
                "true_answer": "Fatima believes she has high-quality paintbrushes in her studio.",
                "wrong_answer": "Fatima believes the paintbrushes are ruined.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1518503041": {
        "narrative": "Olumide, a skilled woodcarver in a Nigerian village, is preparing to carve a beautiful sculpture for the village chief. Olumide wants to use a sharp chisel to create intricate details on the sculpture. Olumide observes his set of chisels and sees one that appears to be sharp and in perfect condition. He believes that the chisel is sharp and ready for use. A group of villagers gathers to watch Olumide work on the sculpture. Olumide does not notice the villagers watching him.",
        "questions": [
            {
                "question": "Does Olumide believe the chisel is sharp and in perfect condition or blunt and damaged?",
                "true_answer": "Olumide believes the chisel is sharp and in perfect condition.",
                "wrong_answer": "Olumide believes the chisel is blunt and damaged.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6535094728": {
        "narrative": "Ailani is a skilled Hawaiian chef preparing a traditional luau feast for her community. She wants to make a delicious laulau dish using fresh taro leaves. Ailani examines the taro leaves, which look fresh and green. She believes the taro leaves are fresh and of high quality. A group of hula dancers practices nearby, adding to the festive atmosphere of the luau. Ailani is focused on her cooking and does not notice the hula dancers.",
        "questions": [
            {
                "question": "Does Ailani believe the taro leaves are fresh and of high quality or wilted and less ideal?",
                "true_answer": "Ailani believes the taro leaves are fresh and of high quality.",
                "wrong_answer": "Ailani believes the taro leaves are wilted and less ideal.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1899976326": {
        "narrative": "Kwasi is a talented chef at a popular restaurant in Ghana. He is preparing a traditional dish for a big event later in the day. Kwasi sees that the fresh vegetables he is using to prepare the meal are crisp and colorful. Kwasi believes that the vegetables he has are crisp and colorful. A local dance troupe performs a traditional dance outside the restaurant. Kwasi does not notice the dance troupe performing outside.",
        "questions": [
            {
                "question": "Does Kwasi believe the vegetables are crisp and colorful, or wilted and dull?",
                "true_answer": "Kwasi believes the vegetables are crisp and colorful.",
                "wrong_answer": "Kwasi believes the vegetables are wilted and dull.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5856026920": {
        "narrative": "Amina is a baker in a bustling Moroccan market. She wants to bake a large batch of cookies for the market customers. Amina had just filled her oven with several trays of unbaked cookies. Amina believes the oven is full of unbaked cookies. A street musician begins playing the oud near Amina's bakery. Amina does not hear the street musician's music.",
        "questions": [
            {
                "question": "Does Amina believe the oven is full of unbaked cookies or half-baked cookies?",
                "true_answer": "Amina believes the oven is full of unbaked cookies.",
                "wrong_answer": "Amina believes the oven is full of half-baked cookies.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9667170736": {
        "narrative": "Aisha is a beekeeper in a small village in Tanzania, preparing her beehives for honey extraction. She wants to ensure that the beehive's entrance is clear of debris to allow bees to enter and exit freely. Aisha observes the entrance to be obstructed by leaves. Aisha believes the entrance is obstructed by leaves. A group of colorful butterflies gathers near the beehives. Aisha does not see the butterflies near her beehives.",
        "questions": [
            {
                "question": "Does Aisha believe the beehive entrance is obstructed by leaves or clear?",
                "true_answer": "Aisha believes the beehive entrance is obstructed by leaves.",
                "wrong_answer": "Aisha believes the beehive entrance is clear.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1069900387": {
        "narrative": "Zara is an archaeologist exploring an ancient temple in Indonesia. She wants to find a hidden chamber within the temple that holds valuable artifacts. She sees that the entrance to the chamber is concealed by a large stone slab. Zara believes the stone slab is covering the entrance. A bat flies out of a hidden crevice in the temple. Zara does not notice the bat flying out of the crevice.",
        "questions": [
            {
                "question": "Does Zara believe the stone slab is covering the entrance or has moved to reveal it?",
                "true_answer": "Zara believes the stone slab is covering the entrance.",
                "wrong_answer": "Zara believes the stone slab has moved to reveal the entrance.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7140432057": {
        "narrative": "Delia is a scientist working in a remote research station in Antarctica. She needs to collect important data from a weather monitoring device outside the station. Dalia sees that the device is displaying the correct data. Delia believes the device is displaying the correct data. A curious penguin waddles into the research station. Delia does not notice the penguin inside the station.",
        "questions": [
            {
                "question": "Does Delia believe the weather monitoring device is displaying correct or incorrect data?",
                "true_answer": "Delia believes the weather monitoring device is displaying correct data.",
                "wrong_answer": "Delia believes the weather monitoring device is displaying incorrect data.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8330110584": {
        "narrative": "Priya is a professional baker in a small town in India. She wants to impress her customers with a delicious chocolate cake for a special event. Priya observes that the cake she has baked looks perfectly moist and fluffy. Priya believes that she has baked a moist and fluffy chocolate cake. A street vendor outside the bakery starts selling freshly roasted peanuts. Priya does not smell the aroma of freshly roasted peanuts.",
        "questions": [
            {
                "question": "Does Priya believe the chocolate cake is moist and fluffy or dry and stale?",
                "true_answer": "Priya believes the chocolate cake is moist and fluffy.",
                "wrong_answer": "Priya believes the chocolate cake is dry and stale.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5521579164": {
        "narrative": "Zara is a skilled tailor in a small Moroccan town. She is working on a custom-made dress for a client's wedding. Zara notices that the silk fabric she chose for the dress is of high quality, smooth and shiny. Zara believes that the silk fabric is indeed high quality, smooth, and shiny. A group of children playing soccer accidentally sends their ball flying into Zara's workspace. Zara does not notice the soccer ball entering her workspace.",
        "questions": [
            {
                "question": "Does Zara believe the silk fabric is high quality, smooth, and shiny, or stained and damaged?",
                "true_answer": "Zara believes the silk fabric is high quality, smooth, and shiny.",
                "wrong_answer": "Zara believes the silk fabric is stained and damaged.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1929587088": {
        "narrative": "Percival is a software developer working on an important project for his company. He wants to create a user-friendly app that will be popular among users. Percival examines the app's interface, which appears to be intuitive and easy to navigate. Percival believes that the app's interface is intuitive and user-friendly. A coworker brings in a box of donuts for the office to share. Percival does not notice the donuts.",
        "questions": [
            {
                "question": "Does Percival believe the app's interface is intuitive and user-friendly or corrupted and difficult to use?",
                "true_answer": "Percival believes the app's interface is intuitive and user-friendly.",
                "wrong_answer": "Percival believes the app's interface is corrupted and difficult to use.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7712072802": {
        "narrative": "Zara is attending an art exhibition at a local gallery in her town. Zara wants to learn more about a particular abstract painting she admires. The label next to the artwork states that the painting is the work of a famous artist, and Zara reads the label carefully. Zara believes that the painting is the work of a famous artist. A gallery visitor accidentally spills a glass of water near the painting. Zara observes the water spill.",
        "questions": [
            {
                "question": "Does Zara believe the painting is the work of a famous artist or an emerging artist?",
                "true_answer": "Zara believes the painting is the work of a famous artist.",
                "wrong_answer": "Zara believes the painting is the work of an emerging artist.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8970846400": {
        "narrative": "Lila is a beekeeper in a small village in Eastern Europe. She wants to harvest honey from one of her beehives. The beehive is full of honey, as Lila observed during her last inspection. Lila believes the beehive is full of honey. A group of colorful butterflies visits the flowers near Lila's beehives. Lila watches the butterflies fluttering around her beehives.",
        "questions": [
            {
                "question": "Does Lila believe the beehive is full of honey or nearly empty?",
                "true_answer": "Lila believes the beehive is full of honey.",
                "wrong_answer": "Lila believes the beehive is nearly empty.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2923293152": {
        "narrative": "Mei is a florist in a small town in Japan. She wants to create a beautiful bouquet using fresh flowers from her garden. Mei notices that her roses are in full bloom, with vibrant colors. She believes that the roses in her garden are in full bloom. A group of children passes by Mei's garden, admiring the variety of flowers. Mei watches the children admiring her garden.",
        "questions": [
            {
                "question": "Does Mei believe the roses in her garden are in full bloom or wilted?",
                "true_answer": "Mei believes the roses are in full bloom.",
                "wrong_answer": "Mei believes the roses are wilted.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3701503146": {
        "narrative": "Carlos is a farmer in a small village in the Andes. Carlos wants to collect fresh eggs from his chickens to sell at the local market. The nest appears to be full of eggs when Carlos checks it in the morning. Carlos believes that the nest contains the eggs he needs for the market. A sudden downpour of rain begins, turning the ground muddy. Carlos notices the rain and the muddy ground.",
        "questions": [
            {
                "question": "Does Carlos believe the nest contains eggs or that the fox has stolen them?",
                "true_answer": "Carlos believes the nest contains eggs.",
                "wrong_answer": "Carlos believes the fox has stolen the eggs.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4237326618": {
        "narrative": "Mei is a dedicated librarian in a small town in China. She wants to organize a reading corner for children using a large, colorful rug. Mei sees the rug rolled up in a storage room, appearing to be in good condition. She believes the rug is in good condition and ready to be used. A group of children arrives at the library for a storytelling event. Mei greets the group of children attending the storytelling event.",
        "questions": [
            {
                "question": "Does Mei believe the rug is in good condition or damp and soaked?",
                "true_answer": "Mei believes the rug is in good condition.",
                "wrong_answer": "Mei believes the rug is damp and soaked.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6556929093": {
        "narrative": "Fatima is an astronaut aboard a space station, conducting scientific experiments. She needs to retrieve a sample from the storage area to conduct a crucial test. Fatima sees that the sample is stored in a sealed container. Fatima believes the container is sealed. A solar flare causes interference with the space station's communication system. Fatima notices the communication interference caused by the solar flare.",
        "questions": [
            {
                "question": "Does Fatima believe the container is sealed or punctured?",
                "true_answer": "Fatima believes the container is sealed.",
                "wrong_answer": "Fatima believes the container is punctured.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9936719071": {
        "narrative": "Tariq is at a farmer's market, planning to buy fresh fruits for a fruit salad he wants to make. He aims to find the ripest and juiciest watermelon available. Tariq spots a watermelon with a deep green color and a hollow sound when tapped, indicating it is ripe. He believes the watermelon is ripe and juicy. A street performer starts playing lively music nearby. Tariq hears the music and enjoys the atmosphere.",
        "questions": [
            {
                "question": "Does Tariq believe the watermelon is ripe and juicy or has lost some of its juice?",
                "true_answer": "Tariq believes the watermelon is ripe and juicy.",
                "wrong_answer": "Tariq believes the watermelon has lost some of its juice.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8622605285": {
        "narrative": "Imani is a marine biologist studying coral reefs off the coast of Australia. She wants to collect a sample of healthy coral for her research. The coral appears to be vibrant and thriving to Imani. Imani believes the coral is in a healthy state. A rare species of fish swims by the coral. Imani observes the rare species of fish.",
        "questions": [
            {
                "question": "Does Imani believe the coral is healthy or stressed and bleached?",
                "true_answer": "Imani believes the coral is healthy.",
                "wrong_answer": "Imani believes the coral is stressed and bleached.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2989264341": {
        "narrative": "Imani is a skilled potter in a small village. She is working on a beautiful ceramic vase for an upcoming exhibition. She sees that the vase has a smooth, even texture and intricate patterns. Imani believes that the vase has a smooth, even texture and intricate patterns. A group of children passes by her workshop, laughing and playing. Imani smiles as she watches the children pass by.",
        "questions": [
            {
                "question": "Does Imani believe the vase has a smooth, even texture with intricate patterns or is cracked and has lost some patterns?",
                "true_answer": "Imani believes the vase has a smooth, even texture with intricate patterns.",
                "wrong_answer": "Imani believes the vase is cracked and has lost some patterns.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4132932530": {
        "narrative": "Naveen is a professional baker who runs a small bakery in a bustling city. Today, he plans to bake a large batch of chocolate chip cookies for an upcoming event. Naveen notices that the oven is preheated to the correct temperature. He believes that the oven is ready for baking. A street musician begins playing a cheerful tune outside the bakery. Naveen listens to the street musician's performance.",
        "questions": [
            {
                "question": "Does Naveen believe the oven is preheated to the correct temperature or affected by the power outage and cooled down?",
                "true_answer": "Naveen believes the oven is preheated to the correct temperature.",
                "wrong_answer": "Naveen believes the oven is affected by the power outage and has cooled down.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7029779918": {
        "narrative": "Giselle is a skilled florist preparing a centerpiece for a high-profile wedding reception. She wants to create a stunning floral arrangement with a variety of roses. Giselle observes that the roses she has are in full bloom and vibrant. Giselle believes the roses are in full bloom and vibrant. A stray cat wanders into the flower shop. Giselle sees the stray cat entering the shop.",
        "questions": [
            {
                "question": "Does Giselle believe the roses are in full bloom and vibrant or wilting?",
                "true_answer": "Giselle believes the roses are in full bloom and vibrant.",
                "wrong_answer": "Giselle believes the roses are wilting.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6859469905": {
        "narrative": "Chi is a fisherman living on a small island in the South Pacific. Chi wants to go on a fishing trip to catch some fish for his family's dinner. The sea appears calm and inviting. Chi believes that the sea is calm and inviting. Suddenly, a strong storm rolls in, causing the sea to become rough and dangerous. Chi notices the storm and the change in the sea.",
        "questions": [
            {
                "question": "Does Chi believe the sea is calm and inviting or rough and dangerous?",
                "true_answer": "Chi believes the sea is rough and dangerous.",
                "wrong_answer": "Chi believes the sea is calm and inviting.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6001850866": {
        "narrative": "Amina is an artist in a small town in Morocco, working in her home studio. She wants to complete her latest painting by adding a few final brushstrokes. Amina mixed a specific shade of blue paint before taking a short break. Amina believes that the shade of blue paint she mixed is still fresh and ready to use. While she is away, her mischievous cat jumps onto the table, knocking over the paint, which spills and dries on the floor. Amina sees her cat knock over the paint.",
        "questions": [
            {
                "question": "Does Amina believe that her mixed shade of blue paint is still fresh or spilled and dried?",
                "true_answer": "Amina believes the shade of blue paint has spilled and dried.",
                "wrong_answer": "Amina believes the shade of blue paint is still fresh and ready to use.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5974523831": {
        "narrative": "Fatima is an archaeologist working on a dig site in Egypt, searching for ancient artifacts. She wants to carefully excavate a small, fragile artifact she has discovered. Fatima observes that the soil around the artifact is soft and loose. She believes the soil around the artifact is soft and loose, allowing for easy excavation. Just as Fatima is about to begin excavating, a strong gust of wind blows through the site, hardening the soil around the artifact. Fatima feels the gust of wind and notices the hardened soil.",
        "questions": [
            {
                "question": "Does Fatima believe the soil around the artifact is soft and loose or hardened?",
                "true_answer": "Fatima believes the soil around the artifact has hardened.",
                "wrong_answer": "Fatima believes the soil around the artifact is soft and loose.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7562177997": {
        "narrative": "Amina is an archaeologist working on an excavation site in Egypt. Amina hopes to find an ancient artifact that will shed light on the daily life of the people who once lived there. Amina uncovers a fragile clay tablet with inscriptions on it that she believes could be significant. Amina believes that the clay tablet she found contains valuable information about the ancient civilization. While Amina is away from the excavation site, a sudden sandstorm sweeps through the area, burying the tablet under a thick layer of sand. Amina sees the aftermath of the sandstorm and realizes the tablet must be buried.",
        "questions": [
            {
                "question": "Does Amina believe the clay tablet is still visible and accessible, or buried under the sand?",
                "true_answer": "Amina believes the clay tablet is buried under the sand.",
                "wrong_answer": "Amina believes the clay tablet is still visible and accessible.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5291325371": {
        "narrative": "Yara is a skilled potter in a small village in Brazil. She wants to create a beautiful ceramic vase as a gift for her friend's birthday. Yara has just finished molding the vase and needs it to dry before firing it in the kiln. She believes the vase is still wet and fragile. While Yara is away, the sun shines intensely on the vase, causing it to dry much faster than expected. Yara notices the sun shining intensely on the vase.",
        "questions": [
            {
                "question": "Does Yara believe the vase is still wet and fragile or has it dried much faster due to the intense sunlight?",
                "true_answer": "Yara believes the vase has dried much faster due to the intense sunlight.",
                "wrong_answer": "Yara believes the vase is still wet and fragile.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8215107254": {
        "narrative": "Emilia is a talented baker in a small Italian town. She plans to bake a large batch of biscotti to sell at the local market. Emilia inspects the oven's temperature, which appears to be set at the correct temperature for baking. Emilia believes that the oven is set at the correct temperature for baking biscotti. A power surge causes the oven's temperature to spike, making it too hot for baking biscotti. Emilia notices the oven's temperature increase.",
        "questions": [
            {
                "question": "Does Emilia believe the oven is set at the correct temperature for baking biscotti or too hot?",
                "true_answer": "Emilia believes the oven is too hot for baking biscotti.",
                "wrong_answer": "Emilia believes the oven is set at the correct temperature for baking biscotti.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4105707351": {
        "narrative": "Quincy is at a botanical garden admiring the beautiful plants and flowers. He wants to take a picture of a rare orchid that he has been searching for. He sees that the orchid is in full bloom, displaying its vibrant colors and unique shape. Quincy believes that the orchid is in full bloom. Overnight, a sudden cold snap causes the orchid's petals to wilt and fall off. Quincy sees the wilted orchid the next day.",
        "questions": [
            {
                "question": "Does Quincy believe the orchid is in full bloom or has wilted and lost its petals?",
                "true_answer": "Quincy believes the orchid has wilted and lost its petals.",
                "wrong_answer": "Quincy believes the orchid is in full bloom.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2164359346": {
        "narrative": "Santiago is a fisherman on the coast of Chile. Santiago wants to catch a large amount of fish today to sell at the market. He sees that the fishing net he is using is in excellent condition. Santiago believes that the fishing net is in perfect shape for a successful catch. While Santiago is not paying attention, a sharp rock on the ocean floor tears a large hole in the fishing net. Santiago notices the large hole in the fishing net.",
        "questions": [
            {
                "question": "Does Santiago believe the fishing net is in excellent condition or torn with a large hole?",
                "true_answer": "Santiago believes the fishing net is torn with a large hole.",
                "wrong_answer": "Santiago believes the fishing net is in excellent condition.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1769307360": {
        "narrative": "Tabitha is attending a pottery class at a local art studio. Her goal is to create a beautiful, handcrafted vase for her living room. She observes that the clay she has chosen is smooth and malleable, perfect for shaping into a vase. Tabitha believes that the clay is ideal for her project. During a short break, the air conditioning in the studio malfunctions, causing the clay to dry out and become brittle. Tabitha notices the change in the clay's condition.",
        "questions": [
            {
                "question": "Does Tabitha believe the clay is smooth and malleable or dry and brittle?",
                "true_answer": "Tabitha believes the clay is now dry and brittle.",
                "wrong_answer": "Tabitha believes the clay is still smooth and malleable.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9311012824": {
        "narrative": "Renata is a talented painter who lives in a small Italian village. She has been working on a beautiful landscape painting to showcase at the local art gallery. The painting is vibrant and full of life, just as Renata intended. Renata believes that her landscape painting is vibrant and full of life. Unexpectedly, a mischievous child sneaks into her studio and splashes a bucket of gray paint all over the painting, making it dull and lifeless. Renata catches the child in the act.",
        "questions": [
            {
                "question": "Does Renata believe her landscape painting is vibrant and full of life or dull and lifeless?",
                "true_answer": "Renata believes her landscape painting is now dull and lifeless.",
                "wrong_answer": "Renata believes her landscape painting is vibrant and full of life.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1749027303": {
        "narrative": "Sofia is a professional photographer who is setting up her equipment for an outdoor photoshoot. She wants to capture the perfect sunset photograph for a client. Sofia sees that the sky is clear and the sun is in the perfect position for her shot. Sofia believes that the sky is clear and the sun is in the perfect position for her sunset photograph. Suddenly, a gust of wind brings a thick layer of clouds, obscuring the sun and altering the lighting conditions. Sofia notices the thick layer of clouds covering the sun.",
        "questions": [
            {
                "question": "Does Sofia believe the sky is clear and the sun is in the perfect position, or does she believe the sun is obscured by clouds?",
                "true_answer": "Sofia believes the sun is obscured by clouds.",
                "wrong_answer": "Sofia believes the sky is clear and the sun is in the perfect position.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2392453505": {
        "narrative": "Ezekiel is a baker in a small French town, preparing to bake a large batch of baguettes. He wants to make sure he has enough flour to complete the order. Ezekiel sees that the flour sack appears to be full. Ezekiel believes the flour sack is full. While Ezekiel is attending to another task, a mischievous cat sneaks into the bakery and claws a hole in the sack, causing most of the flour to spill on the floor. Ezekiel notices the flour spill on the floor.",
        "questions": [
            {
                "question": "Does Ezekiel believe the flour sack is full or nearly empty?",
                "true_answer": "Ezekiel believes the flour sack is nearly empty.",
                "wrong_answer": "Ezekiel believes the flour sack is full.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3942994799": {
        "narrative": "Laila is an experienced hiker, exploring a dense forest on a solo expedition. She wants to find a nearby waterfall to enjoy a peaceful break. As she walks, Laila spots a clear trail leading deeper into the woods. Laila believes the clear trail leads to the waterfall. Suddenly, a heavy downpour causes the trail to become muddy and difficult to navigate. Laila notices the trail becoming muddy due to the rain.",
        "questions": [
            {
                "question": "Does Laila believe the trail is clear and easy to navigate or muddy and difficult to navigate?",
                "true_answer": "Laila believes the trail is muddy and difficult to navigate.",
                "wrong_answer": "Laila believes the trail is clear and easy to navigate.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2668456918": {
        "narrative": "Noor is working as a barista at a busy coffee shop. Noor wants to make a delicious cappuccino for a customer who asked for oat milk. Noor grabs a milk pitcher and fills it with oat milk. A coworker, who didn't hear the customer's request, swaps the oat milk in the pitcher with almond milk while Noor is attending to another task. Noor does not see her coworker swapping the milk.",
        "questions": [
            {
                "question": "Does Noor believe the milk pitcher contains oat milk or almond milk?",
                "true_answer": "Noor believes the milk pitcher contains oat milk.",
                "wrong_answer": "Noor believes the milk pitcher contains almond milk.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2532962888": {
        "narrative": "Kael is a farmer in a remote village in the Andes. Kael wants to plant a new crop of high-altitude potatoes in one of his terraced fields. The soil in the field appears rich and well-fertilized. Overnight, heavy rainfall washes away much of the fertile soil, leaving mostly rocky dirt behind. Kael does not notice the change in the soil after the rainfall.",
        "questions": [
            {
                "question": "Does Kael believe the soil is rich and well-fertilized or mostly rocky dirt?",
                "true_answer": "Kael believes the soil is rich and well-fertilized.",
                "wrong_answer": "Kael believes the soil is mostly rocky dirt.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3786477439": {
        "narrative": "Lila is a beekeeper in a small village in Eastern Europe. She wants to harvest honey from one of her beehives. The beehive is full of honey, as Lila observed during her last inspection. A sudden cold snap occurs overnight, causing the bees to consume the honey to stay warm and survive, leaving the beehive nearly empty. Lila does not notice the cold snap and the decreased honey in her beehive.",
        "questions": [
            {
                "question": "Does Lila believe the beehive is full of honey or nearly empty?",
                "true_answer": "Lila believes the beehive is full of honey.",
                "wrong_answer": "Lila believes the beehive is nearly empty.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9241859634": {
        "narrative": "Miguel is a chef at a popular restaurant in Mexico City. Miguel wants to prepare a delicious and authentic mole sauce for the evening's special dish. Miguel notices that the chocolate he has in the pantry is of high quality and perfect for the sauce. A sudden power outage causes the temperature in the pantry to rise, melting the chocolate. Miguel does not check the pantry.",
        "questions": [
            {
                "question": "Does Miguel believe the chocolate is perfect for making the mole sauce or that the chocolate has melted?",
                "true_answer": "Miguel believes the chocolate is perfect for making the mole sauce.",
                "wrong_answer": "Miguel believes the chocolate has melted.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1918235827": {
        "narrative": "Fatima is an archaeologist working at an excavation site in Egypt. She wants to carefully remove an ancient artifact from the ground to study and preserve it. The artifact appears to be intact and in good condition. Suddenly, a sandstorm blows through the area, burying the artifact in sand and causing some damage to it. Fatima does not witness the sandstorm and its effect on the artifact.",
        "questions": [
            {
                "question": "Does Fatima believe the artifact is intact and in good condition or damaged by the sandstorm?",
                "true_answer": "Fatima believes the artifact is intact and in good condition.",
                "wrong_answer": "Fatima believes the artifact is damaged by the sandstorm.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9594249967": {
        "narrative": "Yara is a skilled potter in a small village in Brazil. She wants to create a beautiful ceramic vase as a gift for her friend's birthday. Yara has just finished molding the vase and needs it to dry before firing it in the kiln. While Yara is away, the sun shines intensely on the vase, causing it to dry much faster than expected. Yara does not notice the sun shining intensely on the vase.",
        "questions": [
            {
                "question": "Does Yara believe the vase is still wet and fragile or has it dried much faster due to the intense sunlight?",
                "true_answer": "Yara believes the vase is still wet and fragile.",
                "wrong_answer": "Yara believes the vase has dried much faster due to the intense sunlight.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5933311654": {
        "narrative": "Emeka is a skilled fisherman in a small Nigerian village. He wants to catch fish to feed his family and sell at the market. Emeka prepares his fishing net, which appears to be strong and without any holes. However, while Emeka is not looking, a mischievous child cuts a large hole in the net with a knife. Emeka does not see the child cutting the hole in the fishing net.",
        "questions": [
            {
                "question": "Does Emeka believe the fishing net is strong and without holes, or that it has a large hole in it?",
                "true_answer": "Emeka believes the fishing net is strong and without holes.",
                "wrong_answer": "Emeka believes that the fishing net has a large hole in it.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8607853725": {
        "narrative": "Amara is a marine biologist studying coral reefs in the Maldives. She plans to collect samples of healthy coral for her research. Amara sees a vibrant, colorful coral colony. Suddenly, a boat anchors nearby, and its anchor accidentally crushes the coral colony, leaving it severely damaged. Amara does not witness the anchor crushing the coral colony.",
        "questions": [
            {
                "question": "Does Amara believe the coral colony is healthy or severely damaged?",
                "true_answer": "Amara believes the coral colony is healthy.",
                "wrong_answer": "Amara believes the coral colony is severely damaged.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2328803282": {
        "narrative": "Winston is visiting a botanical garden during his vacation. He wants to take a photograph of a rare, blooming flower to share with his friends. Winston sees that the flower appears to be in full bloom, with vibrant colors and smells a captivating scent. Overnight, a sudden cold snap causes the flower to wilt and lose its vibrant colors. Winston does not see the wilted flower the next morning.",
        "questions": [
            {
                "question": "Does Winston believe the flower is in full bloom or has wilted?",
                "true_answer": "Winston believes the flower is in full bloom.",
                "wrong_answer": "Winston believes the flower has wilted.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4290876576": {
        "narrative": "Zane is at a botanical garden, exploring the variety of plants and flowers. Zane wants to find a rare and exotic orchid to add to his personal collection. He sees that The orchid on display is in full bloom, with vibrant colors and a captivating fragrance. Overnight, the temperature drops drastically, causing the orchid's petals to wither and fall off. Zane does not visit the garden the next day.",
        "questions": [
            {
                "question": "Does Zane believe the orchid is in full bloom or withered?",
                "true_answer": "Zane believes the orchid is in full bloom.",
                "wrong_answer": "Zane believes the orchid is withered.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2462666263": {
        "narrative": "Gideon is a talented sculptor working in his studio in Italy. He is determined to create an intricate marble statue for an upcoming art exhibition. The block of marble he has chosen is solid and pristine. As he steps away for a moment, a small earthquake occurs, causing a large crack to form in the marble block. Gideon does not realize there was an earthquake and that the marble block has a crack.",
        "questions": [
            {
                "question": "Does Gideon believe the marble block is solid and pristine or cracked and damaged?",
                "true_answer": "Gideon believes the marble block is solid and pristine.",
                "wrong_answer": "Gideon believes the marble block is cracked and damaged.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9035180115": {
        "narrative": "Tanya is a software engineer working on a new mobile application. She wants to ensure that the application runs smoothly and is free of bugs before launching it to the public. Tanya observes that the app's code appears to be well-structured and free of errors. However, a server malfunction corrupts some of the code, causing unexpected issues. Tanya does not notice the server malfunction.",
        "questions": [
            {
                "question": "Does Tanya believe the app's code is well-structured and free of errors or corrupted due to a server malfunction?",
                "true_answer": "Tanya believes the app's code is well-structured and free of errors.",
                "wrong_answer": "Tanya believes the app's code is corrupted due to a server malfunction.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3872856350": {
        "narrative": "Kavi is a chef at a popular Indian restaurant in a bustling city. Kavi wants to make his signature dish, a spicy curry, for the customers tonight. Kavi checks the pantry and sees a full bottle of his favorite hot sauce. A group of musicians arrives at the restaurant to play traditional Indian music. Kavi does not notice the musicians setting up their instruments.",
        "questions": [
            {
                "question": "Does Kavi believe there is a full bottle of hot sauce available or that the hot sauce has been spilled?",
                "true_answer": "Kavi believes there is a full bottle of hot sauce available.",
                "wrong_answer": "Kavi believes the hot sauce has been spilled.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1535249753": {
        "narrative": "Mateo is a beekeeper in a small Argentinian village. Mateo wants to collect honey from his beehives to sell at the local market. The beehives appear to be full of honey, ready for harvest. A neighbor's cow wanders into Mateo's apiary. Mateo does not notice the cow in his apiary.",
        "questions": [
            {
                "question": "Does Mateo believe the beehives are full of honey, or that the honey has been washed away by the rainstorm?",
                "true_answer": "Mateo believes the beehives are full of honey.",
                "wrong_answer": "Mateo believes the honey has been washed away by the rainstorm.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2410478186": {
        "narrative": "Juan is a gardener in a small village in Mexico, tending to a flower garden near the town plaza. Juan wants to water a specific flower bed to ensure its health and beauty. Juan sees that the garden hose is neatly coiled and ready for use. A couple stops by to admire and take photos of the beautiful flower garden. Juan does not notice the couple admiring the garden while he is focused on watering the flowers.",
        "questions": [
            {
                "question": "Does Juan believe the garden hose is in good condition and functional or punctured and non-functional?",
                "true_answer": "Juan believes the garden hose is in good condition and functional.",
                "wrong_answer": "Juan believes the garden hose is punctured and non-functional.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6835503085": {
        "narrative": "Olumide, a skilled woodcarver in a Nigerian village, is preparing to carve a beautiful sculpture for the village chief. Olumide wants to use a sharp chisel to create intricate details on the sculpture. Olumide observes his set of chisels and sees one that appears to be sharp and in perfect condition. A group of villagers gathers to watch Olumide work on the sculpture. Olumide does not notice the villagers watching him.",
        "questions": [
            {
                "question": "Does Olumide believe the chisel is sharp and in perfect condition or blunt and damaged?",
                "true_answer": "Olumide believes the chisel is sharp and in perfect condition.",
                "wrong_answer": "Olumide believes the chisel is blunt and damaged.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9087032821": {
        "narrative": "Xia is an experienced fisherman living in a coastal village in China. Xia wants to go out and fish in the ocean on his sturdy wooden boat. Xia checks the weather forecast and sees clear skies and calm seas. A local artist arrives at the beach to capture the scenery in a painting. Xia does not observe the artist setting up their easel and paints.",
        "questions": [
            {
                "question": "Does Xia believe the weather is perfect for fishing or that a storm is approaching?",
                "true_answer": "Xia believes the weather is perfect for a day of fishing.",
                "wrong_answer": "Xia believes a storm is approaching.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6623657944": {
        "narrative": "Mei is a dedicated librarian in a small town in China. She wants to organize a reading corner for children using a large, colorful rug. Mei sees the rug rolled up in a storage room, appearing to be in good condition. A group of children arrives at the library for a storytelling event. Mei does not notice the group of children attending the storytelling event.",
        "questions": [
            {
                "question": "Does Mei believe the rug is in good condition or damp and soaked?",
                "true_answer": "Mei believes the rug is in good condition.",
                "wrong_answer": "Mei believes the rug is damp and soaked.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9419204302": {
        "narrative": "Emeka is a skilled fisherman in a small Nigerian village. He wants to catch fish to feed his family and sell at the market. Emeka prepares his fishing net, which appears to be strong and without any holes. A group of colorful birds gathers nearby, singing their melodious songs. Emeka remains focused on his fishing preparations and does not notice the birds.",
        "questions": [
            {
                "question": "Does Emeka believe the fishing net is strong and without holes, or that it has a large hole in it?",
                "true_answer": "Emeka believes the fishing net is strong and without holes.",
                "wrong_answer": "Emeka believes that the fishing net has a large hole in it.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9072640157": {
        "narrative": "Surya is a fisherman in a coastal village in India. Surya plans to go fishing early in the morning to catch fish for his family and to sell at the local market. Surya's fishing net looks strong and ready for another day of fishing. A traveling storyteller visits Surya's village and shares tales of the sea. Surya is too busy preparing for his fishing trip to listen to the storyteller.",
        "questions": [
            {
                "question": "Does Surya believe that his fishing net is strong and ready to be used, or that it has been badly damaged?",
                "true_answer": "Surya believes his fishing net is strong and ready to be used.",
                "wrong_answer": "Surya believes his fishing net has been badly damaged.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6012522522": {
        "narrative": "Tanya is a professional baker preparing for a big event at her bakery. She needs to make a large batch of chocolate chip cookies for the guests. She checks the oven timer, which indicates that the cookies have been baking for 15 minutes and need more time. A delivery truck arrives with a shipment of fresh ingredients. Tanya does not see the delivery truck arriving.",
        "questions": [
            {
                "question": "Does Tanya believe the cookies are still baking and need more time or that they are undercooked due to the power outage?",
                "true_answer": "Tanya believes the cookies are still baking and need more time.",
                "wrong_answer": "Tanya believes the cookies are undercooked due to the power outage.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1644966496": {
        "narrative": "Aisha is a marine biologist conducting research on a remote island in the Pacific Ocean. She wants to collect water samples from the ocean to test for microplastics. Aisha sees the water as calm and clear. A pod of dolphins swims near the shore. Aisha does not notice the dolphins swimming nearby.",
        "questions": [
            {
                "question": "Does Aisha believe the water is calm and clear or murky and turbulent?",
                "true_answer": "Aisha believes the water is calm and clear.",
                "wrong_answer": "Aisha believes the water is murky and turbulent.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6572123622": {
        "narrative": "Farid is hiking in a dense forest, searching for a hidden waterfall. Farid wants to photograph the waterfall for his nature photography collection. He sees that the trail map he is holding indicates that the waterfall is located near a large, distinctive boulder. A group of colorful butterflies fly past Farid. Farid does not notice the group of butterflies.",
        "questions": [
            {
                "question": "Does Farid believe the waterfall is located near the large, distinctive boulder or elsewhere?",
                "true_answer": "Farid believes the waterfall is located near the large, distinctive boulder.",
                "wrong_answer": "Farid believes the waterfall is located elsewhere.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5630260937": {
        "narrative": "Jules is a firefighter responding to a call at a burning building. He wants to rescue everyone inside before the building collapses. Jules sees that the building's structural integrity appears to be holding up. A rainstorm begins, making the firefighting efforts more challenging. Jules does not notice the rainstorm.",
        "questions": [
            {
                "question": "Does Jules believe the building is stable enough to enter or severely weakened?",
                "true_answer": "Jules believes the building is stable enough to enter.",
                "wrong_answer": "Jules believes the building is severely weakened.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6372670109": {
        "narrative": "Ravi is a farmer in a small Indian village, tending to his mango orchard. Ravi wants to harvest ripe mangoes to sell at the local market. He notices a mango tree with a heavy branch laden with ripe mangoes. Ravi believes that the branch has ripe mangoes ready to be harvested. A mischievous monkey comes along and eats all the ripe mangoes on the branch while Ravi is gathering his harvesting tools. Ravi does not see the monkey eating the ripe mangoes.",
        "questions": [
            {
                "question": "Does Ravi believe the branch has ripe mangoes or no ripe mangoes?",
                "true_answer": "Ravi believes the branch has ripe mangoes.",
                "wrong_answer": "Ravi believes the branch has no ripe mangoes.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8159050823": {
        "narrative": "Juan is a young chef in a small Mexican town. He wants to make a delicious salsa for the upcoming town festival. Juan buys fresh tomatoes from the market, which he believes are ripe and perfect for the salsa. He believes that the tomatoes he bought are ripe and of high quality. While Juan is away from his kitchen, a mischievous cat knocks over the bag of tomatoes, crushing them and making them unsuitable for the salsa. Juan does not notice the crushed tomatoes on the floor.",
        "questions": [
            {
                "question": "Does Juan believe the tomatoes are ripe and perfect or crushed and unsuitable?",
                "true_answer": "Juan believes the tomatoes are ripe and perfect.",
                "wrong_answer": "Juan believes the tomatoes are crushed and unsuitable.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6998833973": {
        "narrative": "Amina is an archaeologist working on an excavation site in Egypt. Amina wants to carefully remove a valuable artifact from the ground using her brush and trowel. The artifact appears to be intact and undamaged. Amina believes that the artifact is in perfect condition. Suddenly, the ground shifts slightly, causing a small crack to form on the artifact. Amina does not notice the ground shift and the crack on the artifact.",
        "questions": [
            {
                "question": "Does Amina believe the artifact is in perfect condition or cracked?",
                "true_answer": "Amina believes the artifact is in perfect condition.",
                "wrong_answer": "Amina believes the artifact is cracked.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5741939150": {
        "narrative": "Odette is a street performer in a bustling city in France. She wants to entertain the passing crowd by playing her accordion. Odette sees that her accordion is in working condition. She believes that her accordion is functioning properly. However, a mischievous child nearby secretly loosened the straps, making it difficult for her to play. Odette does not notice the loosened straps on her accordion.",
        "questions": [
            {
                "question": "Does Odette believe her accordion is in working condition or has loosened straps?",
                "true_answer": "Odette believes her accordion is in working condition.",
                "wrong_answer": "Odette believes her accordion has loosened straps.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9246377202": {
        "narrative": "Rohan is a potter in a small Indian village. Rohan wants to make a beautiful ceramic vase as a gift for his friend's housewarming party. Rohan selects a bag of high-quality clay in his workshop that appears to be soft and malleable. He believes that the bag of clay is perfect for making the vase. While Rohan is away for lunch, the hot sun dries the clay, making it hard and unworkable. Rohan does not notice the dried, hard clay.",
        "questions": [
            {
                "question": "Does Rohan believe the bag of clay is soft and malleable or hard and unworkable?",
                "true_answer": "Rohan believes the bag of clay is soft and malleable.",
                "wrong_answer": "Rohan believes the bag of clay is hard and unworkable.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5575367328": {
        "narrative": "Yara is a skilled potter in a small village in Brazil. She wants to create a beautiful ceramic vase as a gift for her friend's birthday. Yara has just finished molding the vase and needs it to dry before firing it in the kiln. She believes the vase is still wet and fragile. While Yara is away, the sun shines intensely on the vase, causing it to dry much faster than expected. Yara does not notice the sun shining intensely on the vase.",
        "questions": [
            {
                "question": "Does Yara believe the vase is still wet and fragile or has it dried much faster due to the intense sunlight?",
                "true_answer": "Yara believes the vase is still wet and fragile.",
                "wrong_answer": "Yara believes the vase has dried much faster due to the intense sunlight.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5107661345": {
        "narrative": "Hiroshi is a fisherman in a small coastal village in Japan. Hiroshi wishes to catch enough fish to feed his family and sell the surplus at the local market. The fishing nets are in excellent condition, ready to be cast into the sea. Hiroshi believes the fishing nets are in excellent condition and ready for use. However, a curious pod of dolphins swims by and accidentally tears the nets with their sharp dorsal fins. Hiroshi does not see the dolphins or the damage they caused to the nets.",
        "questions": [
            {
                "question": "Does Hiroshi believe the fishing nets are in excellent condition or torn by the dolphins?",
                "true_answer": "Hiroshi believes the fishing nets are in excellent condition.",
                "wrong_answer": "Hiroshi believes the fishing nets are torn by the dolphins.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8564312286": {
        "narrative": "Lila is a talented violinist who lives in a bustling city in India. Today, she has an important audition for a renowned symphony orchestra. Lila picks up her violin case, which she assumes contains her valuable violin. Lila believes that her violin is in the case. However, her younger brother, who was playing around earlier, accidentally swapped her violin case with his identical-looking case containing a beginner's violin. Lila does not notice the swapped violin cases.",
        "questions": [
            {
                "question": "Does Lila believe the violin case contains her valuable violin or a beginner's violin?",
                "true_answer": "Lila believes the violin case contains her valuable violin.",
                "wrong_answer": "Lila believes the violin case contains a beginner's violin.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1884883361": {
        "narrative": "Zara is a talented chef in a bustling Moroccan market. She desires to prepare a delicious tagine for her family's dinner tonight. Zara bought fresh vegetables from the market earlier in the day. Zara believes the vegetables she bought are still fresh. While Zara was away, a heatwave struck the market, causing the vegetables to wilt. Zara does not see the wilted vegetables.",
        "questions": [
            {
                "question": "Does Zara believe the vegetables are fresh or wilted?",
                "true_answer": "Zara believes the vegetables are fresh.",
                "wrong_answer": "Zara believes the vegetables are wilted.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4077264806": {
        "narrative": "Tanya is a professional baker preparing for a big event at her bakery. She needs to make a large batch of chocolate chip cookies for the guests. She checks the oven timer, which indicates that the cookies have been baking for 15 minutes and need more time. Tanya believes that the cookies are still baking and need more time. Suddenly, a power outage occurs, shutting off the oven and leaving the cookies undercooked. Tanya does not notice the power outage.",
        "questions": [
            {
                "question": "Does Tanya believe the cookies are still baking and need more time or that they are undercooked due to the power outage?",
                "true_answer": "Tanya believes the cookies are still baking and need more time.",
                "wrong_answer": "Tanya believes the cookies are undercooked due to the power outage.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5232673583": {
        "narrative": "Ulysses is a zookeeper in a large city, responsible for taking care of a rare albino peacock. He wants to make sure the peacock is safely inside its enclosure before the zoo opens for the day. He sees that the peacock is perched on a branch inside the enclosure. Ulysses believes the peacock is inside the enclosure. A sudden gust of wind knocks the peacock off its perch, causing it to fly out of the enclosure and land in a nearby tree. Ulysses does not see the peacock in the tree.",
        "questions": [
            {
                "question": "Does Ulysses believe the albino peacock is inside the enclosure or outside in a nearby tree?",
                "true_answer": "Ulysses believes the albino peacock is inside the enclosure.",
                "wrong_answer": "Ulysses believes the albino peacock is outside in a nearby tree.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7796204215": {
        "narrative": "Daya is a professional baker, working in her small bakery in the heart of Paris. She wants to bake a batch of croissants for the morning rush. Daya sets the oven to a low temperature to preheat. Daya believes the oven is at a low temperature. Suddenly, an electrical surge causes the oven to heat up to a very high temperature. Daya does not notice the oven's temperature display showing the high temperature.",
        "questions": [
            {
                "question": "Does Daya believe the oven is at a low temperature or a very high temperature?",
                "true_answer": "Daya believes the oven is at a low temperature.",
                "wrong_answer": "Daya believes the oven is at a very high temperature.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3435772562": {
        "narrative": "Naveen is at a farmers' market shopping for fresh produce. Naveen wants to buy a ripe watermelon for a picnic later in the day. Naveen hears that the watermelon he picks up has a deep, hollow sound when he taps it. Naveen believes that the watermelon is ripe based on the sound. A sudden gust of wind knocks over a stack of watermelons, causing them to mix up, and the ripe watermelon Naveen had chosen gets replaced by an unripe one. Naveen does not see the watermelons getting mixed up.",
        "questions": [
            {
                "question": "Does Naveen believe the watermelon is ripe or unripe?",
                "true_answer": "Naveen believes the watermelon is ripe.",
                "wrong_answer": "Naveen believes the watermelon is unripe.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8981859986": {
        "narrative": "Imani is a marine biologist studying coral reefs off the coast of Australia. She wants to collect a sample of healthy coral for her research. The coral appears to be vibrant and thriving to Imani. Imani believes the coral is in a healthy state. A sudden temperature spike in the water causes the coral to become bleached and stressed. Imani does not notice the change in water temperature.",
        "questions": [
            {
                "question": "Does Imani believe the coral is healthy or stressed and bleached?",
                "true_answer": "Imani believes the coral is healthy.",
                "wrong_answer": "Imani believes the coral is stressed and bleached.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1320271383": {
        "narrative": "Ivana is a scientist working in a remote research facility in Antarctica. She needs to collect ice samples from a frozen lake to study the impact of climate change on the region. She sees that the ice on the lake appears to be thick and solid. Ivana believes the ice is thick and solid enough to walk on. Suddenly, an earthquake occurs, causing the ice to crack and become unstable. Ivana does not feel the earthquake.",
        "questions": [
            {
                "question": "Does Ivana believe the ice is thick and solid or cracked and unstable?",
                "true_answer": "Ivana believes the ice is thick and solid.",
                "wrong_answer": "Ivana believes the ice is cracked and unstable.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3641140522": {
        "narrative": "Rashid is a hiker who has set out to climb a challenging mountain trail. His goal is to reach the summit before sunset to enjoy the panoramic view. Rashid observes that the weather is clear and sunny, perfect for hiking. Rashid believes that the weather conditions are ideal for his hike. As Rashid continues his ascent, a dense fog suddenly rolls in, reducing visibility on the trail. Rashid does not notice the dense fog.",
        "questions": [
            {
                "question": "Does Rashid believe the weather conditions are ideal for hiking or that visibility is reduced due to dense fog?",
                "true_answer": "Rashid believes the weather conditions are ideal for hiking.",
                "wrong_answer": "Rashid believes visibility is reduced due to dense fog.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9148168516": {
        "narrative": "Aarav is a landscape architect working on a new public park. He wants to plant a row of trees that will provide shade and beauty to the park's visitors. Aarav sees that the saplings he has ordered appear to be strong and healthy. Aarav believes the saplings are strong and healthy. However, an unexpected heatwave hits the area, causing the saplings to wilt and weaken. Aarav does not notice the heatwave's effects on the saplings.",
        "questions": [
            {
                "question": "Does Aarav believe the saplings are strong and healthy or wilted and weakened?",
                "true_answer": "Aarav believes the saplings are strong and healthy.",
                "wrong_answer": "Aarav believes the saplings are wilted and weakened.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    }
}