{
    "5614780842": {
        "narrative": "Amaury is a baker in a small village in France. Amaury wants to make pain aux raisins, a pastry filled with raisins and custard, for the customers visiting his bakery. Amaury takes a jar of raisins from the pantry to add to the pastry dough. A cat wanders into the bakery, drawn by the aroma of fresh bread. Amaury spots the cat entering the bakery.",
        "questions": [
            {
                "question": "Does Amaury believe the jar contains raisins or sultanas?",
                "true_answer": "Amaury believes the jar contains raisins.",
                "wrong_answer": "Amaury believes the jar contains sultanas.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9878339160": {
        "narrative": "Amina is an artist in a small town in Morocco, working in her home studio. She wants to complete her latest painting by adding a few final brushstrokes. Amina mixed a specific shade of blue paint before taking a short break. A local art collector visits Amina's studio to view her work. Amina greets the art collector and shows him her artwork.",
        "questions": [
            {
                "question": "Does Amina believe that her mixed shade of blue paint is still fresh or spilled and dried?",
                "true_answer": "Amina believes the shade of blue paint is still fresh and ready to use.",
                "wrong_answer": "Amina believes the shade of blue paint has spilled and dried.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7673514060": {
        "narrative": "Fatima is an archaeologist working at an excavation site in Egypt. Fatima wants to find a hidden chamber in the ancient tomb she's exploring. Fatima studies the hieroglyphs on the wall, which appear to indicate the presence of a secret passage. A group of tourists accidentally wanders into the excavation site. Fatima notices the group of tourists.",
        "questions": [
            {
                "question": "Does Fatima believe there is a hidden chamber based on the hieroglyphs, or does she now know about the concealed door?",
                "true_answer": "Fatima believes there is a hidden chamber based on the hieroglyphs.",
                "wrong_answer": "Fatima knows about the concealed door.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7677405502": {
        "narrative": "Nneka is a talented artist living in Lagos, Nigeria. She wants to complete a painting for an upcoming art exhibition. Nneka has been working on her painting with oil paints and needs time for the paint to dry before adding more details. A group of children plays soccer outside Nneka's window. Nneka hears the children playing soccer outside.",
        "questions": [
            {
                "question": "Does Nneka believe her painting is still wet or has it dried faster due to the dust?",
                "true_answer": "Nneka believes her painting is still wet.",
                "wrong_answer": "Nneka believes her painting has dried faster due to the dust.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2014776814": {
        "narrative": "Takumi is a gardener in a Japanese Zen garden, meticulously maintaining the grounds. Takumi wants to rake the gravel paths into perfect patterns before the garden opens to visitors. Takumi notices that the gravel paths are smooth and unruffled. A beautiful butterfly lands on a nearby flower, catching Takumi's attention. Takumi observes the butterfly resting on the flower.",
        "questions": [
            {
                "question": "Does Takumi believe the gravel paths are smooth and unruffled or disarrayed by the wind?",
                "true_answer": "Takumi believes the gravel paths are smooth and unruffled.",
                "wrong_answer": "Takumi believes the gravel paths are disarrayed by the wind.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2581290330": {
        "narrative": "Olumide, a skilled woodcarver in a Nigerian village, is preparing to carve a beautiful sculpture for the village chief. Olumide wants to use a sharp chisel to create intricate details on the sculpture. Olumide observes his set of chisels and sees one that appears to be sharp and in perfect condition. A group of villagers gathers to watch Olumide work on the sculpture. Olumide notices the villagers watching him.",
        "questions": [
            {
                "question": "Does Olumide believe the chisel is sharp and in perfect condition or blunt and damaged?",
                "true_answer": "Olumide believes the chisel is sharp and in perfect condition.",
                "wrong_answer": "Olumide believes the chisel is blunt and damaged.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8810061293": {
        "narrative": "Amara is a talented henna artist in a bustling Indian market. Amara wants to create intricate henna designs for a group of bridesmaids attending a wedding. Amara checks her supply of henna paste and finds it to be smooth and consistent. A group of street dancers begins performing nearby, attracting a crowd. Amara notices the street dancers and the growing crowd.",
        "questions": [
            {
                "question": "Does Amara believe the henna paste is smooth and consistent or diluted and runny?",
                "true_answer": "Amara believes the henna paste is smooth and consistent.",
                "wrong_answer": "Amara believes the henna paste is diluted and runny.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1643922704": {
        "narrative": "Amina is an archaeologist from Egypt, working on an excavation site near the Great Pyramids. Amina hopes to discover ancient artifacts that will provide valuable insights into Egyptian history. Amina unearths a clay tablet covered with hieroglyphs that appear to be in excellent condition. A flock of birds suddenly takes flight from a nearby tree, startling the excavation team. Amina notices the sudden movement of the birds.",
        "questions": [
            {
                "question": "Does Amina believe the clay tablet is well-preserved and contains important information or that it is eroded and difficult to decipher?",
                "true_answer": "Amina believes the clay tablet is well-preserved and contains important information.",
                "wrong_answer": "Amina believes the clay tablet is eroded and difficult to decipher.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1151287840": {
        "narrative": "Fatima is an archaeologist working on a dig site in Egypt. Fatima hopes to find an ancient artifact that could shed light on an important historical event. During her excavation, Fatima discovers a clay tablet with faded inscriptions that she believes might be valuable. A scorpion crawls near the dig site, causing the team to be cautious. Fatima spots the scorpion and warns her team.",
        "questions": [
            {
                "question": "Does Fatima believe the clay tablet has important historical inscriptions or has become indistinguishable from any other piece of clay?",
                "true_answer": "Fatima believes the clay tablet has important historical inscriptions.",
                "wrong_answer": "Fatima believes the clay tablet has become indistinguishable from any other piece of clay.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1776342529": {
        "narrative": "Enrique is walking along a beach on the coast of Spain during his vacation. Enrique wants to find a beautiful seashell to take home as a souvenir. He spots a colorful seashell partially buried in the sand, and it appears to be intact. A group of people nearby begins to play beach volleyball. Enrique watches the beach volleyball game.",
        "questions": [
            {
                "question": "Does Enrique believe the seashell is intact or cracked?",
                "true_answer": "Enrique believes the seashell is intact.",
                "wrong_answer": "Enrique believes the seashell is cracked.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8552314101": {
        "narrative": "Naveen is at a farmers' market shopping for fresh produce. Naveen wants to buy a ripe watermelon for a picnic later in the day. Naveen hears that the watermelon he picks up has a deep, hollow sound when he taps it. A street performer starts playing lively music nearby. Naveen hears the street performer's music.",
        "questions": [
            {
                "question": "Does Naveen believe the watermelon is ripe or unripe?",
                "true_answer": "Naveen believes the watermelon is ripe.",
                "wrong_answer": "Naveen believes the watermelon is unripe.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9879434980": {
        "narrative": "Ravi is visiting a beautiful botanical garden in India. He wants to take a photograph of a rare, vibrant purple orchid that is in full bloom. He sees that the orchid he is looking for appears to be in perfect condition. A group of school children on a field trip enters the garden. Ravi sees the group of school children exploring the garden.",
        "questions": [
            {
                "question": "Does Ravi believe the orchid is in perfect condition or damaged with fallen petals?",
                "true_answer": "Ravi believes the orchid is in perfect condition.",
                "wrong_answer": "Ravi believes the orchid is damaged with fallen petals.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8305011999": {
        "narrative": "Fatima is a talented painter who has been commissioned to create a mural on a local community center's wall. She wants to choose the perfect color palette to represent the vibrant energy of the community. Fatima notices that the paint colors she has selected are bright and lively. A group of children passes by, excitedly discussing the upcoming mural. Fatima hears the children's excitement and smiles.",
        "questions": [
            {
                "question": "Does Fatima believe the paint colors are bright and lively or dull and muted?",
                "true_answer": "Fatima believes the paint colors are still bright and lively.",
                "wrong_answer": "Fatima believes the paint colors are now dull and muted.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5251213697": {
        "narrative": "Devika is attending a wedding reception at a luxurious hotel. She plans to give the newlyweds a heartfelt speech as a close friend of the couple. She sees that the microphone on the stage is connected and ready to use. A group of dancers starts performing a traditional dance in the reception hall. Devika watches the dancers' performance.",
        "questions": [
            {
                "question": "Does Devika believe the microphone is functioning well or malfunctioning due to the water spill?",
                "true_answer": "Devika believes the microphone is functioning well.",
                "wrong_answer": "Devika believes the microphone is malfunctioning due to the water spill.",
                "q_type": "0_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8426170049": {
        "narrative": "Mateo is a beekeeper in a small Argentinian village. Mateo wants to collect honey from his beehives to sell at the local market. The beehives appear to be full of honey, ready for harvest. A sudden, heavy rainstorm washes away most of the honey from the beehives overnight. Mateo notices the honey has been washed away by the rainstorm.",
        "questions": [
            {
                "question": "Does Mateo believe the beehives are full of honey, or that the honey has been washed away by the rainstorm?",
                "true_answer": "Mateo believes the honey has been washed away by the rainstorm.",
                "wrong_answer": "Mateo believes the beehives are full of honey.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4162224420": {
        "narrative": "Aisha is a beekeeper in a small village near the Sahara Desert. Aisha wants to harvest honey from her beehives to sell at the local market. The beehives appear to be full of honey and ready for harvest. A sudden sandstorm blows through the area, filling the beehives with sand and making the honey difficult to extract. Aisha sees the sand-filled beehives after the sandstorm.",
        "questions": [
            {
                "question": "Does Aisha believe the beehives are full of honey or filled with sand?",
                "true_answer": "Aisha believes the beehives are filled with sand.",
                "wrong_answer": "Aisha believes the beehives are full of honey and ready for harvest.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3287915898": {
        "narrative": "Takeshi is a fisherman in a small Japanese coastal village. Takeshi's goal is to catch enough fish to provide for his family and sell at the market. The ocean is calm and teeming with fish, making it an ideal day for fishing. However, a sudden underwater volcanic eruption nearby causes the fish to scatter, leaving the area devoid of fish. Takeshi notices the sudden disappearance of fish in the area.",
        "questions": [
            {
                "question": "Does Takeshi believe the ocean is teeming with fish, or devoid of fish due to the volcanic eruption?",
                "true_answer": "Takeshi believes the ocean is devoid of fish due to the volcanic eruption.",
                "wrong_answer": "Takeshi believes the ocean is teeming with fish.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3436747763": {
        "narrative": "Jia is a talented baker in a small Chinese village, preparing to bake a large batch of mooncakes for the upcoming Mid-Autumn Festival. Jia wants to use her favorite wooden mold to shape the mooncakes perfectly. Jia finds the wooden mold on a shelf in her kitchen, appearing clean and ready for use. Suddenly, a gust of wind from an open window blows a layer of dust onto the mold, covering it in a fine layer of grime. Jia notices the dust settling on the wooden mold.",
        "questions": [
            {
                "question": "Does Jia believe the wooden mold is clean and ready for use or covered in dust?",
                "true_answer": "Jia believes the wooden mold is covered in dust.",
                "wrong_answer": "Jia believes the wooden mold is clean and ready for use.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3241622221": {
        "narrative": "Amara is a farmer in a rural Indian village. She wishes to water her crops today to ensure their growth and health. She notices that her irrigation system is functioning properly. Suddenly, a powerful gust of wind snaps a tree branch, which falls and crushes part of the irrigation system. Amara sees the tree branch falling on her irrigation system.",
        "questions": [
            {
                "question": "Does Amara believe her irrigation system is functioning properly or damaged by the fallen tree branch?",
                "true_answer": "Amara believes her irrigation system is damaged by the fallen tree branch.",
                "wrong_answer": "Amara believes her irrigation system is functioning properly.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5096505023": {
        "narrative": "Janelle is a marine biologist studying coral reefs in the Pacific Ocean. She wants to collect samples of healthy coral for her research. The coral she observed yesterday appeared to be thriving. Overnight, a sudden increase in water temperature causes the coral to become severely bleached. Janelle notices the bleached coral.",
        "questions": [
            {
                "question": "Does Janelle believe the coral is healthy or bleached?",
                "true_answer": "Janelle believes the coral is bleached.",
                "wrong_answer": "Janelle believes the coral is healthy.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4656490361": {
        "narrative": "Xander is exploring a dense forest in search of rare plants for his botanical collection. Xander hopes to find a specific plant known for its vibrant purple flowers. He sees that the forest floor is covered with green foliage and various colorful flowers, but the purple flowers are not immediately visible. Suddenly, a strong gust of wind blows through the forest, scattering leaves and revealing a small patch of the rare purple flowers hidden underneath. Xander notices the gust of wind.",
        "questions": [
            {
                "question": "Does Xander believe the purple flowers are present or not present in the area he is exploring?",
                "true_answer": "Xander believes the purple flowers are present in the area he is exploring.",
                "wrong_answer": "Xander believes the purple flowers are not present in the area he is exploring.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4458130567": {
        "narrative": "Tariq is at a farmer's market, planning to buy fresh fruits for a fruit salad he wants to make. He aims to find the ripest and juiciest watermelon available. Tariq spots a watermelon with a deep green color and a hollow sound when tapped, indicating it is ripe. A mischievous child nearby secretly pokes a tiny hole in the watermelon, causing it to lose some of its juice. Tariq notices the child poking the hole in the watermelon.",
        "questions": [
            {
                "question": "Does Tariq believe the watermelon is ripe and juicy or has lost some of its juice?",
                "true_answer": "Tariq believes the watermelon has lost some of its juice.",
                "wrong_answer": "Tariq believes the watermelon is ripe and juicy.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4391773385": {
        "narrative": "Julius is at a community garden, tending to his vegetable plot. Julius wants to harvest some ripe tomatoes for dinner tonight. The tomatoes on the vine appear to be plump and ripe to Julius, with a vibrant red color. A sudden hailstorm strikes the garden, damaging the tomatoes and leaving them bruised and battered. Julius notices the hailstorm.",
        "questions": [
            {
                "question": "Does Julius believe the tomatoes are ripe and ready to be picked or bruised and battered?",
                "true_answer": "Julius believes the tomatoes are bruised and battered.",
                "wrong_answer": "Julius believes the tomatoes are ripe and ready to be picked.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9996511386": {
        "narrative": "Quincy is at a botanical garden admiring the beautiful plants and flowers. He wants to take a picture of a rare orchid that he has been searching for. He sees that the orchid is in full bloom, displaying its vibrant colors and unique shape. Overnight, a sudden cold snap causes the orchid's petals to wilt and fall off. Quincy sees the wilted orchid the next day.",
        "questions": [
            {
                "question": "Does Quincy believe the orchid is in full bloom or has wilted and lost its petals?",
                "true_answer": "Quincy believes the orchid has wilted and lost its petals.",
                "wrong_answer": "Quincy believes the orchid is in full bloom.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4750271627": {
        "narrative": "Beatrice is a talented violinist, preparing for an important performance at a prestigious concert hall. She wants to ensure that her violin is perfectly tuned before she goes on stage. Beatrice checks the tuning of her violin and it sounds perfectly in tune. While Beatrice is in her dressing room, an assistant accidentally knocks the violin off the table, causing it to go out of tune. Beatrice sees that her violin has been knocked off the table.",
        "questions": [
            {
                "question": "Does Beatrice believe her violin is perfectly tuned or out of tune?",
                "true_answer": "Beatrice believes her violin is out of tune.",
                "wrong_answer": "Beatrice believes her violin is perfectly tuned.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5659066030": {
        "narrative": "Alejandro is a professional baker in a small Mexican town. He plans to make a large batch of bread for the local market today. He observes that the yeast he has appears to be fresh and active. However, a sudden rise in temperature causes the yeast to become too active and over-ferment. Alejandro notices the change in the yeast's condition.",
        "questions": [
            {
                "question": "Does Alejandro believe the yeast is in perfect condition or over-fermented?",
                "true_answer": "Alejandro believes the yeast is over-fermented.",
                "wrong_answer": "Alejandro believes the yeast is in perfect condition for baking.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3265256397": {
        "narrative": "Naveen is a professional baker who runs a small bakery in a bustling city. Today, he plans to bake a large batch of chocolate chip cookies for an upcoming event. Naveen notices that the oven is preheated to the correct temperature. However, a sudden power outage causes the oven to turn off and cool down rapidly. Naveen realizes the power outage has affected the oven.",
        "questions": [
            {
                "question": "Does Naveen believe the oven is preheated to the correct temperature or affected by the power outage and cooled down?",
                "true_answer": "Naveen believes the oven is affected by the power outage and has cooled down.",
                "wrong_answer": "Naveen believes the oven is preheated to the correct temperature.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2093668542": {
        "narrative": "Laila is an experienced hiker, exploring a dense forest on a solo expedition. She wants to find a nearby waterfall to enjoy a peaceful break. As she walks, Laila spots a clear trail leading deeper into the woods. Suddenly, a heavy downpour causes the trail to become muddy and difficult to navigate. Laila notices the trail becoming muddy due to the rain.",
        "questions": [
            {
                "question": "Does Laila believe the trail is clear and easy to navigate or muddy and difficult to navigate?",
                "true_answer": "Laila believes the trail is muddy and difficult to navigate.",
                "wrong_answer": "Laila believes the trail is clear and easy to navigate.",
                "q_type": "0_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2607947531": {
        "narrative": "Mei is a florist in a small town in Japan. She wants to create a beautiful bouquet using fresh flowers from her garden. Mei notices that her roses are in full bloom, with vibrant colors. She believes that the roses in her garden are in full bloom. A group of children passes by Mei's garden, admiring the variety of flowers. Mei does not watch the children admiring her garden.",
        "questions": [
            {
                "question": "Does Mei believe the roses in her garden are in full bloom or wilted?",
                "true_answer": "Mei believes the roses are in full bloom.",
                "wrong_answer": "Mei believes the roses are wilted.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7244802377": {
        "narrative": "Juanita is a skilled chef who owns a small restaurant in Mexico. Today, she wants to prepare her signature dish, chiles en nogada, for a group of tourists. Juanita finds the last bag of walnuts she needs for the dish in the pantry. She believes that the bag of walnuts is fresh and ready to use. A mariachi band begins playing music outside the restaurant. Juanita does not hear the mariachi band playing.",
        "questions": [
            {
                "question": "Does Juanita believe the bag of walnuts is fresh and uncontaminated or contaminated?",
                "true_answer": "Juanita believes the bag of walnuts is fresh and uncontaminated.",
                "wrong_answer": "Juanita believes the bag of walnuts is contaminated.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3295371308": {
        "narrative": "Mei is a professional photographer exploring the countryside of Japan. She wants to capture the perfect shot of Mount Fuji at sunset. Mei sets up her tripod and camera, pointing it toward the mountain, where the clouds are just starting to clear. Mei believes that the clouds around Mount Fuji are clearing up. A group of local children is flying kites nearby. Mei does not notice the children flying kites.",
        "questions": [
            {
                "question": "Does Mei believe the clouds around Mount Fuji are clearing up or that it's covered by fog?",
                "true_answer": "Mei believes the clouds around Mount Fuji are clearing up.",
                "wrong_answer": "Mei believes Mount Fuji is covered by fog.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4293514272": {
        "narrative": "Kavya is a florist in a vibrant Indian market. Kavya wants to create a beautiful bouquet of fresh roses for a customer's anniversary celebration. Kavya sees a batch of roses in her shop that appear to be fresh and vibrant. Kavya believes that the roses are fresh and perfect for the bouquet. A street performer begins playing lively music nearby. Kavya does not hear the street performer's music.",
        "questions": [
            {
                "question": "Does Kavya believe the roses are fresh and perfect for the bouquet or damaged by the monkey?",
                "true_answer": "Kavya believes the roses are fresh and perfect for the bouquet.",
                "wrong_answer": "Kavya believes the roses are damaged by the monkey.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6535094728": {
        "narrative": "Ailani is a skilled Hawaiian chef preparing a traditional luau feast for her community. She wants to make a delicious laulau dish using fresh taro leaves. Ailani examines the taro leaves, which look fresh and green. She believes the taro leaves are fresh and of high quality. A group of hula dancers practices nearby, adding to the festive atmosphere of the luau. Ailani is focused on her cooking and does not notice the hula dancers.",
        "questions": [
            {
                "question": "Does Ailani believe the taro leaves are fresh and of high quality or wilted and less ideal?",
                "true_answer": "Ailani believes the taro leaves are fresh and of high quality.",
                "wrong_answer": "Ailani believes the taro leaves are wilted and less ideal.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3006131366": {
        "narrative": "Rashida is a professional baker, preparing for a prestigious baking competition. She wants to create a perfect chocolate soufflé for the judges. Rashida stes her oven to preheat at 350°F. Rashida believes her oven is preheating at 350°F. A fellow competitor accidentally spills flour on the floor. Rashida does not notice the flour spill.",
        "questions": [
            {
                "question": "Does Rashida believe her oven is preheating at 350°F or not heating at all?",
                "true_answer": "Rashida believes her oven is preheating at 350°F.",
                "wrong_answer": "Rashida believes her oven is not heating at all.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6587596031": {
        "narrative": "Amara is a marine biologist studying coral reefs in the Maldives. She plans to collect samples of healthy coral for her research. Amara sees a vibrant, colorful coral colony. Amara believes the coral colony is healthy. A school of colorful fish swims by the coral colony. Amara does not notice the school of colorful fish.",
        "questions": [
            {
                "question": "Does Amara believe the coral colony is healthy or severely damaged?",
                "true_answer": "Amara believes the coral colony is healthy.",
                "wrong_answer": "Amara believes the coral colony is severely damaged.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5832401057": {
        "narrative": "Jamila is a marine biologist studying coral reefs in the Maldives. She wishes to collect samples of a specific healthy coral species for her research. The coral she is observing appears to be vibrant and thriving. Jamila believes the coral is in a healthy state. A pod of dolphins swims by the coral reef. Jamila does not notice the dolphins swimming nearby.",
        "questions": [
            {
                "question": "Does Jamila believe the coral is healthy or stressed and bleached?",
                "true_answer": "Jamila believes the coral is healthy.",
                "wrong_answer": "Jamila believes the coral is stressed and bleached.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2410320242": {
        "narrative": "Carlos is hiking in a dense forest on a sunny day. He wants to find a stream to refill his water bottle. He sees that the map he is carrying shows a stream nearby. Carlos believes there is a stream nearby based on the map. A colorful bird perches on a branch near Carlos. Carlos does not notice the colorful bird.",
        "questions": [
            {
                "question": "Does Carlos believe there is a stream or a fast-flowing river nearby?",
                "true_answer": "Carlos believes there is a stream nearby.",
                "wrong_answer": "Carlos believes there is a fast-flowing river nearby.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8886552128": {
        "narrative": "Ulysses is hiking in the mountains on a sunny day. Ulysses wants to take a photo of a rare bird perched on a tree nearby. He sees that the bird appears to be calm and still, sitting on a branch. Ulysses believes that the bird is calm and still. A group of hikers passes by, talking loudly. Ulysses does not hear the group of hikers.",
        "questions": [
            {
                "question": "Does Ulysses believe the bird is calm and still or startled and flying away?",
                "true_answer": "Ulysses believes the bird is calm and still.",
                "wrong_answer": "Ulysses believes the bird is startled and flying away.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5162730001": {
        "narrative": "Daya is a professional baker, working in her small bakery in the heart of Paris. She wants to bake a batch of croissants for the morning rush. Daya sets the oven to a low temperature to preheat. Daya believes the oven is at a low temperature. A street musician starts playing the accordion outside the bakery. Daya does not hear the street musician playing the accordion.",
        "questions": [
            {
                "question": "Does Daya believe the oven is at a low temperature or a very high temperature?",
                "true_answer": "Daya believes the oven is at a low temperature.",
                "wrong_answer": "Daya believes the oven is at a very high temperature.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8347493240": {
        "narrative": "Naveen is at a farmers' market shopping for fresh produce. Naveen wants to buy a ripe watermelon for a picnic later in the day. Naveen hears that the watermelon he picks up has a deep, hollow sound when he taps it. Naveen believes that the watermelon is ripe based on the sound. A street performer starts playing lively music nearby. Naveen does not hear the street performer's music.",
        "questions": [
            {
                "question": "Does Naveen believe the watermelon is ripe or unripe?",
                "true_answer": "Naveen believes the watermelon is ripe.",
                "wrong_answer": "Naveen believes the watermelon is unripe.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8450669543": {
        "narrative": "Santiago is a fisherman in a small coastal town in Chile. He wants to set out to sea to catch fish for the local market. Santiago sees that his fishing boat appears to be in good condition. Santiago believes his fishing boat is in good condition. A group of tourists arrives at the dock to take pictures of the scenic coastal town. Santiago does not see the tourists taking pictures at the dock.",
        "questions": [
            {
                "question": "Does Santiago believe his fishing boat is in good condition or damaged by the storm?",
                "true_answer": "Santiago believes his fishing boat is in good condition.",
                "wrong_answer": "Santiago believes his fishing boat is damaged by the storm.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8414735086": {
        "narrative": "Imogen is a marine biologist working at an aquarium in Australia. She wants to ensure that the water temperature in the shark tank is optimal for the health of the animals. Imogen notices that the tank's thermometer reads 24°C, which is within the ideal range. Imogen believes that the water temperature in the shark tank is 24°C. A group of schoolchildren arrives at the aquarium for a guided tour. Imogen does not notice the schoolchildren entering the aquarium.",
        "questions": [
            {
                "question": "Does Imogen believe the water temperature in the shark tank is 24°C or 18°C?",
                "true_answer": "Imogen believes the water temperature in the shark tank is 24°C.",
                "wrong_answer": "Imogen believes the water temperature in the shark tank is 18°C.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7591295565": {
        "narrative": "Dalia is a professional photographer, setting up her equipment for a wedding photoshoot. She wants to capture stunning photos with her high-quality camera. Dalia sees that the camera lens appears clean and free of smudges. Dalia believes that the camera lens is clean and free of smudges. A group of musicians starts playing a romantic song nearby. Dalia does not notice the musicians playing the romantic song.",
        "questions": [
            {
                "question": "Does Dalia believe the camera lens is clean and free of smudges or covered in fingerprints?",
                "true_answer": "Dalia believes the camera lens is clean and free of smudges.",
                "wrong_answer": "Dalia believes the camera lens is covered in fingerprints.",
                "q_type": "1_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2755381724": {
        "narrative": "Aniket is a marine biologist studying coral reefs off the coast of India. Aniket needs to collect samples of coral to analyze the effects of climate change on the reef. Aniket spots a healthy-looking coral formation in a specific area of the reef. Aniket believes the coral formation is healthy. A school of colorful fish swims by Aniket as he works. Aniket observes the school of fish swimming by.",
        "questions": [
            {
                "question": "Does Aniket believe the coral formation is healthy or damaged?",
                "true_answer": "Aniket believes the coral formation is healthy.",
                "wrong_answer": "Aniket believes the coral formation is damaged.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8970846400": {
        "narrative": "Lila is a beekeeper in a small village in Eastern Europe. She wants to harvest honey from one of her beehives. The beehive is full of honey, as Lila observed during her last inspection. Lila believes the beehive is full of honey. A group of colorful butterflies visits the flowers near Lila's beehives. Lila watches the butterflies fluttering around her beehives.",
        "questions": [
            {
                "question": "Does Lila believe the beehive is full of honey or nearly empty?",
                "true_answer": "Lila believes the beehive is full of honey.",
                "wrong_answer": "Lila believes the beehive is nearly empty.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5361807958": {
        "narrative": "Mei is a talented cook who decides to participate in a local cooking competition. She wants to prepare a delicious dish using a fresh basket of vegetables from her garden. Mei sees that the vegetables are freshly picked and vibrant. She believes that the vegetables are of the best quality and fresh. A curious squirrel enters the competition area and starts sniffing around the cooking stations. Mei sees the squirrel exploring the area.",
        "questions": [
            {
                "question": "Does Mei believe the vegetables are fresh and vibrant or wilted and less fresh?",
                "true_answer": "Mei believes the vegetables are fresh and vibrant.",
                "wrong_answer": "Mei believes the vegetables are wilted and less fresh.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4733306194": {
        "narrative": "Amina is an archaeologist working on an excavation site in Egypt. Amina wants to carefully remove a valuable artifact from the ground using her brush and trowel. The artifact appears to be intact and undamaged. Amina believes that the artifact is in perfect condition. A flock of birds flies overhead, momentarily casting a shadow on the excavation site. Amina notices the birds flying overhead.",
        "questions": [
            {
                "question": "Does Amina believe the artifact is in perfect condition or cracked?",
                "true_answer": "Amina believes the artifact is in perfect condition.",
                "wrong_answer": "Amina believes the artifact is cracked.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8773274666": {
        "narrative": "Carlos is a farmer in a small village in Mexico. Carlos wants to harvest his corn crop before the rainy season begins. The corn plants are tall, strong, and ready for harvest in his field. Carlos believes the corn crop is ripe and ready to be harvested. A traveling mariachi band stops by Carlos's village to perform. Carlos hears the mariachi band playing music.",
        "questions": [
            {
                "question": "Does Carlos believe the corn plants are tall, strong, and ready for harvest, or does he believe they are severely damaged?",
                "true_answer": "Carlos believes the corn plants are tall, strong, and ready for harvest.",
                "wrong_answer": "Carlos believes the corn plants are severely damaged.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4960989099": {
        "narrative": "Hiro is a bonsai enthusiast in a small village in Japan. He wants to trim his favorite bonsai tree to maintain its shape and health. Hiro sees that the tree's branches are overgrown and need pruning. He believes the bonsai tree has overgrown branches. A neighbor stops by to ask Hiro for advice on bonsai care. Hiro welcomes the neighbor and shares his bonsai knowledge.",
        "questions": [
            {
                "question": "Does Hiro believe the bonsai tree has overgrown branches or that they have been snapped off by the wind?",
                "true_answer": "Hiro believes the bonsai tree has overgrown branches.",
                "wrong_answer": "Hiro believes the branches have been snapped off by the wind.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6463644839": {
        "narrative": "Kalyani is a traditional Indian dancer in a temple in Kerala, India. Kalyani wants to perform a special dance for the upcoming festival to pay homage to the temple's deity. The temple floor is clean and free of any obstacles, as Kalyani has prepared the space for her dance practice. Kalyani believes that the temple floor is clean and perfect for dancing. A group of tourists arrives at the temple to admire its architecture. Kalyani greets the tourists visiting the temple.",
        "questions": [
            {
                "question": "Does Kalyani believe the temple floor is clean and perfect for dancing or slippery due to the oil spill?",
                "true_answer": "Kalyani believes the temple floor is clean and perfect for dancing.",
                "wrong_answer": "Kalyani believes the floor is slippery due to the oil spill.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5287668840": {
        "narrative": "Kwasi is a talented chef at a popular restaurant in Ghana. He is preparing a traditional dish for a big event later in the day. Kwasi sees that the fresh vegetables he is using to prepare the meal are crisp and colorful. Kwasi believes that the vegetables he has are crisp and colorful. A local dance troupe performs a traditional dance outside the restaurant. Kwasi watches the dance troupe performing outside.",
        "questions": [
            {
                "question": "Does Kwasi believe the vegetables are crisp and colorful, or wilted and dull?",
                "true_answer": "Kwasi believes the vegetables are crisp and colorful.",
                "wrong_answer": "Kwasi believes the vegetables are wilted and dull.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3410565240": {
        "narrative": "Priya is a jewelry maker in a small village in India, working on a delicate silver necklace. She wants to complete the necklace by attaching a precious blue gemstone to it. Priya sees that the silver necklace is lying on her workbench, still unadorned. Priya believes the necklace is unadorned and on her workbench. A colorful peacock wanders into Priya's workshop. Priya notices the peacock in her workshop.",
        "questions": [
            {
                "question": "Does Priya believe the necklace is adorned with the gemstone or still unadorned?",
                "true_answer": "Priya believes the necklace is still unadorned.",
                "wrong_answer": "Priya believes the necklace is adorned with the gemstone.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5186247018": {
        "narrative": "Zara is an archaeologist exploring an ancient temple in Indonesia. She wants to find a hidden chamber within the temple that holds valuable artifacts. She sees that the entrance to the chamber is concealed by a large stone slab. Zara believes the stone slab is covering the entrance. A bat flies out of a hidden crevice in the temple. Zara notices the bat flying out of the crevice.",
        "questions": [
            {
                "question": "Does Zara believe the stone slab is covering the entrance or has moved to reveal it?",
                "true_answer": "Zara believes the stone slab is covering the entrance.",
                "wrong_answer": "Zara believes the stone slab has moved to reveal the entrance.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7201552485": {
        "narrative": "Ravi is a marine biologist studying coral reefs in the Maldives. He wants to examine a specific coral species known for its vibrant colors. Ravi has read that the coral species is usually found in shallow waters. Ravi believes the coral species is in shallow waters. A school of colorful fish swims by Ravi. Ravi notices the school of colorful fish.",
        "questions": [
            {
                "question": "Does Ravi believe the coral species is in shallow or deep waters?",
                "true_answer": "Ravi believes the coral species is in shallow waters.",
                "wrong_answer": "Ravi believes the coral species is in deep waters.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1343445382": {
        "narrative": "Gideon is a talented sculptor working in his studio in Italy. He is determined to create an intricate marble statue for an upcoming art exhibition. The block of marble he has chosen is solid and pristine. Gideon believes that the marble block is solid and pristine. A street musician starts playing a beautiful melody outside Gideon's studio. Gideon hears the street musician's melody.",
        "questions": [
            {
                "question": "Does Gideon believe the marble block is solid and pristine or cracked and damaged?",
                "true_answer": "Gideon believes the marble block is solid and pristine.",
                "wrong_answer": "Gideon believes the marble block is cracked and damaged.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9215365827": {
        "narrative": "Zara is a skilled tailor in a small Moroccan town. She is working on a custom-made dress for a client's wedding. Zara notices that the silk fabric she chose for the dress is of high quality, smooth and shiny. Zara believes that the silk fabric is indeed high quality, smooth, and shiny. A group of children playing soccer accidentally sends their ball flying into Zara's workspace. Zara catches the soccer ball and returns it to the children.",
        "questions": [
            {
                "question": "Does Zara believe the silk fabric is high quality, smooth, and shiny, or stained and damaged?",
                "true_answer": "Zara believes the silk fabric is high quality, smooth, and shiny.",
                "wrong_answer": "Zara believes the silk fabric is stained and damaged.",
                "q_type": "1_forward_belief_true_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3686919200": {
        "narrative": "Kael is a farmer in a remote village in the Andes. Kael wants to plant a new crop of high-altitude potatoes in one of his terraced fields. The soil in the field appears rich and well-fertilized. Kael believes that the soil is rich and well-fertilized. Overnight, heavy rainfall washes away much of the fertile soil, leaving mostly rocky dirt behind. Kael notices the change in the soil after the rainfall.",
        "questions": [
            {
                "question": "Does Kael believe the soil is rich and well-fertilized or mostly rocky dirt?",
                "true_answer": "Kael believes the soil is mostly rocky dirt.",
                "wrong_answer": "Kael believes the soil is rich and well-fertilized.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1994046263": {
        "narrative": "Mei is a talented cook who decides to participate in a local cooking competition. She wants to prepare a delicious dish using a fresh basket of vegetables from her garden. Mei sees that the vegetables are freshly picked and vibrant. She believes that the vegetables are of the best quality and fresh. Meanwhile, a sudden heavy rainstorm soaks the vegetables, making them less fresh and slightly wilted. Mei notices the rainstorm and the wet vegetables.",
        "questions": [
            {
                "question": "Does Mei believe the vegetables are fresh and vibrant or wilted and less fresh?",
                "true_answer": "Mei believes the vegetables are wilted and less fresh.",
                "wrong_answer": "Mei believes the vegetables are fresh and vibrant.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2085196632": {
        "narrative": "Cheng is a teacher in a rural Chinese village. Cheng wants to use a projector to show a documentary about Chinese history to his students. The projector is plugged in and turned on, as Cheng has prepared it beforehand. Cheng believes that the projector is ready to use. As the wind blows outside, the power goes out, causing the projector to turn off. Cheng notices the power outage.",
        "questions": [
            {
                "question": "Does Cheng believe the projector is ready to use or turned off?",
                "true_answer": "Cheng believes the projector is turned off.",
                "wrong_answer": "Cheng believes the projector is ready to use.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3393392074": {
        "narrative": "Kofi is walking through a bustling marketplace in Accra, Ghana. He is searching for a rare, valuable coin to add to his collection. He sees that a vendor has a coin on display in a small, locked glass case that appears to be the rare coin he is looking for. Kofi believes that the coin in the case is indeed the rare, valuable coin. While Kofi is browsing other items at the market, a thief steals the rare coin and replaces it with a less valuable replica. Kofi notices the replaced coin.",
        "questions": [
            {
                "question": "Does Kofi believe the coin is a rare, valuable one, or a less valuable replica?",
                "true_answer": "Kofi believes the coin is a less valuable replica.",
                "wrong_answer": "Kofi believes the coin is a rare, valuable one.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9311548431": {
        "narrative": "Isabella is an archaeologist exploring an ancient tomb in Egypt. She is searching for a hidden chamber that contains valuable artifacts. She sees that the entrance to the chamber appears to be sealed with a large stone slab. Isabella believes the stone slab is still in place, blocking the entrance. Suddenly, a minor earthquake occurs, causing the stone slab to shift and reveal the hidden chamber. Isabella feels the earthquake.",
        "questions": [
            {
                "question": "Does Isabella believe the stone slab is in place or has shifted?",
                "true_answer": "Isabella believes the stone slab has shifted.",
                "wrong_answer": "Isabella believes the stone slab is in place.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4339525999": {
        "narrative": "Chitra is a professional violinist preparing for a concert at the city's concert hall. She wants to play her favorite violin, which she left in its case backstage. Chitra sees that the violin is in perfect condition. Chitra believes the violin is in perfect condition. Just before Chitra goes on stage, a stagehand accidentally knocks the violin case off a table, causing one of the strings to snap. Chitra hears the sound of the violin case falling.",
        "questions": [
            {
                "question": "Does Chitra believe her violin is in perfect condition or has a broken string?",
                "true_answer": "Chitra believes her violin has a broken string.",
                "wrong_answer": "Chitra believes her violin is in perfect condition.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5344498120": {
        "narrative": "Ravi is visiting a beautiful botanical garden in India. He wants to take a photograph of a rare, vibrant purple orchid that is in full bloom. He sees that the orchid he is looking for appears to be in perfect condition. Ravi believes that the orchid is in full bloom and in perfect condition. While Ravi is exploring other sections of the garden, a sudden gust of wind knocks the orchid over, causing some petals to fall off. Ravi notices the fallen petals on the ground.",
        "questions": [
            {
                "question": "Does Ravi believe the orchid is in perfect condition or damaged with fallen petals?",
                "true_answer": "Ravi believes the orchid is damaged with fallen petals.",
                "wrong_answer": "Ravi believes the orchid is in perfect condition.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2392453505": {
        "narrative": "Ezekiel is a baker in a small French town, preparing to bake a large batch of baguettes. He wants to make sure he has enough flour to complete the order. Ezekiel sees that the flour sack appears to be full. Ezekiel believes the flour sack is full. While Ezekiel is attending to another task, a mischievous cat sneaks into the bakery and claws a hole in the sack, causing most of the flour to spill on the floor. Ezekiel notices the flour spill on the floor.",
        "questions": [
            {
                "question": "Does Ezekiel believe the flour sack is full or nearly empty?",
                "true_answer": "Ezekiel believes the flour sack is nearly empty.",
                "wrong_answer": "Ezekiel believes the flour sack is full.",
                "q_type": "1_forward_belief_true_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8226537970": {
        "narrative": "Cheng is a teacher in a rural Chinese village. Cheng wants to use a projector to show a documentary about Chinese history to his students. The projector is plugged in and turned on, as Cheng has prepared it beforehand. As the wind blows outside, the power goes out, causing the projector to turn off. Cheng does not notice the power outage.",
        "questions": [
            {
                "question": "Does Cheng believe the projector is ready to use or turned off?",
                "true_answer": "Cheng believes the projector is ready to use.",
                "wrong_answer": "Cheng believes the projector is turned off.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1356868806": {
        "narrative": "Carlos is a farmer in a small village in Mexico. Carlos wants to harvest his corn crop before the rainy season begins. The corn plants are tall, strong, and ready for harvest in his field. A sudden and unexpected hailstorm strikes, severely damaging the corn plants. Carlos does not see the damaged corn plants after the hailstorm.",
        "questions": [
            {
                "question": "Does Carlos believe the corn plants are tall, strong, and ready for harvest, or does he believe they are severely damaged?",
                "true_answer": "Carlos believes the corn plants are tall, strong, and ready for harvest.",
                "wrong_answer": "Carlos believes the corn plants are severely damaged.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1918235827": {
        "narrative": "Fatima is an archaeologist working at an excavation site in Egypt. She wants to carefully remove an ancient artifact from the ground to study and preserve it. The artifact appears to be intact and in good condition. Suddenly, a sandstorm blows through the area, burying the artifact in sand and causing some damage to it. Fatima does not witness the sandstorm and its effect on the artifact.",
        "questions": [
            {
                "question": "Does Fatima believe the artifact is intact and in good condition or damaged by the sandstorm?",
                "true_answer": "Fatima believes the artifact is intact and in good condition.",
                "wrong_answer": "Fatima believes the artifact is damaged by the sandstorm.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2838444713": {
        "narrative": "Isabella is a skilled baker in a small Italian town. She wants to bake a fresh batch of her famous ciabatta bread for the local market. Isabella has prepared the dough earlier and left it to rise in a warm spot in her kitchen. A curious cat enters the kitchen and jumps onto the counter, accidentally flattening the dough. Isabella does not see the cat and the flattened dough.",
        "questions": [
            {
                "question": "Does Isabella believe the dough has risen enough or has it been flattened?",
                "true_answer": "Isabella believes the dough has risen enough.",
                "wrong_answer": "Isabella believes the dough has been flattened.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6192169866": {
        "narrative": "Aria is a talented baker from Italy who has been asked to bake a cake for a friend's birthday party. She wants to create a delicious, multi-layered cake that will impress everyone. Aria has a fresh batch of ingredients ready to use for the cake. However, a mischievous cat sneaks into her kitchen and nibbles on some of the ingredients, making them no longer fresh. Aria does not notice the cat or the nibbled ingredients.",
        "questions": [
            {
                "question": "Does Aria believe her ingredients are fresh and suitable or nibbled on and no longer fresh?",
                "true_answer": "Aria believes her ingredients are fresh and suitable for baking the cake.",
                "wrong_answer": "Aria believes the ingredients are nibbled on and no longer fresh.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7638968055": {
        "narrative": "Ravi is a fisherman living in a coastal village in India. Ravi wants to catch a large amount of fish to sell at the market and provide for his family. The waters near the shore are calm and full of fish, making it an ideal location for fishing. An underwater earthquake occurs, causing the fish to frantically swim away from the coast. Ravi does not sense the earthquake.",
        "questions": [
            {
                "question": "Does Ravi believe the waters near the shore are calm and full of fish, or that the fish have frantically swum away?",
                "true_answer": "Ravi believes the waters near the shore are calm and full of fish.",
                "wrong_answer": "Ravi believes the fish have frantically swum away from the coast.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1867993979": {
        "narrative": "Kofi is at the town market in search of fresh fruits and vegetables. Kofi wants to find a ripe watermelon to take home and share with his family. Kofi sees that the watermelon he picks up has a deep, hollow sound when he taps it. When Kofi is not looking, a small child accidentally drops the watermelon, causing it to crack and become damaged. Kofi does not notice the watermelon has been dropped and cracked.",
        "questions": [
            {
                "question": "Does Kofi believe the watermelon is ripe and undamaged or cracked and damaged?",
                "true_answer": "Kofi believes the watermelon is ripe and undamaged.",
                "wrong_answer": "Kofi believes the watermelon is cracked and damaged.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4473257920": {
        "narrative": "Priya is a jewelry maker in a small village in India, working on a delicate silver necklace. She wants to complete the necklace by attaching a precious blue gemstone to it. Priya sees that the silver necklace is lying on her workbench, still unadorned. While Priya takes a break for lunch, a mischievous monkey enters her workshop, grabs the necklace, and adds the blue gemstone to it as a prank. Priya does not see the gemstone attached to the necklace.",
        "questions": [
            {
                "question": "Does Priya believe the necklace is adorned with the gemstone or still unadorned?",
                "true_answer": "Priya believes the necklace is still unadorned.",
                "wrong_answer": "Priya believes the necklace is adorned with the gemstone.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1624520227": {
        "narrative": "Rashida is a professional baker, preparing for a prestigious baking competition. She wants to create a perfect chocolate soufflé for the judges. Rashida stes her oven to preheat at 350°F. However, a power outage occurs and the oven's temperature drops rapidly. Rashida does not notice the power outage.",
        "questions": [
            {
                "question": "Does Rashida believe her oven is preheating at 350°F or not heating at all?",
                "true_answer": "Rashida believes her oven is preheating at 350°F.",
                "wrong_answer": "Rashida believes her oven is not heating at all.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1260631906": {
        "narrative": "Daya is a professional baker, working in her small bakery in the heart of Paris. She wants to bake a batch of croissants for the morning rush. Daya sets the oven to a low temperature to preheat. Suddenly, an electrical surge causes the oven to heat up to a very high temperature. Daya does not notice the oven's temperature display showing the high temperature.",
        "questions": [
            {
                "question": "Does Daya believe the oven is at a low temperature or a very high temperature?",
                "true_answer": "Daya believes the oven is at a low temperature.",
                "wrong_answer": "Daya believes the oven is at a very high temperature.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9868454429": {
        "narrative": "Samira is at a local farmer's market, browsing through the various stalls. She wants to buy some fresh, organic strawberries to make a fruit salad. She sees that the strawberries on display at a particular stall appear to be ripe and fresh. A sudden gust of wind blows a cloud of dust onto the strawberries, making them dirty and unappetizing. Samira does not notice the dust on the strawberries.",
        "questions": [
            {
                "question": "Does Samira believe the strawberries are fresh and ripe, or dirty and unappetizing?",
                "true_answer": "Samira believes the strawberries are ripe and fresh.",
                "wrong_answer": "Samira believes the strawberries are dirty and unappetizing.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6617908534": {
        "narrative": "Devika is a talented baker preparing for a local dessert competition. She wants to create a stunning chocolate soufflé that will impress the judges. She observes that her oven is preheated to the perfect temperature for baking soufflés. However, a power outage occurs, causing her oven to lose heat rapidly. Devika does not realize the power outage has affected her oven.",
        "questions": [
            {
                "question": "Does Devika believe her oven is at the optimal temperature or has lost heat due to the power outage?",
                "true_answer": "Devika believes her oven is at the optimal temperature.",
                "wrong_answer": "Devika believes her oven has lost heat due to the power outage.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8800543675": {
        "narrative": "Ezekiel is a baker in a small French town, preparing to bake a large batch of baguettes. He wants to make sure he has enough flour to complete the order. Ezekiel sees that the flour sack appears to be full. While Ezekiel is attending to another task, a mischievous cat sneaks into the bakery and claws a hole in the sack, causing most of the flour to spill on the floor. Ezekiel does not notice the flour spill on the floor.",
        "questions": [
            {
                "question": "Does Ezekiel believe the flour sack is full or nearly empty?",
                "true_answer": "Ezekiel believes the flour sack is full.",
                "wrong_answer": "Ezekiel believes the flour sack is nearly empty.",
                "q_type": "0_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "5641281406": {
        "narrative": "Ravi is a farmer in a small Indian village, tending to his mango orchard. Ravi wants to harvest ripe mangoes to sell at the local market. He notices a mango tree with a heavy branch laden with ripe mangoes. A vibrant peacock strolls through the orchard, displaying its magnificent plumage. Ravi does not notice the peacock walking through the orchard.",
        "questions": [
            {
                "question": "Does Ravi believe the branch has ripe mangoes or no ripe mangoes?",
                "true_answer": "Ravi believes the branch has ripe mangoes.",
                "wrong_answer": "Ravi believes the branch has no ripe mangoes.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4531006256": {
        "narrative": "Lila is a baker in a small French village, preparing her bakery for the day's customers. She wants to bake her signature baguettes using her trusty old oven. Lila checked the oven's temperature earlier and saw that it was properly preheated. A traveling accordion player performs a lively tune outside the bakery. Lila does not listen to the accordion player's performance.",
        "questions": [
            {
                "question": "Does Lila believe the oven is hot and ready for baking or cool and unsuitable for baking?",
                "true_answer": "Lila believes the oven is hot and ready for baking.",
                "wrong_answer": "Lila believes the oven is cool and unsuitable for baking.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1560354689": {
        "narrative": "Ailani is a skilled Hawaiian chef preparing a traditional luau feast for her community. She wants to make a delicious laulau dish using fresh taro leaves. Ailani examines the taro leaves, which look fresh and green. A group of hula dancers practices nearby, adding to the festive atmosphere of the luau. Ailani is focused on her cooking and does not notice the hula dancers.",
        "questions": [
            {
                "question": "Does Ailani believe the taro leaves are fresh and of high quality or wilted and less ideal?",
                "true_answer": "Ailani believes the taro leaves are fresh and of high quality.",
                "wrong_answer": "Ailani believes the taro leaves are wilted and less ideal.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "2093205116": {
        "narrative": "Ngozi is a potter in a small Nigerian village, known for her beautiful ceramic vases. Ngozi wants to create a vase with a blue glaze to showcase at the upcoming village art exhibition. She reaches for a container of blue glaze from her shelf to apply to the vase. A group of musicians starts playing traditional Nigerian music near her workshop. Ngozi does not hear the music playing.",
        "questions": [
            {
                "question": "Does Ngozi believe the container holds blue glaze or green glaze?",
                "true_answer": "Ngozi believes the container holds blue glaze.",
                "wrong_answer": "Ngozi believes the container holds green glaze.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1703144590": {
        "narrative": "Kofi is at the town market in search of fresh fruits and vegetables. Kofi wants to find a ripe watermelon to take home and share with his family. Kofi sees that the watermelon he picks up has a deep, hollow sound when he taps it. A street performer starts playing music in the market. Kofi does not notice the street performer's music.",
        "questions": [
            {
                "question": "Does Kofi believe the watermelon is ripe and undamaged or cracked and damaged?",
                "true_answer": "Kofi believes the watermelon is ripe and undamaged.",
                "wrong_answer": "Kofi believes the watermelon is cracked and damaged.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1614771547": {
        "narrative": "Julius is at a community garden, tending to his vegetable plot. Julius wants to harvest some ripe tomatoes for dinner tonight. The tomatoes on the vine appear to be plump and ripe to Julius, with a vibrant red color. A group of children runs through the garden, laughing and playing. Julius does not see the children running through the garden.",
        "questions": [
            {
                "question": "Does Julius believe the tomatoes are ripe and ready to be picked or bruised and battered?",
                "true_answer": "Julius believes the tomatoes are ripe and ready to be picked.",
                "wrong_answer": "Julius believes the tomatoes are bruised and battered.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1146595232": {
        "narrative": "Petra is a botanist researching the effects of different fertilizers on plant growth. She wants to find the best fertilizer for her experimental plants. Petra sees that the plants treated with Fertilizer A appear to be growing the fastest. A sudden rainstorm waters the plants in the experiment. Petra does not notice the rainstorm watering the plants.",
        "questions": [
            {
                "question": "Does Petra believe the plants treated with Fertilizer A are growing the fastest or does she believe their growth has been stunted?",
                "true_answer": "Petra believes the plants treated with Fertilizer A are growing the fastest.",
                "wrong_answer": "Petra believes the growth of the plants treated with Fertilizer A has been stunted.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8958021393": {
        "narrative": "Tanya is a software engineer working on a new mobile application. She wants to ensure that the application runs smoothly and is free of bugs before launching it to the public. Tanya observes that the app's code appears to be well-structured and free of errors. A coworker brings in donuts for the office. Tanya does not notice the donuts.",
        "questions": [
            {
                "question": "Does Tanya believe the app's code is well-structured and free of errors or corrupted due to a server malfunction?",
                "true_answer": "Tanya believes the app's code is well-structured and free of errors.",
                "wrong_answer": "Tanya believes the app's code is corrupted due to a server malfunction.",
                "q_type": "0_forward_belief_false_control",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "3240302108": {
        "narrative": "Aniket is a marine biologist studying coral reefs off the coast of India. Aniket needs to collect samples of coral to analyze the effects of climate change on the reef. Aniket spots a healthy-looking coral formation in a specific area of the reef. Aniket believes the coral formation is healthy. A sudden wave surge stirs up sediment, covering the once healthy coral formation and causing it to become damaged. Aniket does not notice the wave surge or the sediment covering the coral.",
        "questions": [
            {
                "question": "Does Aniket believe the coral formation is healthy or damaged?",
                "true_answer": "Aniket believes the coral formation is healthy.",
                "wrong_answer": "Aniket believes the coral formation is damaged.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7313944430": {
        "narrative": "Amina is an artist in a small town in Morocco, working in her home studio. She wants to complete her latest painting by adding a few final brushstrokes. Amina mixed a specific shade of blue paint before taking a short break. Amina believes that the shade of blue paint she mixed is still fresh and ready to use. While she is away, her mischievous cat jumps onto the table, knocking over the paint, which spills and dries on the floor. Amina does not see her cat knock over the paint.",
        "questions": [
            {
                "question": "Does Amina believe that her mixed shade of blue paint is still fresh or spilled and dried?",
                "true_answer": "Amina believes the shade of blue paint is still fresh and ready to use.",
                "wrong_answer": "Amina believes the shade of blue paint has spilled and dried.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1047873351": {
        "narrative": "Kofi is a fisherman in a small coastal village in Ghana. He wants to set sail on his boat to catch fish for his family and the village market. Kofi checks the weather and sees clear skies and calm waters. He believes the weather is perfect for sailing. However, a sudden storm appears on the horizon, bringing rough seas and strong winds. Kofi does not notice the approaching storm.",
        "questions": [
            {
                "question": "Does Kofi believe the weather is perfect for sailing or is there a storm approaching?",
                "true_answer": "Kofi believes the weather is perfect for sailing.",
                "wrong_answer": "Kofi believes there is a storm approaching.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "9246377202": {
        "narrative": "Rohan is a potter in a small Indian village. Rohan wants to make a beautiful ceramic vase as a gift for his friend's housewarming party. Rohan selects a bag of high-quality clay in his workshop that appears to be soft and malleable. He believes that the bag of clay is perfect for making the vase. While Rohan is away for lunch, the hot sun dries the clay, making it hard and unworkable. Rohan does not notice the dried, hard clay.",
        "questions": [
            {
                "question": "Does Rohan believe the bag of clay is soft and malleable or hard and unworkable?",
                "true_answer": "Rohan believes the bag of clay is soft and malleable.",
                "wrong_answer": "Rohan believes the bag of clay is hard and unworkable.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4036844157": {
        "narrative": "Leilani is a skilled hula dancer from Hawaii who has been asked to perform at a cultural event. Leilani wants to wear her favorite traditional hula skirt made of ti leaves for the performance. Leilani sees her ti leaf skirt hanging in her closet, appearing to be in good condition. She believes the ti leaf skirt is in good condition and suitable for her performance. While Leilani is away from her room, her younger brother accidentally spills a glass of water near the closet, causing her ti leaf skirt to become wet and wilted. Leilani does not notice the wet and wilted ti leaf skirt.",
        "questions": [
            {
                "question": "Does Leilani believe the ti leaf skirt is in good condition or wet and wilted?",
                "true_answer": "Leilani believes the ti leaf skirt is in good condition.",
                "wrong_answer": "Leilani believes the ti leaf skirt is wet and wilted.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4087659992": {
        "narrative": "Ravi is a fisherman living in a coastal village in India. Ravi wants to catch a large amount of fish to sell at the market and provide for his family. The waters near the shore are calm and full of fish, making it an ideal location for fishing. Ravi believes the calm waters near the shore are full of fish and perfect for fishing. An underwater earthquake occurs, causing the fish to frantically swim away from the coast. Ravi does not sense the earthquake.",
        "questions": [
            {
                "question": "Does Ravi believe the waters near the shore are calm and full of fish, or that the fish have frantically swum away?",
                "true_answer": "Ravi believes the waters near the shore are calm and full of fish.",
                "wrong_answer": "Ravi believes the fish have frantically swum away from the coast.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7391976991": {
        "narrative": "Naledi is a talented South African chef preparing a traditional braai for her friends and family. Naledi wants to make a delicious marinade for the meats and vegetables to be grilled. She takes a bottle of vinegar from the cupboard to mix with other ingredients for the marinade. Naledi believes that the bottle contains vinegar. Her cousin, who was helping in the kitchen earlier, accidentally placed a bottle of water in the vinegar's spot, and Naledi unknowingly grabs the bottle of water instead. Naledi does not notice the water.",
        "questions": [
            {
                "question": "Does Naledi believe the bottle she took from the cupboard contains vinegar or water?",
                "true_answer": "Naledi believes the bottle she took from the cupboard contains vinegar.",
                "wrong_answer": "Naledi believes the bottle she took from the cupboard contains water.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "4077264806": {
        "narrative": "Tanya is a professional baker preparing for a big event at her bakery. She needs to make a large batch of chocolate chip cookies for the guests. She checks the oven timer, which indicates that the cookies have been baking for 15 minutes and need more time. Tanya believes that the cookies are still baking and need more time. Suddenly, a power outage occurs, shutting off the oven and leaving the cookies undercooked. Tanya does not notice the power outage.",
        "questions": [
            {
                "question": "Does Tanya believe the cookies are still baking and need more time or that they are undercooked due to the power outage?",
                "true_answer": "Tanya believes the cookies are still baking and need more time.",
                "wrong_answer": "Tanya believes the cookies are undercooked due to the power outage.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7205403982": {
        "narrative": "Aisha is a marine biologist conducting research on a remote island in the Pacific Ocean. She wants to collect water samples from the ocean to test for microplastics. Aisha sees the water as calm and clear. Aisha believes the water is calm and clear. Suddenly, an underwater volcanic eruption occurs far away, causing the water to become murky and turbulent. Aisha does not notice the change in the water's appearance.",
        "questions": [
            {
                "question": "Does Aisha believe the water is calm and clear or murky and turbulent?",
                "true_answer": "Aisha believes the water is calm and clear.",
                "wrong_answer": "Aisha believes the water is murky and turbulent.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6582270107": {
        "narrative": "Jamila is a marine biologist studying coral reefs in the Maldives. She wishes to collect samples of a specific healthy coral species for her research. The coral she is observing appears to be vibrant and thriving. Jamila believes the coral is in a healthy state. Suddenly, an influx of cold water from a deep ocean current sweeps through the area, causing the coral to become stressed and bleached. Jamila does not notice the sudden change in water temperature.",
        "questions": [
            {
                "question": "Does Jamila believe the coral is healthy or stressed and bleached?",
                "true_answer": "Jamila believes the coral is healthy.",
                "wrong_answer": "Jamila believes the coral is stressed and bleached.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "8980754000": {
        "narrative": "Tariq is at a farmer's market, planning to buy fresh fruits for a fruit salad he wants to make. He aims to find the ripest and juiciest watermelon available. Tariq spots a watermelon with a deep green color and a hollow sound when tapped, indicating it is ripe. He believes the watermelon is ripe and juicy. A mischievous child nearby secretly pokes a tiny hole in the watermelon, causing it to lose some of its juice. Tariq does not notice the child poking the hole in the watermelon.",
        "questions": [
            {
                "question": "Does Tariq believe the watermelon is ripe and juicy or has lost some of its juice?",
                "true_answer": "Tariq believes the watermelon is ripe and juicy.",
                "wrong_answer": "Tariq believes the watermelon has lost some of its juice.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "7097253188": {
        "narrative": "Kieran is a marine biologist, conducting research on a remote island. He wants to collect water samples from the ocean to analyze the presence of microplastics. Kieran notices that the water appears to be crystal clear and unpolluted. Kieran believes the water is unpolluted and clear. Suddenly, a passing ship releases a large amount of waste, turning the water murky and polluted. Kieran does not witness the ship dumping waste into the water.",
        "questions": [
            {
                "question": "Does Kieran believe the water is clear and unpolluted or murky and polluted?",
                "true_answer": "Kieran believes the water is clear and unpolluted.",
                "wrong_answer": "Kieran believes the water is murky and polluted.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6299439222": {
        "narrative": "Priya is an archaeologist working on a dig site in Egypt, searching for a hidden chamber in a newly discovered pyramid. She wants to find an ancient artifact rumored to be in the chamber. Priya has only explored half of the pyramid so far. Priya believes the hidden chamber is still unexplored. Meanwhile, her colleague Ahmed accidentally discovers the chamber while she is away, removing the artifact for further analysis. Priya does not learn about Ahmed's discovery from another team member.",
        "questions": [
            {
                "question": "Does Priya believe the hidden chamber and artifact are still undiscovered or already found?",
                "true_answer": "Priya believes the hidden chamber and artifact are still undiscovered.",
                "wrong_answer": "Priya believes the hidden chamber and artifact have already been found.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "1914667021": {
        "narrative": "Beatrice is a talented violinist, preparing for an important performance at a prestigious concert hall. She wants to ensure that her violin is perfectly tuned before she goes on stage. Beatrice checks the tuning of her violin and it sounds perfectly in tune. She believes her violin is properly tuned. While Beatrice is in her dressing room, an assistant accidentally knocks the violin off the table, causing it to go out of tune. Beatrice does not see that her violin has been knocked off the table.",
        "questions": [
            {
                "question": "Does Beatrice believe her violin is perfectly tuned or out of tune?",
                "true_answer": "Beatrice believes her violin is perfectly tuned.",
                "wrong_answer": "Beatrice believes her violin is out of tune.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    },
    "6142946361": {
        "narrative": "Santiago is a fisherman on the coast of Chile. Santiago wants to catch a large amount of fish today to sell at the market. He sees that the fishing net he is using is in excellent condition. Santiago believes that the fishing net is in perfect shape for a successful catch. While Santiago is not paying attention, a sharp rock on the ocean floor tears a large hole in the fishing net. Santiago does not notice the large hole in the fishing net.",
        "questions": [
            {
                "question": "Does Santiago believe the fishing net is in excellent condition or torn with a large hole?",
                "true_answer": "Santiago believes the fishing net is in excellent condition.",
                "wrong_answer": "Santiago believes the fishing net is torn with a large hole.",
                "q_type": "1_forward_belief_false_belief",
                "reduced_question": "Which of the following statements is true?"
            }
        ]
    }
}