[
    "Emily dislikes the plum. Nathan, Evelyn, William, Emily and Jacob entered the pantry. The plum is in the red pantry. Nathan made no movements and stayed in the pantry for 1 minute. Evelyn saw a monkey. Nathan exited the pantry. Evelyn moved the plum to the green bucket. Evelyn exited the pantry. William made no movements and stayed in the pantry for 1 minute. William exited the pantry. Emily made no movements and stayed in the pantry for 1 minute. Nathan saw a mouse. Emily exited the pantry. Jacob moved the plum to the red pantry. Jacob exited the pantry. Nathan, Evelyn, William, Emily and Jacob entered the waiting room.",
    "Evelyn, Isabella, Nathan, Ava and Lily entered the hallway. The melon is in the blue container. Evelyn moved the melon to the green treasure chest. Evelyn exited the hallway. Lily dislikes the cucumber. Isabella made no movements and stayed in the hallway for 1 minute. Isabella exited the hallway. Nathan moved the melon to the blue treasure chest. Nathan exited the hallway. Ava made no movements and stayed in the hallway for 1 minute. Ava exited the hallway. Lily made no movements and stayed in the hallway for 1 minute. Ava dislikes the spinach. Lily exited the hallway. Evelyn, Isabella, Nathan, Ava and Lily entered the waiting room. Nathan, Isabella and Evelyn entered the cellar. The spinach is in the red crate. Nathan moved the spinach to the blue bottle. Nathan exited the cellar. Isabella moved the spinach to the red bottle. Isabella exited the cellar. Nathan lost his phone. Evelyn made no movements and stayed in the cellar for 1 minute. Evelyn exited the cellar. Nathan, Isabella and Evelyn entered the waiting room.",
"William, Jack, Charlotte, Noah and Hannah entered the hall. Noah saw a monkey. The carrot is in the red basket. William made no movements and stayed in the hall for 1 minute. William exited the hall. Hannah saw a mouse. Jack made no movements and stayed in the hall for 1 minute. Jack exited the hall. Charlotte made no movements and stayed in the hall for 1 minute. Charlotte exited the hall. Charlotte dislikes the tomato. Noah moved the carrot to the green envelope. Noah exited the hall. Hannah moved the carrot to the red basket. Hannah exited the hall. William, Jack, Charlotte, Noah and Hannah entered the waiting room. Charlotte publicly claimed that carrot is in the green envelope. Hannah privately told Charlotte that the carrot is in the blue container."
]
